[
    {
        "title": "Unlocking human-robot synergy: The power of intent communication in warehouse robotics",
        "id": "tuWDm5kAAAAJ:Z5m8FVwuT1cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Z5m8FVwuT1cC",
        "authors": [
            "Sriparvathi Shaji Bhattathiri",
            "Anton Bogovik",
            "Masoud Abdollahi",
            "Clark Hochgraf",
            "Michael E Kuhl",
            "Amlan Ganguly",
            "Andres Kwasinski",
            "Ehsan Rashedi"
        ],
        "pub_source": "Applied Ergonomics",
        "pub_date": "2024/5/1",
        "description": "As autonomous mobile robots (AMR) are introduced into workspace environments shared with people, effective human-robot communication is critical to the prevention of injury while maintaining a high level of productivity. This research presents an empirical study that evaluates four alternative methods for communicating between an autonomous mobile robot and a human at a warehouse intersection. The results demonstrate that using an intent communication system for human-AMR interaction improves objective measures of productivity (task time) and subjective metrics of trust and comfort."
    },
    {
        "title": "Direct server-to-server wireless data center network and method thereof",
        "id": "tuWDm5kAAAAJ:eflP2zaiRacC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:eflP2zaiRacC",
        "authors": [
            "A Ganguly",
            "M Kwon",
            "A Kwasinski",
            "SA Mamun",
            "SG Umamaheswaran"
        ],
        "pub_source": "US Patent 11,950,304",
        "pub_date": "2024/4/2",
        "description": "A wireless server-to-server datacenter network architecture uses wireless links to eliminate the need for power-hungry switching fabric of traditional fat-tree based datacenter networks. The server-to-server wireless datacenter network (S2S-WiDCN) requires Line-of-Sight (LoS) between servers to establish direct communication links. Utilizing this LoS links, a horizontal-first routing algorithm is developed which, will establish fast communication links between any pair of communicating servers in the data center. The wireless links can be realized in millimeter-wave (such as 30, 60, 120 GHz) or THz (such as 300 GHz) frequency bands. The use of antenna-arrays to create beam-steering towards communicating servers is necessary to establish the direct server-to-server links. In the presence of an obstruction such as an IT technician, the LoS between communicating servers may be blocked. To address this issue, an …",
        "citations": 3
    },
    {
        "title": "ReApprox-PIM: Reconfigurable Approximate Look-Up-Table (LUT)-Based Processing-in-Memory (PIM) Machine Learning Accelerator",
        "id": "tuWDm5kAAAAJ:ML0RJ9NH7IQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ML0RJ9NH7IQC",
        "authors": [
            "Sathwika Bavikadi",
            "Purab Ranjan Sutradhar",
            "Mark Indovina",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
        "pub_date": "2024/2/22",
        "description": "Convolutional neural networks (CNNs) have achieved significant success in various applications. Numerous hardware accelerators are introduced to accelerate CNN execution with improved energy efficiency compared to traditional software implementations. Despite the achieved success, deploying traditional hardware accelerators for bulky CNNs on current and emerging smart devices is impeded by limited resources, including memory, power, area, and computational capabilities. Recent works introduced processing-in-memory (PIM), a non-Von-Neumann architecture, which is a promising approach to tackle the problem of data movement between logic and memory blocks. However, as observed from the literature, the existing PIM architectures cannot congregate all the computational operations due to limited programmability and flexibility. Furthermore, the capabilities of the PIM are challenged by the limited …"
    },
    {
        "title": "Reconfigurable Processing-in-Memory Architecture for Data Intensive Applications",
        "id": "tuWDm5kAAAAJ:BwyfMAYsbu0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:BwyfMAYsbu0C",
        "authors": [
            "Sathwika Bavikadi",
            "Purab Ranjan Sutradhar",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "2024 37th International Conference on VLSI Design and 2024 23rd International Conference on Embedded Systems (VLSID)",
        "pub_date": "2024/1/6",
        "description": "Emerging applications reliant on deep neural networks (DNNs) and convolutional neural networks (CNNs) demand substantial data for computation and analysis. Deploying DNNs and CNNs often leads to resource constraints, data movement overheads between memory and compute units. Architectural paradigms like Processing-in-Memory (PIM) have emerged to mitigate these challenges. However, existing PIM architectures necessitate trade-offs involving power, performance, area, energy efficiency, and programmability. Our proposed solution focuses on achieving higher energy efficiency while preserving programmability and flexibility. We introduce a novel multi-core reconfigurable architecture with fine-grained integration within DRAM sub-arrays, resulting in superior performance and energy-efficiency compared to conventional PIM architectures. Each core in our design comprises multiple processing …",
        "citations": 1
    },
    {
        "title": "Neural network execution using nicked DNA and microfluidics",
        "id": "tuWDm5kAAAAJ:zLWjf1WUPmwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:zLWjf1WUPmwC",
        "authors": [
            "Arnav Solanki",
            "Zak Griffin",
            "Purab Ranjan Sutradhar",
            "Karisha Pradhan",
            "Caiden Merritt",
            "Amlan Ganguly",
            "Marc Riedel"
        ],
        "pub_source": "Plos one",
        "pub_date": "2023/10/19",
        "description": "DNA has been discussed as a potential medium for data storage. Potentially it could be denser, could consume less energy, and could be more durable than conventional storage media such as hard drives, solid-state storage, and optical media. However, performing computations on the data stored in DNA is a largely unexplored challenge. This paper proposes an integrated circuit (IC) based on microfluidics that can perform complex operations such as artificial neural network (ANN) computation on data stored in DNA. We envision such a system to be suitable for highly dense, throughput-demanding bio-compatible applications such as an intelligent Organ-on-Chip or other biomedical applications that may not be latency-critical. It computes entirely in the molecular domain without converting data to electrical form, making it a form of in-memory computing on DNA. The computation is achieved by topologically modifying DNA strands through the use of enzymes called nickases. A novel scheme is proposed for representing data stochastically through the concentration of the DNA molecules that are nicked at specific sites. The paper provides details of the biochemical design, as well as the design, layout, and operation of the microfluidics device. Benchmarks are reported on the performance of neural network computation."
    },
    {
        "title": "Look-up table containing processor-in-memory cluster for data-intensive applications",
        "id": "tuWDm5kAAAAJ:XD-gHx7UXLsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:XD-gHx7UXLsC",
        "authors": [
            "A Ganguly",
            "SMP Dinakarrao",
            "M Connolly",
            "PR Sutradhar",
            "S Bavikadi",
            "..."
        ],
        "pub_source": "US Patent 11,775,312",
        "pub_date": "2023/10/3",
        "description": "A processing element includes a PIM cluster configured to read data from and write data to an adjacent DRAM subarray, wherein the PIM cluster has a plurality of processing cores, each processing core of the plurality of processing cores containing a look-up table, and a router connected to each processing core, wherein the router is configured to communicate data among each processing core; and a controller unit configured to communicate with the router, wherein the controller unit contains an executable program of operational decomposition algorithms. The look-up tables can be programmable. A DRAM chip including a plurality of DRAM banks, each DRAM bank having a plurality of interleaved DRAM subarrays and a plurality of the PIM clusters configured to read data from and write data to an adjacent DRAM subarray is disclosed."
    },
    {
        "title": "Evaluation of 60 GHz Wireless Connectivity for an Automated Warehouse Suitable for Industry 4.0",
        "id": "tuWDm5kAAAAJ:URolC5Kub84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:URolC5Kub84C",
        "authors": [
            "Rahul Gulia",
            "Abhishek Vashist",
            "Amlan Ganguly",
            "Clark Hochgraf",
            "Michael E Kuhl"
        ],
        "pub_source": "Information",
        "pub_date": "2023/9/15",
        "description": "The fourth industrial revolution focuses on the digitization and automation of supply chains resulting in a significant transformation of methods for goods production and delivery systems. To enable this, automated warehousing is demanding unprecedented vehicle-to-vehicle and vehicle-to-infrastructure communication rates and reliability. The 60 GHz frequency band can deliver multi-gigabit/second data rates to satisfy the increasing demands of network connectivity by smart warehouses. In this paper, we aim to investigate the network connectivity in the 60 GHz millimeter-wave band inside an automated warehouse. A key hindrance to robust and high-speed network connectivity, especially, at mmWave frequencies stems from numerous non-line-of-sight (nLOS) paths in the transmission medium due to various interacting objects such as metal shelves and storage boxes. The continual change in the warehouse storage configuration significantly affects the multipath reflected components and shadow fading effects, thus adding complexity to establishing stable, yet fast, network coverage. In this study, network connectivity in an automated warehouse is analyzed at 60 GHz using Network Simulator-3 (NS-3) channel simulations. We examine a simple warehouse model with several metallic shelves and storage materials of standard proportions. Our investigation indicates that the indoor warehouse network performance relies on the line-of-sight and nLOS propagation paths, the existence of reflective materials, and the autonomous material handling agents present around the access point (AP). In addition, we discuss the network performance under …"
    },
    {
        "title": "Address Obfuscation to Protect against Hardware Trojans in Network-on-Chips",
        "id": "tuWDm5kAAAAJ:uWiczbcajpAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:uWiczbcajpAC",
        "authors": [
            "Thomas Mountford",
            "Abhijitt Dhavlle",
            "Andrew Tevebaugh",
            "Naseef Mansoor",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "Journal of Low Power Electronics and Applications",
        "pub_date": "2023/9/6",
        "description": "In modern computing, which relies on the interconnection of networks used in many/multi-core systems, any system can be critically subverted if the interconnection is compromised. This can be done in a multitude of ways, but the threat of a hardware Trojan (HT) being injected into a system is particularly prevalent due to the increase in third-party manufacturers for system-on-chip (SoC) designs. With a local injection of an HT in an SoC, an adversary can gain access to information about applications running on the system by revealing specific communications of the SoC, and the network-on-chip (NoC) as a whole. This heavily compromises the system and gives information to the attacker, which can lead to more tailored, compromising attacks. In this paper, we demonstrate an HT that exploits communication patterns inside an SoC to reveal applications that are running on an NoC with multi/many-core processors. This is performed by leaking packet counts, after which the attacker then uses machine learning techniques to identify applications running on processors, and the SoC as a whole. We also propose a LUT-based obfuscation technique to limit the information available to the hardware Trojan. Our results indicate that this obfuscation method can reduce the accuracy of this attack from 99% to <8% in multi/many-core systems."
    },
    {
        "title": "2023 IEEE 36th International System-on-Chip Conference (SOCC)",
        "id": "tuWDm5kAAAAJ:AvfA0Oy_GE0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:AvfA0Oy_GE0C",
        "authors": [
            "Jürgen Becker",
            "Andrew Marshall",
            "Tanja Harbaum",
            "Amlan Ganguly",
            "Fahad Siddiqui",
            "Kieran McLaughlin"
        ],
        "pub_source": "",
        "pub_date": "2023/9/5",
        "description": "SOCC 2023 Cover Page Page 1 i PROCEEDINGS 2023 IEEE 36th International System-on-Chip \nConference (SOCC) September 05-08, 2023 Santa Clara, CA, USA Editors Jürgen Becker \nKarlsruhe Institute of Technology, Germany Andrew Marshall University of Texas, Dallas, \nUSA Tanja Harbaum Karlsruhe Institute of Technology, Germany Amlan Ganguly Rochester \nInstitute of Technology, USA Fahad Siddiqui NVIDIA Corporation, UK Kieran McLaughlin \nQueen’s University Belfast, UK The SOC Conference is sponsored by the IEEE Circuits and \nSystems Society 2023 IEEE 36th International System-on-Chip Conference (SOCC) | 979-8-3503-0011-6/23/$31.00 \n©2023 IEEE | DOI: 10.1109/SOCC58585.2023.10256953 Page 2 ii 2023 IEEE 36th \nInternational System-on-Chip Conference (SOCC) Digest of Technical Papers Papers have \nbeen printed without editing as received from the authors. Copyright and Reprint …"
    },
    {
        "title": "Guest Editors Introduction: Special Issue on Network-on-Chip Architectures of the Future (NoCArc)",
        "id": "tuWDm5kAAAAJ:vDijr-p_gm4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:vDijr-p_gm4C",
        "authors": [
            "Amlan Ganguly",
            "Salvatore Monteleone",
            "Diana Goehringer",
            "Cristinel Ababei"
        ],
        "pub_source": "ACM Journal on Emerging Technologies in Computing Systems 19 (3), 1-3",
        "pub_date": "2023/7/27",
        "description": "As the number of cores integrated into the same integrated circuit increases, the role of the Network-on-Chip (NoC)—as the communication infrastructure—becomes increasingly more important. Next-generation many-core processor systems continue to face communication-related scalability problems, which are further exacerbated by ultra-deep sub-micron effects induced by the next silicon technology nodes. The emergence of novel computing paradigms consisting of accelerators, quantum computing, DNA computing storage technologies, and optical computing can have deep and far-reaching implications on the future of interconnects. Integration platforms such as interposers and processing-in-memory are also predicted to influence the course of NoC research. Furthermore, applications such as big data, artificial intelligence, deep learning, and cybersecurity will also impact the future of NoC research. With the …"
    },
    {
        "title": "3DL-PIM: A Look-up Table oriented Programmable Processing in Memory Architecture based on the 3-D Stacked Memory for Data-Intensive Applications",
        "id": "tuWDm5kAAAAJ:epqYDVWIO7EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:epqYDVWIO7EC",
        "authors": [
            "Purab Ranjan Sutradhar",
            "Sathwika Bavikadi",
            "Sai Manoj Pudukotai Dinakarrao",
            "Mark A Indovina",
            "Amlan Ganguly"
        ],
        "pub_source": "IEEE Transactions on Emerging Topics in Computing",
        "pub_date": "2023/7/12",
        "description": "Memory-centric computing systems have demonstrated superior performance and efficiency in memory-intensive applications compared to state-of-the-art CPUs and GPUs. 3-D stacked DRAM architectures unlock higher I/O data bandwidth than the traditional 2-D memory architecture and therefore are better suited for incorporating memory-centric processors. However, merely integrating high-precision ALUs in the 3-D stacked memory does not ensure an optimized design since such a design can only achieve a limited utilization of the internal bandwidth of a memory chip and limited operational parallelization. To address this, we propose 3DL-PIM, a 3-D stacked memory-based Processing in Memory (PIM) architecture that locates a plurality of Look-up Table (LUT)-based low-footprint Processing Elements (PE) within the memory banks in order to achieve high parallel computing performance by maximizing data …",
        "citations": 3
    },
    {
        "title": "FlutPIM: A Look-up Table-based Processing in Memory Architecture with Floating-point Computation Support for Deep Learning Applications",
        "id": "tuWDm5kAAAAJ:uc_IGeMz5qoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:uc_IGeMz5qoC",
        "authors": [
            "Purab Ranjan Sutradhar",
            "Sathwika Bavikadi",
            "Mark Indovina",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "Proceedings of the Great Lakes Symposium on VLSI 2023",
        "pub_date": "2023/6/5",
        "description": "Processing-in-Memory (PIM) has shown great potential for a wide range of data-driven applications, especially Deep Learning and AI. However, it is a challenge to facilitate the computational sophistication of a standard processor (i.e. CPU or GPU) within the limited scope of a memory chip without contributing significant circuit overheads. To address the challenge, we propose a programmable LUT-based area-efficient PIM architecture capable of performing various low-precision floating point (FP) computations using a novel LUT-oriented operand-decomposition technique. We incorporate such compact computational units within the memory banks in a large count to achieve impressive parallel processing capabilities, up to 4x higher than state-of-the-art FP-capable PIM. Additionally, we adopt a highly-optimized low-precision FP format that maximizes computational performance at a minimal compromise of …",
        "citations": 2
    },
    {
        "title": "Defense against on-chip trojans enabling traffic analysis attacks based on machine learning and data augmentation",
        "id": "tuWDm5kAAAAJ:yB1At4FlUx8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:yB1At4FlUx8C",
        "authors": [
            "Abhijitt Dhavlle",
            "M Meraj Ahmed",
            "Naseef Mansoor",
            "Kanad Basu",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
        "pub_date": "2023/5/22",
        "description": "Modern computing systems involve huge data exchange across various sections of the processing system. To facilitate this, network-on-chip (NoC) serves as a crucial infrastructure that connects the processing cores to memory, peripherals, etc. The system could be put at great risk should the NoC system become compromised. The NoCs are used in multi/many-core processors; this domain is experiencing increased threats because of hardware Trojan (HT) embedded in the multicore processing systems due to the presence of third-party entities in the system-on-chip (SoC) design pipeline. Protecting user and system level privacy becomes important in such multi core systems to enable trust. By embedding an HT in an NoC, the adversary can snoop on important insights regarding the applications executing on the system or the user profile information. An attack of such calibre can compromise privacy, thereby …",
        "citations": 2
    },
    {
        "title": "Towards Improving the Human-Robot Communication in Intelligent Materials Handling Environments",
        "id": "tuWDm5kAAAAJ:ipzZ9siozwsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ipzZ9siozwsC",
        "authors": [
            "Sriparvathi Shaji Bhattathiri",
            "Anton Bogovik",
            "Masoud Abdollahi",
            "Clark Hochgraf",
            "Michael Kuhl",
            "Amlan Ganguly",
            "Andres Kwasinski",
            "Ehsan Rashedi"
        ],
        "pub_source": "IISE Annual Conference and Expo",
        "pub_date": "2023/5/21"
    },
    {
        "title": "Heterogeneous Multi-Functional Look-Up-Table-based Processing-in-Memory Architecture for Deep Learning Acceleration",
        "id": "tuWDm5kAAAAJ:0KyAp5RtaNEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:0KyAp5RtaNEC",
        "authors": [
            "Sathwika Bavikadi",
            "Purab Ranjan Sutradhar",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "2023 24th International Symposium on Quality Electronic Design (ISQED)",
        "pub_date": "2023/4/5",
        "description": "Emerging applications including deep neural networks (DNNs) and convolutional neural networks (CNNs) employ massive amounts of data to perform computations and data analysis. Such applications often lead to resource constraints and impose large overheads in data movement between memory and compute units. Several architectures such as Processing-in-Memory (PIM) are introduced to alleviate the bandwidth bottlenecks and inefficiency of traditional computing architectures. However, the existing PIM architectures represent a trade-off between power, performance, area, energy efficiency, and programmability. To better achieve the energy-efficiency and flexibility criteria simultaneously in hardware accelerators, we introduce a multi-functional look-up-table (LUT)-based reconfigurable PIM architecture in this work. The proposed architecture is a many-core architecture, each core comprises processing …",
        "citations": 5
    },
    {
        "title": "Accelerating Adversarial Attack using Process-in-Memory Architecture",
        "id": "tuWDm5kAAAAJ:nrtMV_XWKgEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:nrtMV_XWKgEC",
        "authors": [
            "Shiyi Liu",
            "Sathwika Bavikadi",
            "Tanmoy Sen",
            "Haiying Shen",
            "Purab Ranjan Sutradhar",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao",
            "Brian L Smith"
        ],
        "pub_source": "2022 18th International Conference on Mobility, Sensing and Networking (MSN)",
        "pub_date": "2022/12/14",
        "description": "Recent research has demonstrated that machine learning algorithms are vulnerable to adversarial attacks, in which small but carefully crafted input perturbations can lead to algorithm failure. It has been demonstrated that certain adversarial attack algorithms are capable of producing these types of perturbations. These attack methods are inapplicable when the attack must be generated in near real time. The use of a hardware accelerator, such as a Process-in-Memory (PIM) archi-tecture, is a potential method for addressing this issue. The PIM architecture is regarded as a superior option for data-intensive applications such as solving optimization problems and Deep Neural Networks (DNN) due to its capacity for ultra-low-latency parallel processing. However, implementing an adversarial attack algorithm directly on the PIM platform is inefficient due to the PIM architecture's complexity and overhead costs. To …",
        "citations": 1
    },
    {
        "title": "Implementation and evaluation of deep neural networks in commercially available processing in memory hardware",
        "id": "tuWDm5kAAAAJ:t7zJ5fGR-2UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:t7zJ5fGR-2UC",
        "authors": [
            "Prangon Das",
            "Purab Ranjan Sutradhar",
            "Mark Indovina",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "2022 IEEE 35th International System-on-Chip Conference (SOCC)",
        "pub_date": "2022/9/5",
        "description": "Deep Neural Networks (DNNs) are often associated with a large number of data-parallel computations. Therefore, data-centric computing paradigms, such as Processing in Memory (PIM), are being widely explored for DNN acceleration applications. A recent PIM architecture, developed and commercialized by the UPMEM company, has demonstrated impressive performance boost over traditional CPU-based systems for a wide range of data-parallel applications. However, the application domain of DNN acceleration is yet to be explored on this PIM platform. In this work, we present successful implementations of DNNs on the UPMEM PIM system. We explore multiple operation mapping schemes with different optimization goals and accelerate two CNN algorithms using these schemes. Based on the data achieved from the physical implementation of the DNNs on the UPMEM system, we compare the performance …",
        "citations": 7
    },
    {
        "title": "Polar: Performance-aware on-device learning capable programmable processing-in-memory architecture for low-power ml applications",
        "id": "tuWDm5kAAAAJ:9Nmd_mFXekcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:9Nmd_mFXekcC",
        "authors": [
            "Sathwika Bavikadi",
            "Purab Ranjan Sutradhar",
            "Mark A Indovina",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "2022 25th Euromicro Conference on Digital System Design (DSD)",
        "pub_date": "2022/8/31",
        "description": "Improving the performance of real-time Traffic Sign Recognition (TSR) applications using Deep Learning (DL) algorithms such as Convolutional Neural Networks (CNN) on software platforms is challenging due to the sheer computational complexity of these algorithms. In this work, we adopt a hardware-software combined approach to address this issue. We introduce a data-centric Processing-in-Memory (PIM) architecture that leverages Look-up-Table (LUT)-based processing for minimal data movement and superior performance and efficiency. Despite the superior performance, the limited available memory in PIM makes it complex to deploy deep CNNs. We propose merging CNN layers in this work to meet the limited resource constraints. One specific challenge in the TSR is the continuous change in the deployed environment, which makes a CNN model train over static data, leading to performance degradation …",
        "citations": 5
    },
    {
        "title": "Guest Editors’ Introduction: Special Issue on Benchmarking Machine Learning Systems and Applications",
        "id": "tuWDm5kAAAAJ:-_dYPAW6P2MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:-_dYPAW6P2MC",
        "authors": [
            "Sai Manoj Pudukotai Dinakarrao",
            "Arun Joseph",
            "Amlan Ganguly",
            "Anand Haridass",
            "Vijay Janappa Reddi"
        ],
        "pub_source": "IEEE Design & Test",
        "pub_date": "2022/4/21",
        "description": "Machine learning (ML)  is adopted into a wide range of applications. The popularity and adoption came because of performance and capability to deploy in real-world systems and the ease of use. Given a wide range of works proposed on ML, ranging from the ML learning methodology to the design of hardware accelerators, different works focus on various aspects, depending on the application requirements. For a fair comparison and benefit of the society, benchmarking of the ML applications and performance is nontrivial. Such a benchmarking will also enable the community to analyze and fairly compare the solutions."
    },
    {
        "title": "A survey on machine learning accelerators and evolutionary hardware platforms",
        "id": "tuWDm5kAAAAJ:35r97b3x0nAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:35r97b3x0nAC",
        "authors": [
            "Sathwika Bavikadi",
            "Abhijitt Dhavlle",
            "Amlan Ganguly",
            "Anand Haridass",
            "Hagar Hendy",
            "Cory Merkel",
            "Vijay Janapa Reddi",
            "Purab Ranjan Sutradhar",
            "Arun Joseph",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "IEEE Design & Test",
        "pub_date": "2022/3/21",
        "description": "Advanced computing systems have long been enablers for breakthroughs in artificial intelligence (AI) and machine learning (ML) algorithms, either through sheer computational power or form-factor miniaturization. However, as AI/ML algorithms become more complex and the size of data sets increases, existing computing platforms are no longer sufficient to bridge the gap between algorithmic innovation and hardware design. This article presents a survey about various ML accelerators.",
        "citations": 36
    },
    {
        "title": "Interconnects for DNA, quantum, in-memory, and optical computing: insights from a panel discussion",
        "id": "tuWDm5kAAAAJ:_Re3VWB3Y0AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:_Re3VWB3Y0AC",
        "authors": [
            "Amlan Ganguly",
            "Sergi Abadal",
            "Ishan Thakkar",
            "Natalie Enright Jerger",
            "Marc Riedel",
            "Masoud Babaie",
            "Rajeev Balasubramonian",
            "Abu Sebastian",
            "Sudeep Pasricha",
            "Baris Taskin"
        ],
        "pub_source": "IEEE micro",
        "pub_date": "2022/2/14",
        "description": "The computing world is witnessing a proverbial Cambrian explosion of emerging paradigms propelled by applications, such as artificial intelligence, big data, and cybersecurity. The recent advances in technology to store digital data inside a deoxyribonucleic acid (DNA) strand, manipulate quantum bits (qubits), perform logical operations with photons, and perform computations inside memory systems are ushering in the era of emerging paradigms of DNA computing, quantum computing, optical computing, and in-memory computing. In an orthogonal direction, research on interconnect design using advanced electro-optic, wireless, and microfluidic technologies has shown promising solutions to the architectural limitations of traditional von-Neumann computers. In this article, experts present their comments on the role of interconnects in the emerging computing paradigms, and discuss the potential use of chiplet …",
        "citations": 19
    },
    {
        "title": "DQN Based Exit Selection in Multi-Exit Deep Neural Networks for Applications Targeting Situation Awareness",
        "id": "tuWDm5kAAAAJ:evX43VCCuoAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:evX43VCCuoAC",
        "authors": [
            "Abhishek Vashist",
            "Sharan Vidash Vidya Shanmugham",
            "Amlan Ganguly",
            "Sai Manoj PD"
        ],
        "pub_source": "2022 IEEE International Conference on Consumer Electronics (ICCE)",
        "pub_date": "2022/1/7",
        "description": "Smart infrastructure targeting situation awareness for first responders enables intelligent and faster response time. Such an application requires an edge device to process information. The edge hardware is limited by computation capability for running Deep Neural Networks (DNNs). Multi-exit DNNs are used to provide static exit selection for faster inference. We propose using Deep Q Network (DQN) based technique for dynamic exit selection in multi-exit DNNs. The DQN learns an optimal policy using hardware and multi-exit DNN based state information. Our system achieves performance improvement with 63.5 % decrease in inference time, 33 % reduction in energy and classifies 2.2 x more inputs.",
        "citations": 3
    },
    {
        "title": "Evaluation of Wireless Connectivity in an Automated Warehouse at 60 GHz",
        "id": "tuWDm5kAAAAJ:2KloaMYe4IUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:2KloaMYe4IUC",
        "authors": [
            "Rahul Singh Gulia",
            "Sayed Ashraf Mamun",
            "Abhishek Vashist",
            "Amlan Ganguly",
            "Clark Hochgraf",
            "Andres Kwasinski",
            "Michael E Kuhl"
        ],
        "pub_source": "2022 IEEE International Conference on Consumer Electronics (ICCE)",
        "pub_date": "2022/1/7",
        "description": "Industry 4.0 autonomous material handling agents demand high-speed indoor network connectivity in warehouses. Wireless interconnections in the 60 GHz bands have been demonstrated to provide multi-gigabit/second data rates in indoor environments. This paper aims to investigate network connectivity in the 60 GHz millimeter-wave band inside an automated warehouse. The challenges to robust and high-speed network connectivity, especially, at mmWave frequencies stem from lots of non-line-of-sight (nLOS) paths between transmitter and receivers caused by obstructing structures such as metal shelves and boxes. The added complexity of dynamic variations in the configuration of the warehouse and the multipath reflections and shadow-fading effects add to the challenges of establishing a stable and reliable yet fast network coverage. In this paper, we evaluate the performance of a 60 GHz wireless network …",
        "citations": 2
    },
    {
        "title": "Flexible instruction set architecture for programmable look-up table based processing-in-memory",
        "id": "tuWDm5kAAAAJ:ZfRJV9d4-WMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ZfRJV9d4-WMC",
        "authors": [
            "Mark Connolly",
            "Purab Ranjan Sutradhar",
            "Mark Indovina",
            "Amlan Ganguly"
        ],
        "pub_source": "2021 IEEE 39th International Conference on Computer Design (ICCD)",
        "pub_date": "2021/10/24",
        "description": "Processing in Memory (PIM) is a recent novel computing paradigm that is still in its nascent stage of development. Therefore, there has been an observable lack of standardized and modular Instruction Set Architectures (ISA) for the PIM devices. In this work, we present the design of an ISA which is primarily aimed at a recent programmable Look-up Table (LUT) based PIM architecture. Our ISA performs the three major tasks of i) controlling the flow of data between the memory and the PIM units, ii) reprogramming the LUTs to perform various operations required for a particular application, and iii) executing sequential steps of operation within the PIM device. A microcoded architecture of the Controller/Sequencer unit ensures minimum circuit overhead as well as offers programmability to support any custom operation. We provide a case study of CNN inferences, large matrix multiplications, and bitwise computations …",
        "citations": 1
    },
    {
        "title": "An ultra-efficient look-up table based programmable processing in memory architecture for data encryption",
        "id": "tuWDm5kAAAAJ:tKAzc9rXhukC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:tKAzc9rXhukC",
        "authors": [
            "Purab Ranjan Sutradhar",
            "Kanad Basu",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "2021 IEEE 39th International Conference on Computer Design (ICCD)",
        "pub_date": "2021/10/24",
        "description": "Processing in Memory (PIM), a non-von Neumann computing paradigm, has emerged as a faster and more efficient alternative to the traditional computing devices for data-centric applications such as Data Encryption. In this work, we present a novel PIM architecture implemented using programmable Lookup Tables (LUT) inside a DRAM chip to facilitate massively parallel and ultra-efficient data encryption with the Advanced Encryption Standard (AES) algorithm. Its LUT-based architecture replaces logic-based computations with LUT ‘look-ups’ to minimize power consumption and operational latency. The proposed PIM architecture is organized as clusters of homogeneous, interconnected LUTs that can be dynamically programmed to execute operations required for performing AES encryption. Our simulations show that the proposed PIM architecture can offer up to 14.6× and 1.8× higher performance compared to …",
        "citations": 7
    },
    {
        "title": "KF-Loc: A Kalman filter and machine learning integrated localization system using consumer-grade millimeter-wave hardware",
        "id": "tuWDm5kAAAAJ:Fu2w8maKXqMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Fu2w8maKXqMC",
        "authors": [
            "Abhishek Vashist",
            "Maojia Patrick Li",
            "Amlan Ganguly",
            "Sai Manoj PD",
            "Clark Hochgraf",
            "Raymond Ptucha",
            "Andres Kwasinski",
            "Michael E Kuhl"
        ],
        "pub_source": "IEEE Consumer Electronics Magazine",
        "pub_date": "2021/7/30",
        "description": "With the ever-increasing demands of e-commerce, the need for smarter warehousing is increasing exponentially. Such warehouses require industry automation beyond Industry 4.0. In this work, we use consumer-grade millimeter-wave (mmWave) equipment to enable fast, and low-cost implementation of our localization system. However, the consumer-grade mmWave routers suffer from coarse-grained channel state information due to cost-effective antenna array design limiting the accuracy of localization systems. To address these challenges, we present a machine learning (ML) and Kalman filter (KF) integrated localization system (KF-Loc). The ML model learns the complex wireless features for predicting the static position of the robot. When in dynamic motion, the static ML estimates suffer from position mispredictions, resulting in loss of accuracy. To overcome the loss in accuracy, we design and integrate a KF …",
        "citations": 8
    },
    {
        "title": "upim: Performance-aware online learning capable processing-in-memory",
        "id": "tuWDm5kAAAAJ:JQOojiI6XY0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:JQOojiI6XY0C",
        "authors": [
            "Sathwika Bavikadi",
            "Purab Ranjan Sutradhar",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "2021 IEEE 3rd International Conference on Artificial Intelligence Circuits and Systems (AICAS)",
        "pub_date": "2021/6/6",
        "description": "Machine learning and AI-based automated systems are gaining increasing attention for real-time intelligent applications by virtue of a superior co-ordination between the software and the hardware within these systems. Although the majority of the automated systems are implementing Convolutional neural networks (CNNs), and Deep Neural Networks (DNNs) on the hardware with impressive accuracy, a significant amount of cost is associated with data movement in these platforms. Recent advancements in processing-in-memory (PIM), a non-von Neumann computing paradigm, have proven to be very effective in minimizing data communication overheads by performing computations within the memory chip. However, these devices are primarily designed as inference engines and therefore have not been adequately investigated for real-time learning capabilities for applications in changing environments. In this …",
        "citations": 9
    },
    {
        "title": "What can a remote access hardware trojan do to a network-on-chip?",
        "id": "tuWDm5kAAAAJ:1yQoGdGgb4wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:1yQoGdGgb4wC",
        "authors": [
            "M Meraj Ahmed",
            "Abhijitt Dhavlle",
            "Naseef Mansoor",
            "Sai Manoj Pudukotai Dinakarrao",
            "Kanad Basu",
            "Amlan Ganguly"
        ],
        "pub_source": "2021 IEEE International Symposium on Circuits and Systems (ISCAS)",
        "pub_date": "2021/5/22",
        "description": "Interconnection networks such as Network-on-Chips (NoCs) for multi/many-core processors are critical infrastructure of the system as they enable data communication among the processing cores, caches, memory, and other peripherals. Given the criticality of the interconnects, the system can be severely subverted if the interconnection is compromised. The threat of Hardware Trojans (HTs) penetrating complex hardware systems such as multi/many-core processors are increasing due to the increasing presence of third party players in a System-on-chip (SoC) design. Even by deploying naïve HTs, an adversary can exploit the NoC backbone of the processor and get access to communication patterns in the system. In this paper, we discuss that one or more HTs embedded in the NoC of a multi/many-core processor is capable of leaking sensitive information regarding traffic patterns to an external malicious attacker …",
        "citations": 14
    },
    {
        "title": "Design Space Exploration and Resource Management of Multi/Many-Core Systems",
        "id": "tuWDm5kAAAAJ:hkOj_22Ku90C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:hkOj_22Ku90C",
        "authors": [
            "Amit Kumar Singh",
            "Amlan Ganguly"
        ],
        "pub_source": "MDPI",
        "pub_date": "2021/5/10",
        "description": "The increasing demand of processing a higher number of applications and related data on computing platforms has resulted in reliance on multi-/many-core chips as they facilitate parallel processing. However, there is a desire for these platforms to be energy-efficient and reliable, and they need to perform secure computations for the interest of the whole community. This book provides perspectives on the aforementioned aspects from leading researchers in terms of state-of-the-art contributions and upcoming trends.",
        "citations": 1
    },
    {
        "title": "Look-up-table based processing-in-memory architecture with programmable precision-scaling for deep learning applications",
        "id": "tuWDm5kAAAAJ:N5tVd3kTz84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:N5tVd3kTz84C",
        "authors": [
            "Purab Ranjan Sutradhar",
            "Sathwika Bavikadi",
            "Mark Connolly",
            "Savankumar Prajapati",
            "Mark A Indovina",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "IEEE Transactions on Parallel and Distributed Systems",
        "pub_date": "2021/3/17",
        "description": "Processing in memory (PIM) architecture, with its ability to perform ultra-low-latency parallel processing, is regarded as a more suitable alternative to von Neumann computing architectures for implementing data-intensive applications such as Deep Neural Networks (DNN) and Convolutional Neural Networks (CNN). In this article, we present a Look-up Table (LUT) based PIM architecture aimed at CNN/DNN acceleration that replaces logic-based processing with pre-calculated results stored inside the LUTs in order to perform complex computations on the DRAM memory platform. Our LUT-based DRAM-PIM architecture offers superior performance at a significantly higher energy-efficiency compared to the more conventional bit-wise parallel PIM architectures, while at the same time avoids fabrication challenges associated with the in-memory implementation of logic circuits. Alongside, the processing elements can …",
        "citations": 27
    },
    {
        "title": "AWARe-Wi: A jamming-aware reconfigurable wireless interconnection using adversarial learning for multichip systems",
        "id": "tuWDm5kAAAAJ:JoZmwDi-zQgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:JoZmwDi-zQgC",
        "authors": [
            "M Meraj Ahmed",
            "Amlan Ganguly",
            "Abhishek Vashist",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "Sustainable Computing: Informatics and Systems",
        "pub_date": "2021/3/1",
        "description": "Performance of the compute-intensive multichip platforms such as micro-servers and embedded systems are limited by the latency and power hungry chip-to-chip interconnections. Millimeter wave (mm-wave) wireless interconnection networks have emerged as an energy-efficient and low-latency solution for such multichip system communication. We refer such multichip systems with in-package mm-wave wireless interconnect as Wireless Network-in-Package (WiNiP). Despite providing performance enhancements, wireless channel, being an unguided medium, introduces potential security vulnerabilities inherited from traditional wireless networks such as jamming induced Denial-of-Service (DoS) and eavesdropping. Securing the systems against such induced threats often introduce large overheads and performance penalties. To address these challenges, we propose a WiNiP architecture that reuses the in-built …",
        "citations": 13
    },
    {
        "title": "NASCon: Network-Aware Server Consolidation for server-centric wireless datacenters",
        "id": "tuWDm5kAAAAJ:AXPGKjj_ei8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:AXPGKjj_ei8C",
        "authors": [
            "Sayed Ashraf Mamun",
            "Amlan Ganguly",
            "Panos P Markopoulos",
            "Minseok Kwon",
            "Andres Kwasinski"
        ],
        "pub_source": "Sustainable Computing: Informatics and Systems",
        "pub_date": "2021/3/1",
        "description": "Servers in datacenter are underutilized due to over-provisioning, which contributes heavily toward high-power consumption of the datacenters. Server consolidation can drastically reduce power consumption of datacenters by reducing the number of active servers. However, server consolidation alone can adversely affect network performance. Recently, wireless datacenters using millimeter-wave communications have been proposed and shown to drastically reduce power consumption of networking equipment. Therefore, server-consolidation strategies should leverage novel datacenter network-architectures to minimize power consumption with minimal impact on performance. We present network-aware bandwidth-constrained server consolidation algorithm called Network-Aware Server Consolidation (NASCon), for wireless datacenters that can reduce the power consumption up to 37%. In wireless datacenter …",
        "citations": 3
    },
    {
        "title": "Security frameworks for intra and inter-chip wireless interconnection networks",
        "id": "tuWDm5kAAAAJ:PR6Y55bgFSsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:PR6Y55bgFSsC",
        "authors": [
            "M Meraj Ahmed",
            "Abhishek Vashist",
            "Andrew Keats",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "Network-on-Chip Security and Privacy",
        "pub_date": "2021/1/22",
        "description": "Millimeter-wave (mm-wave)-based on-chip wireless communication fabric known as Wireless Networks-on-Chips (WiNoCs) and in-package multichip wireless interconnect known as Wireless Network-in-Package (WiNiP), have emerged as a possible solution to the non-scalable, multi-hop data transmission paths in traditional intra and inter-chip wired interconnect architectures. Using low-power transceivers in NoC switches, such mm-wave wireless interconnect architectures have been shown to achieve higher energy efficiency with improved peak bandwidth and reduced intra and inter-chip data transfer latency. However, using wireless interconnects for both intra and inter-chip data transfer over an unguided medium introduces additional security vulnerabilities arising from either external attackers or internal Hardware Trojans (HTs). In this chapter, we discuss mechanisms to make on and off-chip mm-wave …",
        "citations": 2
    },
    {
        "title": "Proceedings of the 14th International Workshop on Network on Chip Architectures",
        "id": "tuWDm5kAAAAJ:fEOibwPWpKIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:fEOibwPWpKIC",
        "authors": [
            "Amlan Ganguly"
        ],
        "pub_source": "Association for Computing Machinery",
        "pub_date": "2021"
    },
    {
        "title": "Fundamentals of heat dissipation in 3D IC packaging and thermal-aware design",
        "id": "tuWDm5kAAAAJ:dTyEYWd-f8wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:dTyEYWd-f8wC",
        "authors": [
            "Satish G Kandlikar",
            "Amlan Ganguly"
        ],
        "pub_source": "3D Microelectronic Packaging: From Architectures to Applications",
        "pub_date": "2021",
        "description": "Cooling of a planar 2D IC chip utilizes heat transfer from a face of the chip though a heat sink. In case of a 3D IC chip stack, the individual chip faces are not available for mounting conventional heat sinks. Mounting the heat sinks on the ends is feasible, but the heat flow paths for the interior chips from the junction to the heat sink become longer. Further, multiple heat sources present along the heat flow paths in stacked chips may create localized hot spots which exceed the allowable junction temperatures. While 2.5D integration in complex ICs where individual layers are mounted on another base die called an interposer can alleviate the heat dissipation issues, it cannot deliver the benefits of monolithic 3D ICs due to the planar distance between the chips or chiplets over the interposer. Introducing interlayer cooling with microchannels and introducing fins in the coolant flow paths extend the thermal dissipation …",
        "citations": 4
    },
    {
        "title": "Defense against on-chip trojans enabling traffic analysis attacks",
        "id": "tuWDm5kAAAAJ:ye4kPcJQO24C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ye4kPcJQO24C",
        "authors": [
            "M Meraj Ahmed",
            "Abhijitt Dhavlle",
            "Naseef Mansoor",
            "Purab Sutradhar",
            "Sai Manoj Pudukotai Dinakarrao",
            "Kanad Basu",
            "Amlan Ganguly"
        ],
        "pub_source": "2020 Asian Hardware Oriented Security and Trust Symposium (AsianHOST)",
        "pub_date": "2020/12/15",
        "description": "Interconnection networks for multi/many-core processors or server systems are the backbone of the system as they enable data communication among the processing cores, caches, memory and other peripherals. Given the criticality of the interconnects, the system can be severely subverted if the interconnection is compromised. The threat of Hardware Trojans (HTs) penetrating complex hardware systems such as multi/many-core processors are increasing due to the increasing presence of third party players in a System-on-chip (SoC) design. Even by deploying naïve HTs, an adversary can exploit the Network-on-Chip (NoC) backbone of the processor and get access to communication patterns in the system. This information, if leaked to an attacker, can reveal important insights regarding the application suites running on the system; thereby compromising the user privacy and paving the way for more severe …",
        "citations": 14
    },
    {
        "title": "Architecting a secure wireless interconnect for multichip communication: An ML approach",
        "id": "tuWDm5kAAAAJ:LjlpjdlvIbIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:LjlpjdlvIbIC",
        "authors": [
            "MMeraj Ahmed",
            "Abhishek Vashist",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "2020 Asian Hardware Oriented Security and Trust Symposium (AsianHOST)",
        "pub_date": "2020/12/15",
        "description": "Compute-intensive platforms such as micro-servers and embedded systems have already undergone a shift from a single-chip to multichip architecture to achieve better yield and lower cost. However, performance of multichip systems is limited by the latency and power-hungry chip-to-chip wired I/Os. On the other hand, wireless interconnections are emerging as an energy-efficient and low latency interconnect solution for such multichip systems as it can mask long multi-hop off-chip wired I/O communication. Despite efficient communication, the unguided on and off-chip wireless communication introduce security vulnerabilities in the system. In this work, we propose a reconfigurable, secure millimeter-wave (mm-Wave) wireless interconnection architecture (AReS) for multichip systems capable of detecting and defending against emerging threats including Hardware Trojans (HTs) and Denial-of-Service (DoS) using …",
        "citations": 7
    },
    {
        "title": "Risk-Based A*: Simulation Analysis of a Novel Task Assignment and Path Planning Method",
        "id": "tuWDm5kAAAAJ:VL0QpB8kHFEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:VL0QpB8kHFEC",
        "authors": [
            "Maojia P Li",
            "Michael E Kuhl",
            "Rashmi Ballamajalu",
            "Clark Hochgraf",
            "Raymond Ptucha",
            "Amlan Ganguly",
            "Andres Kwasinski"
        ],
        "pub_source": "2020 Winter Simulation Conference (WSC)",
        "pub_date": "2020/12/14",
        "description": "This paper addresses the task assignment and path planning (TAPP) problem for autonomous mobile robots (AMR) in material handling applications. We introduce risk-based A*, a novel TAPP method, that aims to reduce conflict and travel distance for AMRs considering system uncertainties such as travel speed, turning speed, and loading/unloading time. An environment simulator predicts the distribution of future locations for each AMR and constructs a probability map for future AMR locations. A revised A* algorithm generates low-risk paths based on the probability map. A discrete event simulation experiment shows our model significantly reduces the number of conflicts among robots in stochastic systems.",
        "citations": 2
    },
    {
        "title": "What can ail thee: New and old security vulnerabilities of wireless datacenters",
        "id": "tuWDm5kAAAAJ:HE397vMXCloC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:HE397vMXCloC",
        "authors": [
            "Sayed Ashraf Mamun",
            "Amlan Ganguly",
            "Panos P Markopoulos",
            "Andres Kwasinski",
            "Minseok Kwon"
        ],
        "pub_source": "GLOBECOM 2020-2020 IEEE Global Communications Conference",
        "pub_date": "2020/12/7",
        "description": "Utilizing millimeter wave (mmWave) wireless communication in wireless datacenter networks, the power consumption of the networking equipment can be reduced drastically. However, security of a datacenter is one of the highest design priorities. Many studies on the security of wired datacenters including identifying the possible threats and solutions have been explored in the literature. On the contrary, being an emerging technology, no study has been conducted on the security for the wireless datacenters. Being a wireless system, it has the potential to inherit many of the threats of a typical wireless network. So, in order to successfully realize wireless datacenter architectures, it is essential to do an extensive investigation of the system from a security perspective. In this paper, we study both existing as well as novel threats and their impact on the wireless datacenter network. In addition to these conventional threats …",
        "citations": 1
    },
    {
        "title": "PROGRAM COMMITTEE (CASES)",
        "id": "tuWDm5kAAAAJ:PELIpwtuRlgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:PELIpwtuRlgC",
        "authors": [
            "Partha Pratim Pande",
            "Umit Ogras",
            "Ali Akoglu",
            "Lars Bauer",
            "Swarup Bhunia",
            "Oliver Bringmann",
            "Luca Carloni",
            "Jeronimo Castrillon",
            "Henri-Pierre Charles",
            "Mainak Chaudhuri",
            "Anup Das",
            "Jana Doppa",
            "Lide Duan",
            "Christophe Dubach",
            "William Fornaciari",
            "Amlan Ganguly",
            "Puneet Gupta",
            "Yuko Hara-Azumi",
            "Joerg Henkel",
            "Jingtong Hu",
            "Paolo Ienne",
            "Hrishikesh Jayakumar",
            "Timothy Jones",
            "Changhee Jung",
            "Ramesh Karri",
            "Ryan Kim",
            "Andreas Krall",
            "Akash Kumar",
            "Jaejin Lee",
            "Chang-Gun Lee",
            "Mikko Lipasti",
            "Zhonghai Lu",
            "Scott Mahlke",
            "Avinash Malik",
            "Michail Maniatakos",
            "Pietro Mercati",
            "Vijaykrishnan Narayanan",
            "Rupesh Nasre",
            "Sri Parameswaran",
            "Anuj Pathania",
            "Christian Pilato",
            "Laura Pozzi",
            "USI Lugano",
            "Sai Manoj Pudukotai Dinakarrao",
            "Sanghamitra Roy",
            "Joshua San Miguel",
            "Aviral Shrivastava",
            "Amit Kumar Singh",
            "Thorsten Strufe",
            "Karthik Swaminathan",
            "Hiroyuki Tomiyama",
            "Jeffrey Vetter",
            "Hao Wang",
            "Weng-Fai Wong",
            "Shouyi Yin",
            "Sungjoo Yoo",
            "Wei Zhang"
        ],
        "pub_source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
        "pub_date": "2020/11",
        "description": "Program Committee Page 1 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF \nINTEGRATED CIRCUITS AND SYSTEMS, VOL. 39, NO. 11, NOVEMBER 2020 4293 Program \nCommittee PROGRAM COMMITTEE (CASES) Program Chairs Partha Pratim Pande \nWashington State University Umit Ogras Arizona State University Program Committee Ali Akoglu \nUniversity of Arizona Lars Bauer KIT Swarup Bhunia University of Florida Oliver Bringmann \nUniversity of Tuebingen/FZI Luca Carloni Columbia University Jeronimo Castrillon TU \nDresden Henri-Pierre Charles CEA Mainak Chaudhuri IIT Kanpur Anup Das Drexel University \nJana Doppa Washington State University Lide Duan Alibaba DAMO Academy Christophe \nDubach University of Edinburgh William Fornaciari Politecnico di Milano-DEIB Amlan Ganguly \nRochester Institute of Technology Puneet Gupta UCLA Yuko Hara-Azumi Tokyo Institute of …"
    },
    {
        "title": "Intra-and inter-server smart task scheduling for profit and energy optimization of HPC data centers",
        "id": "tuWDm5kAAAAJ:eMMeJKvmdy0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:eMMeJKvmdy0C",
        "authors": [
            "Sayed Ashraf Mamun",
            "Alexander Gilday",
            "Amit Kumar Singh",
            "Amlan Ganguly",
            "Geoff V Merrett",
            "Xiaohang Wang",
            "Bashir M Al-Hashimi"
        ],
        "pub_source": "Journal of Low Power Electronics and Applications",
        "pub_date": "2020/10/14",
        "description": "Servers in a data center are underutilized due to over-provisioning, which contributes heavily toward the high-power consumption of the data centers. Recent research in optimizing the energy consumption of High Performance Computing (HPC) data centers mostly focuses on consolidation of Virtual Machines (VMs) and using dynamic voltage and frequency scaling (DVFS). These approaches are inherently hardware-based, are frequently unique to individual systems, and often use simulation due to lack of access to HPC data centers. Other approaches require profiling information on the jobs in the HPC system to be available before run-time. In this paper, we propose a reinforcement learning based approach, which jointly optimizes profit and energy in the allocation of jobs to available resources, without the need for such prior information. The approach is implemented in a software scheduler used to allocate real applications from the Princeton Application Repository for Shared-Memory Computers (PARSEC) benchmark suite to a number of hardware nodes realized with Odroid-XU3 boards. Experiments show that the proposed approach increases the profit earned by 40% while simultaneously reducing energy consumption by 20% when compared to a heuristic-based approach. We also present a network-aware server consolidation algorithm called Bandwidth-Constrained Consolidation (BCC), for HPC data centers which can address the under-utilization problem of the servers. Our experiments show that the BCC consolidation technique can reduce the power consumption of a data center by up-to 37%.",
        "citations": 4
    },
    {
        "title": "Antenna arrays as millimeter-wave wireless interconnects in multichip systems",
        "id": "tuWDm5kAAAAJ:WA5NYHcadZ8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:WA5NYHcadZ8C",
        "authors": [
            "Rounak Singh Narde",
            "Jayanti Venkataraman",
            "Amlan Ganguly",
            "Ivan Puchades"
        ],
        "pub_source": "IEEE Antennas and Wireless Propagation Letters",
        "pub_date": "2020/9/22",
        "description": "In this letter, the transmission characteristics between on-chip arrays and their beamforming capabilities for intrachip and interchip communication in multichip systems are simulated and measured using various fabricated arrays on silicon chips. The measured intrachip and interchip maximum transmission coefficients for various arrays without metal sheets range from -37 to -45 dB and -46 to -51 dB, respectively at 60 GHz. The beamforming for arrays with and without feed structures is compared by radiation pattern using simulations. Moreover, the transmission with metal sheets, emulating realistic multicores, shows a reduction of about 10 dB for intrachip communication compared with cases having no sheets. In this letter, we have demonstrated that beamforming and beam steering can be successfully achieved.",
        "citations": 8
    },
    {
        "title": "The IANET Hardware Accelerator for Audio and Visual Data Classification",
        "id": "tuWDm5kAAAAJ:kzcrU_BdoSEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:kzcrU_BdoSEC",
        "authors": [
            "Rohini J Gillela",
            "Amlan Ganguly",
            "Dorin Patru",
            "Mark A Indovina"
        ],
        "pub_source": "2020 IEEE 33rd International System-on-Chip Conference (SOCC)",
        "pub_date": "2020/9/8",
        "description": "There are several instances during driving where audible data is of importance, though often ignored. Today's deaf or acoustically impaired drivers face challenges during driving in various countries. They are vulnerable as they can't hear the siren or vehicle horn and depend on other drivers around them to act. Processing audio and providing feedback would be equally valuable to any driver or autonomous vehicle. This paper addresses the gap in existing technology by integrating audio or acoustic and image or visual processing units with the help of efficient hardware design and architecture of the Convolutional Neural Networks (CNNs). These processing units are integrated into a single module, IANET, that makes use of two CNN accelerators, one for audio and the other for image processing units. The hardware is implemented in various fixed-point representations to observe the accuracy and stability of …"
    },
    {
        "title": "A review of in-memory computing architectures for machine learning applications",
        "id": "tuWDm5kAAAAJ:t6usbXjVLHcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:t6usbXjVLHcC",
        "authors": [
            "Sathwika Bavikadi",
            "Purab Ranjan Sutradhar",
            "Khaled N Khasawneh",
            "Amlan Ganguly",
            "Sai Manoj Pudukotai Dinakarrao"
        ],
        "pub_source": "Proceedings of the 2020 on Great Lakes Symposium on VLSI, 89-94",
        "pub_date": "2020/9/7",
        "description": "to meet the extensive computational load presented by the rapidly growing Machine Learning (ML) and Artificial Intelligence (AI) algorithms such as Deep Neural Networks (DNNs) and Convolutional Neural Networks (CNNs). In order to obtain hardware solutions to meet the low-latency and high-throughput computational demands from these algorithms, Non-Von Neumann computing architectures such as In-memory Computing (IMC)/ Processing-in-memory (PIM) are being extensively researched and experimented with. In this survey paper, we analyze and review pioneer IMC/PIM works designed to accelerate ML algorithms such as DNNs and CNNs. We investigate different architectural aspects and dimensions of these works and provide our comparative evaluations. Furthermore, we discuss challenges and limitations in IMC research and also present feasible directions based on our observations and insight.",
        "citations": 58
    },
    {
        "title": "An asymmetric, one-to-many traffic-aware mm-wave wireless interconnection architecture for multichip systems",
        "id": "tuWDm5kAAAAJ:Mojj43d5GZwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Mojj43d5GZwC",
        "authors": [
            "M Meraj Ahmed",
            "Naseef Mansoor",
            "Amlan Ganguly"
        ],
        "pub_source": "IEEE Transactions on Emerging Topics in Computing",
        "pub_date": "2020/9/1",
        "description": "Platform based computing modules such as embedded systems and micro-servers are multichip systems with in-package memory and processing chips. Such systems consist of both one-to-one (unicast) and one-to-many (broadcast/ multicast) traffic patterns. State-of-the-art wired interconnection architectures such as Network-on-Chip (NoC) are specially designed to handle on-chip unicast traffic and cannot mask the high off-chip communication latency caused by the chip-to-chip I/Os in multichip systems. Moreover, with the increase in memory-intensive applications and hence one-to-many traffic in a multichip system, this scenario gets even worse as conventionally one-to-many traffic is handled as multiple unicast traffic in a multihop NoC infrastructure. Consequently, a small proportion of such one-to-many traffic increases energy consumption and message latency significantly for chip-to-chip communication …",
        "citations": 6
    },
    {
        "title": "pPIM: A programmable processor-in-memory architecture with precision-scaling for deep learning",
        "id": "tuWDm5kAAAAJ:olpn-zPbct0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:olpn-zPbct0C",
        "authors": [
            "Purab Ranjan Sutradhar",
            "Mark Connolly",
            "Sathwika Bavikadi",
            "Sai Manoj Pudukotai Dinakarrao",
            "Mark A Indovina",
            "Amlan Ganguly"
        ],
        "pub_source": "IEEE Computer Architecture Letters",
        "pub_date": "2020/7/23",
        "description": "Memory access latencies and low data transfer bandwidth limit the processing speed of many data intensive applications such as Convolutional Neural Networks (CNNs) in conventional Von Neumann architectures. Processing in Memory (PIM) is envisioned as a potential hardware solution for such applications as the data access bottlenecks can be avoided in PIM by performing computations within the memory die. However, PIM realizations with logic-based complex processing units within the memory present complicated fabrication challenges. In this letter, we propose to leverage the existing memory infrastructure to implement a programmable PIM (pPIM), a novel Look-Up-Table (LUT)-based PIM where all the processing units are implemented solely with LUTs, as opposed to prior LUT-based PIM implementations that combine LUT with logic circuitry for computations. This enables pPIM to perform ultra-low …",
        "citations": 35
    },
    {
        "title": "Security vulnerabilities of server-centric wireless datacenters",
        "id": "tuWDm5kAAAAJ:XiVPGOgt02cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:XiVPGOgt02cC",
        "authors": [
            "Sayed Ashraf Mamun",
            "Amlan Ganguly",
            "Panos P Markopoulos",
            "Andres Kwasinski",
            "Minseok Kwon"
        ],
        "pub_source": "2020 IEEE Conference on Communications and Network Security (CNS)",
        "pub_date": "2020/6/29",
        "description": "Wireless datacenter network is an emerging technology. Recent works have shown that by utilizing millimeter wave (mmWave) wireless communication, the power consumption of the networking equipment of datacenters can be reduced drastically. However, security of a datacenter is one of the highest design priorities. Many studies on the security of wired datacenters including identifying the possible threats and solutions have been explored in the literature. On the contrary, being an emerging technology, no study has been conducted on the security for the wireless datacenters. Moreover, being a wireless system, it also inherits most of the threats of a typical wireless system if not all. So, in order to successfully realize wireless datacenter architectures, it is essential to do an extensive investigation of the system from a security perspective. In this paper, we have done an extensive study on the possible threats and …",
        "citations": 4
    },
    {
        "title": "A one-to-many traffic-oriented mm-wave wireless network-in-package interconnection architecture for multichip computing systems",
        "id": "tuWDm5kAAAAJ:1qzjygNMrQYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:1qzjygNMrQYC",
        "authors": [
            "M Meraj Ahmed",
            "Naseef Mansoor",
            "Amlan Ganguly"
        ],
        "pub_source": "Sustainable Computing: Informatics and Systems",
        "pub_date": "2020/6/1",
        "description": "High Performance Computing (HPC) platforms like blade servers consist of multiple processor chips, which may be multicore CPUs, GPUs, memory modules and other subsystems. In such memory and computation intensive systems one-to-many traffic patterns originate from cache coherency, system-level synchronization mechanisms and other control signals. However, small portions of such traffic can introduce huge local and global congestion, which significantly reduce overall performance and cause energy bottleneck unless low latency transmission is ensured by a one-to-many traffic-aware interconnection architecture. Therefore, these high performance and memory intensive multichip systems require efficient support for one-to-may traffic. Traditional metal-based Network-on-Chip (NoC) interconnection architecture is mostly designed for unicast traffic and therefore not suitable for such one-to-many traffic as …",
        "citations": 4
    },
    {
        "title": "Scalable and energy efficient wireless inter chip interconnection fabrics using THz-band antennas",
        "id": "tuWDm5kAAAAJ:J-pR_7NvFogC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:J-pR_7NvFogC",
        "authors": [
            "Sagar Saxena",
            "Deekshith Shenoy Manur",
            "Naseef Mansoor",
            "Amlan Ganguly"
        ],
        "pub_source": "Journal of Parallel and Distributed Computing",
        "pub_date": "2020/5/1",
        "description": "Computing platforms ranging from embedded systems to server blades comprise of multiple Systems-on-Chips (SoCs). Conventionally, communication between chips in these multichip platforms are realized using high-speed I/O modules over metal traces on a substrate. Due to the high-power consumption of I/O modules and non-scalable pitch of pins or solder bumps their bandwidth density and power consumption becomes bottleneck for multichip systems. Wireless chip-to-chip communication is emerging as an alternative solution to the traditional interconnection challenges of multichip systems. Novel devices based on graphene structures capable of establishing wireless links are explored in recent literature to provide high bandwidth THz links. In this work, we propose to utilize graphene-based wireless links to enable energy-efficient, multi-modal chip-to-chip communication protocol to create toroidal folding …",
        "citations": 21
    },
    {
        "title": "Improving Multimodal Localization Through Self-Supervision.",
        "id": "tuWDm5kAAAAJ:bnK-pcrLprsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:bnK-pcrLprsC",
        "authors": [
            "Robert Relyea",
            "Darshan Ramesh Bhanushali",
            "Karan Manghi",
            "Abhishek Vashist",
            "Clark Hochgraf",
            "Amlan Ganguly",
            "Andres Kwasinski",
            "Michael E Kuhl",
            "Raymond W Ptucha"
        ],
        "pub_source": "IRIACV",
        "pub_date": "2020/1/26",
        "description": "Modern warehouses utilize fleets of robots for inventory management. To ensure efficient and safe operation, real-time localization of each agent is essential. Most robots follow metal tracks buried in the floor and use a grid of precisely mounted RFID tags for localization. As robotic agents in warehouses and manufacturing plants become ubiquitous, it would be advantageous to eliminate the need for these metal wires and RFID tags. Not only do they suffer from significant installation costs, the removal of wires would allow agents to travel to any area inside the building. Sensors including cameras and LiDAR have provided meaningful localization information for many different positioning system implementations. Fusing localization features from multiple sensor sources is a challenging task especially when the target localization task’s dataset is small. We propose a deep-learning based localization system which fuses features from an omnidirectional camera image and a 3D LiDAR point cloud to create a robust robot positioning model. Although the usage of vision and LiDAR eliminate the need for the precisely installed RFID tags, they do require the collection and annotation of ground truth training data. Deep neural networks thrive on lots of supervised data, and the collection of this data can be time consuming. Using a dataset collected in a warehouse environment, we evaluate the performance of two individual sensor models for localization accuracy. To minimize the need for extensive ground truth data collection, we introduce a self-supervised pretraining regimen to populate the image feature extraction network with meaningful weights …"
    },
    {
        "title": "LiDAR-camera fusion for 3D object detection",
        "id": "tuWDm5kAAAAJ:5ugPr518TE4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:5ugPr518TE4C",
        "authors": [
            "Darshan Bhanushali",
            "Robert Relyea",
            "Karan Manghi",
            "Abhishek Vashist",
            "Clark Hochgraf",
            "Amlan Ganguly",
            "Andres Kwasinski",
            "Michael E Kuhl",
            "Raymond Ptucha"
        ],
        "pub_source": "Electronic Imaging",
        "pub_date": "2020/1/26",
        "description": "The performance of autonomous agents in both commercial and consumer applications increases along with their situational awareness. Tasks such as obstacle avoidance, agent to agent interaction, and path planning are directly dependent upon their ability to convert sensor readings  into scene understanding. Central to this is the ability to detect and recognize objects. Many object detection methodologies operate on a single modality such as vision or LiDAR. Camera-based object detection models benefit from an abundance of feature-rich information for classifying different  types of objects. LiDAR-based object detection models use sparse point clouds, where each point contains accurate 3D position of object surfaces. Camera-based methods lack accurate object to lens distance measurements, while LiDAR-based methods lack dense feature-rich details. By utilizing  information from both camera and LiDAR sensors, advanced object detection and identification is possible. In this work, we introduce a deep learning framework for fusing these modalities and produce a robust real-time 3D bounding box object detection network. We demonstrate qualitative and  quantitative analysis of the proposed fusion model on the popular KITTI dataset.",
        "citations": 6
    },
    {
        "title": "Indoor wireless localization using consumer-grade 60 GHz equipment with machine learning for intelligent material handling",
        "id": "tuWDm5kAAAAJ:V3AGJWp-ZtQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:V3AGJWp-ZtQC",
        "authors": [
            "Abhishek Vashist",
            "Darshan Ramesh Bhanushali",
            "Robert Relyea",
            "Clark Hochgraf",
            "Amlan Ganguly",
            "PD Sai Manoj",
            "Raymond Ptucha",
            "Andres Kwasinski",
            "Michael E Kuhl"
        ],
        "pub_source": "2020 IEEE International Conference on Consumer Electronics (ICCE)",
        "pub_date": "2020/1/4",
        "description": "Wireless indoor localization is critical for autonomous agents in modern and future smart warehouses. Millimeter-wave (mmWave) frequencies have been investigated for high-precision localization in recent years for indoor as well as outdoor positioning. We propose machine learning (ML) techniques over a radio map to estimate the location of an autonomous material handling agent used in warehouses. Based on our experimental results we demonstrate that a Multilayer Perceptron (MLP) based positioning achieves centimeter level accuracy with Root Mean Square Error (RMSE) of 0.84m. The proposed localization technique achieves up to 80% lower positioning error compared to state-of-the-art mmWave wireless localization techniques.",
        "citations": 25
    },
    {
        "title": "Autonomous Vehicles and Machines Conference, at IS&T Electronic Imaging",
        "id": "tuWDm5kAAAAJ:dQ2og3OwTAUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:dQ2og3OwTAUC",
        "authors": [
            "Darshan Bhanushali",
            "Robert Relyea",
            "Karan Manghi",
            "Abhishek Vashist",
            "Clark Hochgraf",
            "Amlan Ganguly",
            "Andres Kwasinski",
            "Michael E Kuhl",
            "Raymond Ptucha"
        ],
        "pub_source": "",
        "pub_date": "2020",
        "description": "The performance of autonomous agents in both commercial and consumer applications increases along with their situational awareness. Tasks such as obstacle avoidance, agent to agent interaction, and path planning are directly dependent upon their ability to convert sensor readings into scene understanding. Central to this is the ability to detect and recognize objects. Many object detection methodologies operate on a single modality such as vision or LiDAR. Camera-based object detection models benefit from an abundance of feature-rich information for classifying different types of objects. LiDAR-based object detection models use sparse point clouds, where each point contains accurate 3D position of object surfaces. Camera-based methods lack accurate object to lens distance measurements, while LiDAR-based methods lack dense feature-rich details. By utilizing information from both camera and LiDAR sensors, advanced object detection and identification is possible. In this work, we introduce a deep learning framework for fusing these modalities and produce a robust real-time 3D bounding box object detection network. We demonstrate qualitative and quantitative analysis of the proposed fusion model on the popular KITTI dataset."
    },
    {
        "title": "Task selection by autonomous mobile robots in a warehouse using deep reinforcement learning",
        "id": "tuWDm5kAAAAJ:wbdj-CoPYUoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:wbdj-CoPYUoC",
        "authors": [
            "Maojia P Li",
            "Prashant Sankaran",
            "Michael E Kuhl",
            "Raymond Ptucha",
            "Amlan Ganguly",
            "Andres Kwasinski"
        ],
        "pub_source": "2019 Winter Simulation Conference (WSC)",
        "pub_date": "2019/12/8",
        "description": "We introduce a deep Q-network (DQN) based model that addresses the dispatching and routing problems for autonomous mobile robots. The DQN model is trained to dispatch a small fleet of robots to perform material handling tasks in a virtual, as well as, in an actual warehouse environment. Specifically, the DQN model is trained to dispatch an available robot to the closest task that will avoid or minimize encounters with other robots. Based on a discrete event simulation experiment, the DQN model outperforms the shortest travel distance rule in terms of avoiding traffic conflicts, improving the makespan for completing a set of tasks, and reducing the mean time in system for tasks.",
        "citations": 23
    },
    {
        "title": "Unified testing and security framework for wireless network-on-chip enabled multi-core chips",
        "id": "tuWDm5kAAAAJ:VOx2b1Wkg3QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:VOx2b1Wkg3QC",
        "authors": [
            "Abhishek Vashist",
            "Andrew Keats",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "ACM Transactions on Embedded Computing Systems (TECS)",
        "pub_date": "2019/10/8",
        "description": "On-chip wireless interconnects have been demonstrated to improve the performance and energy consumption of data communication in Network-on-Chips (NoCs). However, the wireless interfaces (WIs) can be defective, rendering these broken links severely affect the performance. This makes manufacturing test of the WIs critical. While analog testing of the transceivers is possible, such methodologies are impractical in a Wireless NoC (WiNoC) due to large overheads. In addition to testing, security is another prominent challenge in WiNoCs, as the security breach can happen due to embedded hardware Trojans or through external attacker exploiting the wireless medium. The typical security measures used in general wireless networks are not practical in a WiNoC due to unique network architectures and performance requirements of such a system. However, both testing and security defense can potentially …",
        "citations": 11
    },
    {
        "title": "Network-aware server consolidation for wireless data centers",
        "id": "tuWDm5kAAAAJ:eJXPG6dFmWUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:eJXPG6dFmWUC",
        "authors": [
            "Sayed Ashraf Mamun",
            "Amlan Ganguly",
            "Minseok Kwon",
            "Andres Kwasinski",
            "Panos P Markopoulos"
        ],
        "pub_source": "2019 10th International Conference on Networks of the Future (NoF)",
        "pub_date": "2019/10/1",
        "description": "Servers in a data center are underutilized due to overprovisioning which contributes heavily toward the high-power consumption of the data centers. Server consolidation can drastically reduce the power consumption of data centers by engaging fewer servers and keeping the unused servers in deep sleep. However, server consolidation alone can adversely affect network performance. Recently, wireless data centers using high-speed millimeter-wave (mmWave) communications have been proposed and shown to drastically reduce the power consumption of the networking equipment. Therefore, server-consolidation strategies should leverage the novel data center network architectures to minimize power consumption with minimal impact on performance. Neither novel server consolidation algorithms for wireless data centers nor the impact of server consolidation on wireless data centers have been explored so far …",
        "citations": 1
    },
    {
        "title": "Securing a wireless network-on-chip against jamming-based denial-of-service and eavesdropping attacks",
        "id": "tuWDm5kAAAAJ:LPZeul_q3PIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:LPZeul_q3PIC",
        "authors": [
            "Abhishek Vashist",
            "Andrew Keats",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "IEEE Transactions on Very Large Scale Integration (VLSI) Systems",
        "pub_date": "2019/8/26",
        "description": "Wireless networks-on-chips (NoCs) (WiNoCs) have emerged as a possible solution to the nonscalable multihop data transmission paths in traditional wired NoC architectures. Using low-power transceivers in NoC switches, novel WiNoC architectures have been shown to achieve higher energy efficiency with improved peak bandwidth and reduced on-chip data transfer latency. However, using wireless interconnects for intrachip data transfer over an unguided medium introduces additional security vulnerabilities in on-chip communication arising from either external attackers or internal hardware Trojans. In this article, we propose a mechanism to make the wireless communication in a WiNoC secure against persistent jamming-based denial-of-service (DoS) attacks and eavesdropping (ED) from both external and internal attackers. Persistent jamming attacks on the on-chip wireless medium will cause interference in …",
        "citations": 37
    },
    {
        "title": "Intra-and inter-chip transmission of millimeter-wave interconnects in NoC-based multi-chip systems",
        "id": "tuWDm5kAAAAJ:8AbLer7MMksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:8AbLer7MMksC",
        "authors": [
            "Rounak Singh Narde",
            "Jayanti Venkataraman",
            "Amlan Ganguly",
            "Ivan Puchades"
        ],
        "pub_source": "IEEE Access",
        "pub_date": "2019/7/29",
        "description": "The primary objective of this paper is to investigate the communication capabilities of short-range millimeter-wave (mmWave) communication among network-on-chip (NoC)-based multi-core processors integrated on a substrate board. This paper presents the characterization of transmission between on-chip antennas for both intra- and inter-chip communication in multi-chip computing systems, such as server blades or embedded systems. Through simulation at 30 GHz, we have characterized the inter-chip transmission and studied the electric field distribution to explain the transmission characteristics. It is shown that the antenna radiation efficiency reduces with a decrease in the resistivity of silicon. The simulation results have been validated with fabricated antennas in different orientations on silicon dies that can communicate with inter-chip transmission coefficients ranging from -45 to -60 dB while sustaining …",
        "citations": 31
    },
    {
        "title": "Energy efficient chip-to-chip wireless interconnection for heterogeneous architectures",
        "id": "tuWDm5kAAAAJ:geHnlv5EZngC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:geHnlv5EZngC",
        "authors": [
            "Sri Harsha Gade",
            "M Meraj Ahmed",
            "Sujay Deb",
            "Amlan Ganguly"
        ],
        "pub_source": "ACM Transactions on Design Automation of Electronic Systems (TODAES)",
        "pub_date": "2019/7/26",
        "description": "Heterogeneous multichip architectures have gained significant interest in high-performance computing clusters to cater to a wide range of applications. In particular, heterogeneous systems with multiple multicore CPUs, GPUs, and memory have become common to meet application requirements. The shared resources like interconnection network in such systems pose significant challenges due to the diverse traffic requirements of CPUs and GPUs. Especially, the performance and energy consumption of inter-chip communication have remained a major bottleneck due to limitations imposed by off-chip wired links. To overcome these challenges, we propose a wireless interconnection network to provide energy-efficient, high-performance communication in heterogeneous multi-chip systems. Interference-free communication between GPUs and memory modules is achieved through directional wireless links, while …",
        "citations": 8
    },
    {
        "title": "Securing a wireless network-on-chip against jamming based denial-of-service attacks",
        "id": "tuWDm5kAAAAJ:fQNAKQ3IYiAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:fQNAKQ3IYiAC",
        "authors": [
            "Abhishek Vashist",
            "Andrew Keats",
            "Sai Manoj Pudukotai Dinakarrao",
            "Amlan Ganguly"
        ],
        "pub_source": "2019 IEEE Computer Society Annual Symposium on VLSI (ISVLSI)",
        "pub_date": "2019/7/15",
        "description": "Wireless Networks-on-Chips (NoCs) have emerged as a panacea to the non-scalable multi-hop data transmission paths in traditional wired NoC architectures. Using low-power transceivers in NoC switches, novel Wireless NoC (WiNoC) architectures have been shown to achieve higher energy efficiency with improved peak bandwidth and reduced on-chip data transfer latency. However, using wireless interconnects for data transfer within a chip makes the on-chip communications vulnerable to various security threats from either external attackers or internal hardware Trojans (HTs). In this work, we propose a mechanism to make the wireless communication in a WiNoC secure against persistent jamming based Denial-of-Service attacks from both external and internal attackers. Persistent jamming attacks on the on-chip wireless medium will cause interference in data transfer over the duration of the attack resulting in …",
        "citations": 12
    },
    {
        "title": "Disc-Loaded, Vertical Top-Hat Monopole Antenna at 225 GHz for On-Chip Wireless Communications",
        "id": "tuWDm5kAAAAJ:D_sINldO8mEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:D_sINldO8mEC",
        "authors": [
            "Rounak Singh Narde",
            "Jayanti Venkataraman",
            "Amlan Ganguly"
        ],
        "pub_source": "2019 IEEE International Symposium on Antennas and Propagation and USNC-URSI Radio Science Meeting",
        "pub_date": "2019/7/7",
        "description": "The challenges of intra- and inter-chip wireless communication arise from the very small electrical thickness of the silicon dioxide and from the direction of the main beam of the antenna. In most of these cases the antennas are placed horizontally on the substrate with the radiation orthogonal to the plane of the chip which results in low transmission in the plane of the chip. A vertical monopole has the desired radiation pattern but becomes electrically small which, in turn, makes the input impedance highly capacitive. Furthermore the silicon substrate reduces the radiation resistance. To address these issues, the present work presents a vertical top-hat monopole placed in silicon dioxide (SiO 2 ) as the wireless interconnect. It has a ground plane in the shape of a disc to improve the radiation resistance. Matching is achieved by the top-hat that provides a capacitance and a shorting post connecting the top-hat to the …",
        "citations": 2
    },
    {
        "title": "Evaluation of wireless network-on-chip architectures with microchannel-based cooling in 3D multicore chips",
        "id": "tuWDm5kAAAAJ:WbkHhVStYXYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:WbkHhVStYXYC",
        "authors": [
            "Md Shahriar Shamim",
            "Rounak Singh Narde",
            "Jose-Luis Gonzalez-Hernandez",
            "Amlan Ganguly",
            "Jayanti Venkatarman",
            "Satish G Kandlikar"
        ],
        "pub_source": "Sustainable Computing: Informatics and Systems",
        "pub_date": "2019/3/1",
        "description": "Three-dimensional multicore Integrated Circuits (3D ICs) with Network-on-Chip (NoC) based interconnections provide promising solutions to the challenges of footprint, device density and energy cost of on-chip communication. However, the increase in power density in 3D ICs due to reduced footprint aggravates the thermal issues in the chip. Liquid cooling through microfluidic channels can provide cooling capacities required for effective management of chip temperatures in 3D ICs. However, pumping liquid through the microchannels can cause high pressure-drops causing structural instability in the chip. In order to reduce the pressure drops and provide adequate cooling capability, the height and width of the microchannels needs to be increased. This reduces the available floor area of the 3D IC to place and route Through Silicon Vias (TSVs) for data signals through the microchannel walls making the co-design …",
        "citations": 20
    },
    {
        "title": "Multimodal localization for autonomous agents",
        "id": "tuWDm5kAAAAJ:5Ul4iDaHHb8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:5Ul4iDaHHb8C",
        "authors": [
            "Robert Relyea",
            "Darshan Bhanushali",
            "Abhishek Vashist",
            "Amlan Ganguly",
            "Andres Kwasinski",
            "Michael E Kuhl",
            "Raymond Ptucha"
        ],
        "pub_source": "Electronic Imaging",
        "pub_date": "2019/1/13",
        "description": "Inventory management and handling in warehouse environments have transformed large retail fulfillment centers. Often hundreds of autonomous agents scurry about fetching and delivering products to fulfill customer orders. Repetitive movements such as these are ideal for a robotic  platform to perform. One of the major hurdles for an autonomous system in a warehouse is accurate robot localization in a dynamic industrial environment. Previous LiDAR-based localization schemes such as adaptive Monte Carlo localization (AMCL) are effective in indoor environments and can  be initialized in new environments with relative ease. However, AMCL can be influenced negatively by accumulated odometry drift, and is also reliant primarily on a single modality for scene understanding which limits the localization performance. We propose a robust localization system which  combines multiple sensor sources and deep neural networks for accurate real-time localization in warehouses. Our system employs a novel deep neural network architecture consisting of multiple heterogeneous deep neural networks. The overall architecture employs a single multi-stream framework  to aggregate the sensor information into a final robot location probability distribution. Ideally, the integration of multiple sensors will produce a robust system even when one sensor fails to produce reliable scene information.",
        "citations": 1
    },
    {
        "title": "Simulation Analysis of a Highway DNN for Autonomous Forklift Dispatching",
        "id": "tuWDm5kAAAAJ:ZuybSZzF8UAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ZuybSZzF8UAC",
        "authors": [
            "Prashant Sankaran",
            "Maojia P Li",
            "Michael E Kuhl",
            "Raymond Ptucha",
            "Amlan Ganguly",
            "Andres Kwasinski"
        ],
        "pub_source": "IIE Annual Conference. Proceedings",
        "pub_date": "2019",
        "description": "With the proliferation of autonomous vehicles in warehouse applications, there are several challenges that face researchers including precision indoor localization, navigation, obstacle avoidance, path planning, and task selection decisions. This paper addresses the issue of task selection decision. Specifically, we develop a deep learning methodology for task selection for fleet of autonomous vehicles in a warehouse environment. The autonomous vehicles select a task from a list of tasks, considering current vehicle traffic, potential travel paths, and the task potential task locations. We implement a highway deep neural network (DNN) for the task selection process. To evaluate the methodology, we conducted a simulation-based experiment to generate various scenarios and test the capabilities of the DNN. The results of the simulation-based experiment show that our deep learning method performs well under the …"
    },
    {
        "title": "VLSI Circuits and Systems Letter",
        "id": "tuWDm5kAAAAJ:f2IySw72cVMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:f2IySw72cVMC",
        "authors": [
            "Anirban Sengupta",
            "Vipul Kumar Mishra",
            "David Pan",
            "Yier Jin",
            "Theocharis Theocharides",
            "Prasun Ghosal",
            "Mayukh Sarkar",
            "Amlan Ganguly",
            "Naseef Mansoor",
            "Md Shahriar Shamim",
            "Chen Zhuo"
        ],
        "pub_source": "IEEE 5 (1)",
        "pub_date": "2019",
        "description": "This letter presents a novel improved delay estimation methodology during scheduling in high level synthesis (HLS) for application specific computing. In general during delay estimation from scheduling during HLS, only functional unit delay is considered. However for current generation of complex digital systems, interconnects (switching elements) also play a very vital role in effective delay evaluation. Thus consideration of interconnect/storage delay during delay estimation from scheduling during HLS becomes very significant, as inaccurate delay estimation inevitably misguides the exploration process during HLS. Motivating from this fact, this letter proposes an improved schedule delay estimation methodology divided into two phases:(a) process of identifying the operations that contribute to the effective delay of the operation chaining based scheduling (b) process of estimating schedule delay considering delay of interconnect (multiplexer unit) and storage elements (latches and final output register) besides regular functional units (FU). The proposed approach more comprehensively estimates the schedule delay than existing practice. Our results on various benchmarks confirm that proposed approach yields estimated delay more comprehensively (reported later) than current standard practice.",
        "citations": 3
    },
    {
        "title": "Simulation analysis of a deep reinforcement learning approach for task selection by autonomous material handling vehicles",
        "id": "tuWDm5kAAAAJ:l7t_Zn2s7bgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:l7t_Zn2s7bgC",
        "authors": [
            "Maojia Patrick Li",
            "Prashant Sankaran",
            "Michael E Kuhl",
            "Amlan Ganguly",
            "Andres Kwasinski",
            "Raymond Ptucha"
        ],
        "pub_source": "2018 Winter simulation conference (WSC)",
        "pub_date": "2018/12/9",
        "description": "The use of autonomous vehicles is a growing trend in the material handling and warehousing. Some challenges that face material handling include the navigation within a warehouse, precision localization and movement, and task selection decisions. In this paper, we address the issue of task selection. In particular, we develop a deep reinforcement learning methodology to enable a vehicle to select from among multiple tasks and move to the closest task in the context of material handling in a warehouse. To evaluate the deep reinforcement learning methodology, we conduct a simulation-based experiment to generate scenarios to first train and then test the capabilities of the method. The results of the experiment show that the method performs well under the given conditions.",
        "citations": 15
    },
    {
        "title": "An Asymmetric, Energy Efficient One-to-Many Traffic-Aware Wireless Network-in-Package Interconnection Architecture for Multichip Systems",
        "id": "tuWDm5kAAAAJ:sSrBHYA8nusC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:sSrBHYA8nusC",
        "authors": [
            "M Meraj Ahmed",
            "Naseef Mansoor",
            "Amlan Ganguly"
        ],
        "pub_source": "2018 Ninth International Green and Sustainable Computing Conference (IGSC)",
        "pub_date": "2018/10/22",
        "description": "High Performance Computing (HPC) platforms like blade servers consist of multiple processor chips which may be multicore CPUs, GPUs, memory modules and other subsystems. These high performance and memory intensive multichip systems require efficient support for one-to-many traffic patterns which originates from cache coherency, system-level synchronization mechanisms and other control signals. Small portions of such traffic can introduce congestion which significantly reduce overall performance and cause energy bottleneck unless low latency transmission is ensured by a one-to-many traffic aware interconnection architecture. Traditional metal based Network-on-Chip (NoC) interconnection architecture is not suitable for such traffic as it provides high-latency, power hungry multi-hop paths. To address this issue, we propose the design of a one-to-many traffic-aware Wireless Network-in-Package …",
        "citations": 2
    },
    {
        "title": "Making Cables Disappear: Can Wireless Datacenter be a Reality?",
        "id": "tuWDm5kAAAAJ:B3FOqHPlNUQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:B3FOqHPlNUQC",
        "authors": [
            "Sayed Ashraf Mamun",
            "Amlan Ganguly"
        ],
        "pub_source": "2018 Ninth International Green and Sustainable Computing Conference (IGSC)",
        "pub_date": "2018/10/22",
        "description": "Significant portion of the power consumption of datacenter is due to the power-hungry switching fabric necessary for communication. Additionally, the complex cabling in traditional datacenters pose design and maintenance challenges and increase the energy cost of the cooling infrastructure by obstructing the flow of chilled air. In this work, these problems of traditional datacenters are addressed by designing a server-to-server wireless datacenter network (S2S-WiDCN). It is estimated that by implementing S2S-WiDCN, power consumption is lower by five to seventeen times compared to a conventional DCN fabric."
    },
    {
        "title": "Testing winoc-enabled multicore chips with bist for wireless interconnects",
        "id": "tuWDm5kAAAAJ:p2g8aNsByqUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:p2g8aNsByqUC",
        "authors": [
            "Abhishek Vashist",
            "Amlan Ganguly",
            "Mark Indovina"
        ],
        "pub_source": "2018 Twelfth IEEE/ACM International Symposium on Networks-on-Chip (NOCS)",
        "pub_date": "2018/10/4",
        "description": "The following topics are dealt with: network-on-chip; multiprocessing systems; network routing; system-on-chip; integrated circuit interconnections; microprocessor chips; telecommunication traffic; wireless channels; cache storage; and telecommunication network routing.",
        "citations": 3
    },
    {
        "title": "A one-to-many traffic aware wireless network-in-package for multi-chip computing platforms",
        "id": "tuWDm5kAAAAJ:K3LRdlH-MEoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:K3LRdlH-MEoC",
        "authors": [
            "M Meraj Ahmed",
            "Amlan Ganguly",
            "Sajeed Mohaamd Shahriat",
            "Hardeep Pruswani",
            "Naseef Mansoor"
        ],
        "pub_source": "2018 31st IEEE International System-on-Chip Conference (SOCC)",
        "pub_date": "2018/9/4",
        "description": "Platform based computing modules such as embedded systems and micro-servers are multichip systems with in-package memory and processing chips. These computation expensive and memory intensive multichip systems need an energy efficient broadcast/multicast capable interconnection infrastructure to support the cache coherence protocols and system-level synchronization mechanisms. State-of-the-art interconnections do not provide an efficient support for broadcast/multicast communication. Consequently, a small proportion of such one-to-many traffic, increases the energy consumption and message latency while decreasing the data bandwidth for chip-to-chip communication. To address this issue, we propose the design of a one-to-many traffic-aware Wireless Network-in-Package (WiNiP) architecture. Using a one-to-many traffic-aware Medium Access Control (MAC), the proposed WiNiP architecture …",
        "citations": 8
    },
    {
        "title": "A traffic-aware medium access control mechanism for energy-efficient wireless network-on-chip architectures",
        "id": "tuWDm5kAAAAJ:OU6Ihb5iCvQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:OU6Ihb5iCvQC",
        "authors": [
            "Naseef Mansoor",
            "Abhishek Vashist",
            "M Meraj Ahmed",
            "Md Shahriar Shamim",
            "Syed Ashraf Mamun",
            "Amlan Ganguly"
        ],
        "pub_source": "arXiv preprint arXiv:1809.07862",
        "pub_date": "2018/9/4",
        "description": "Wireless interconnection has emerged as an energy efficient solution to the challenges of multi-hop communication over the wireline paths in conventional Networks-on-Chips (NoCs). However, to ensure the full benefits of this novel interconnect technology, design of simple, fair and efficient Medium Access Control (MAC) mechanism to grant access to the on-chip wireless communication channel is needed. Moreover, to adapt to the varying traffic demands from the applications running on a multicore environment, MAC mechanisms should dynamically adjust the transmission slots of the wireless interfaces (WIs). Such dynamic adjustment in transmission slots will result in improving the utilization of the wireless medium in a Wireless NoC (WiNoC). In this paper we present the design of two dynamic MAC mechanisms that adjust the transmission slots of the WIs based on predicted traffic demands and allow partial packet transfer. Through system level simulations, we demonstrate that the traffic aware MAC mechanisms are more energy efficient as well as capable of sustaining higher data bandwidth in WiNoCs.",
        "citations": 8
    },
    {
        "title": "Enhancement of Intra-chip Transmission between Wireless Interconnects using Artificial Magnetic Conductors",
        "id": "tuWDm5kAAAAJ:738O_yMBCRsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:738O_yMBCRsC",
        "authors": [
            "Rounak Singh Narde",
            "Jayanti Venkataraman",
            "Amlan Ganguly"
        ],
        "pub_source": "2018 IEEE International Symposium on Antennas and Propagation & USNC/URSI National Radio Science Meeting",
        "pub_date": "2018/7/8",
        "description": "In this work, we have shown enhancement of intra-chip transmission between wireless interconnects, which are implemented as antenna-on-chip (AoC), using Jerusalem-Cross Artificial Magnetic Conductor (JC-AMC). AoCs are located at the center of four-quadrants of a multicore chip. For each quadrant, a zigzag monopole AoC above a JC-AMC surface is simulated to resonate at 30GHz with a return loss of -13dB. The enhancement is almost 3dB for two out of three antenna pairs. This enhancement has almost doubled the received power at the antenna with JC-AMC which is beneficial when designing on-chip integrated transceivers. For experimental validation, fabrication of the zigzag antennas with JC-AMC surfaces on silicon wafer are under progress.",
        "citations": 1
    },
    {
        "title": "A 0.24 pJ/bit, 16Gbps OOK transmitter circuit in 45-nm CMOS for inter and intra-chip wireless interconnects",
        "id": "tuWDm5kAAAAJ:dshw04ExmUIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:dshw04ExmUIC",
        "authors": [
            "Tanmay Shinde",
            "Suryanarayanan Subramaniam",
            "Padmanabh Deshmukh",
            "M Meraj Ahmed",
            "Mark Indovina",
            "Amlan Ganguly"
        ],
        "pub_source": "Proceedings of the 2018 on Great Lakes Symposium on VLSI",
        "pub_date": "2018/5/30",
        "description": "Research in recent years has demonstrated that intra and inter-chip wireless interconnects are capable of establishing energy-efficient data communications within as well as between multiple chips. This paper presents a circuit level design of an energy-efficient millimeter wave (mm-wave) on-off keying (OOK) transmitter suitable for such wireless interconnects in 45-nm CMOS process. The transmitter consists of an NMOS cross-coupled VCO, an OOK modulator and a power amplifier. The transmitter is able to achieve maximum modulation data rate of 16Gb/s at 60GHz with the output power of -3dBm consuming a total power of 3.9mW, which translates to a bit-energy efficiency of 0.24pJ/bit.",
        "citations": 13
    },
    {
        "title": "Performance evaluation of a power-efficient and robust 60 GHz wireless server-to-server datacenter network",
        "id": "tuWDm5kAAAAJ:KxtntwgDAa4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:KxtntwgDAa4C",
        "authors": [
            "Sayed Ashraf Mamun",
            "Sree Gowrishankar Umamaheswaran",
            "Amlan Ganguly",
            "Minseok Kwon",
            "Andres Kwasinski"
        ],
        "pub_source": "IEEE Transactions on Green Communications and Networking",
        "pub_date": "2018/5/18",
        "description": "Datacenters have become the digital backbone of the modern world. To support the growing demands on bandwidth, datacenter networks (DCNs) consume an increasing amount of power. Additionally, the complex cabling in traditional datacenters poses design and maintenance challenges and increases the energy cost of the cooling infrastructure by obstructing the flow of chilled air. In this paper, we present a wireless server-to-server datacenter network architecture using millimeter-wave links to eliminate the need for power-hungry switching fabric of traditional fat-tree based datacenter networks. The server-to-server wireless datacenter network (S2S-WiDCN) architecture requires line-of-sight (LoS) between servers to establish direct communication links. However, in the presence of an obstruction such as an IT technician, the LoS may be blocked. To address this issue, we propose a novel obstruction-aware …",
        "citations": 17
    },
    {
        "title": "The advances, challenges and future possibilities of millimeter-wave chip-to-chip interconnections for multi-chip systems",
        "id": "tuWDm5kAAAAJ:bFI3QPDXJZMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:bFI3QPDXJZMC",
        "authors": [
            "Amlan Ganguly",
            "M Meraj Ahmed",
            "Rounak Singh Narde",
            "Abhishek Vashist",
            "Md Shahriar Shamim",
            "Naseef Mansoor",
            "Tanmay Shinde",
            "Suryanarayanan Subramaniam",
            "Sagar Saxena",
            "Jayanti Venkataraman",
            "Mark Indovina"
        ],
        "pub_source": "Journal of Low Power Electronics and Applications",
        "pub_date": "2018/2/28",
        "description": "With aggressive scaling of device geometries, density of manufacturing faults is expected to increase. Therefore, yield of complex Multi-Processor Systems-on-Chips (MP-SoCs) will decrease due to higher probability of manufacturing defects especially, in dies with large area. Therefore, disintegration of large SoCs into smaller chips called chiplets will improve yield and cost of complex platform-based systems. This will also provide functional flexibility, modular scalability as well as the capability to integrate heterogeneous architectures and technologies in a single unit. However, with scaling of the number of chiplets in such a system, the shared resources in the system such as the interconnection fabric and memory modules will become performance bottlenecks. Additionally, the integration of heterogeneous chiplets operating at different frequencies and voltages can be challenging. State-of-the-art inter-chip communication requires power-hungry high-speed I/O circuits and data transfer over long wired traces on substrates. This increases energy consumption and latency while decreasing data bandwidth for chip-to-chip communication. In this paper, we explore the advances and the challenges of interconnecting a multi-chip system with millimeter-wave (mm-wave) wireless interconnects from a variety of perspectives spanning multiple aspects of the wireless interconnection design. Our discussion on the recent advances include aspects such as interconnection topology, physical layer, Medium Access Control (MAC) and routing protocols. We also present some potential paradigm-shifting applications as well as complementary technologies of …",
        "citations": 36
    },
    {
        "title": "Acknowledgement to Reviewers of Journal of Low Power Electronics and Applications in 2017",
        "id": "tuWDm5kAAAAJ:SdhP9T11ey4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:SdhP9T11ey4C",
        "authors": [
            "Zia Abbas",
            "Harshit Agarwal",
            "Michael O Agyeman",
            "Md Aktaruzzaman",
            "Jarmo Alander",
            "Jens Anders",
            "Maria Daniela Angione",
            "Francis Assadian",
            "Johannes Ax",
            "Yu Bai",
            "Paul Beckett",
            "Giulio Bernardi",
            "Tim Beyl",
            "Bill Bi",
            "Alberto Bosio",
            "Young Chang",
            "Munish Chauhan",
            "Changlin Chen",
            "Kun-Chih Chen",
            "Roger Yubtzuan Chen",
            "Yie-Tone Chen",
            "Zheng Jun Chew",
            "Jaehyuk Choi",
            "Mihaela Cirlugea",
            "Pasquale Corsonello",
            "Nuno Costa",
            "Felice Crupi",
            "Antonio F Díaz",
            "Francesc Moll Echeto",
            "Ashkan Eghbal",
            "Rickard Ewetz",
            "Denis Flandre",
            "Paula Fraga-Lamas",
            "Michal Fularz",
            "Amlan Ganguly",
            "Angelo Genovese",
            "G Ghibaudo",
            "Andrea Giorgetti",
            "David W Graham",
            "Alfio Dario Grasso",
            "Xinfei Guo",
            "Zhaoqin Guo",
            "Sumeet Kumar Gupta",
            "Weng-Geng Ho",
            "Jiun-Wei Horng",
            "Wei Hu",
            "Shu-Chuan Huang",
            "Syed Anas Imtiaz",
            "Eugeni Isern",
            "Majid Jalalifar",
            "Hailong Jiao",
            "Tso-Bing Juang",
            "Dražen Jurišić",
            "Nandha Kumar Kandasamy",
            "Ian Karlin",
            "Panagiotis Kassanos"
        ],
        "pub_source": "",
        "pub_date": "2018",
        "description": "Peer review is an essential part in the publication process, ensuring that Journal of Low Power Electronics and Applications maintains high quality standards for its published papers. In 2017, a total of 31 papers were published in the journal. Thanks to the cooperation of our reviewers, the median time to first decision was 28 days and the median time to publication was 66 days. The editors would like to express their sincere gratitude to the following reviewers for their time and dedication in 2017:"
    },
    {
        "title": "On-chip antennas for inter-chip wireless interconnections: Challenges and opportunities",
        "id": "tuWDm5kAAAAJ:XiSMed-E-HIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:XiSMed-E-HIC",
        "authors": [
            "Rounak Singh Narde",
            "Naseef Mansoor",
            "Amlan Ganguly",
            "Jayanti Venkataraman"
        ],
        "pub_source": "IET Digital Library",
        "pub_date": "2018/1/1",
        "description": "Wireless interconnects have emerged as a solution to the problem of metallic interconnections for both intra and inter-chip communications. Multi GHz bandwidths of millimeter-wave (mm-wave) antennas coupled with appropriate system-level interconnection fabric design enables low power and high-speed communication between multiple many-core chips. In this paper, we discuss the design and transmission characteristics of an mm-wave antenna for multi-chip wireless interconnection systems. We investigate the challenges and opportunities for antenna design in this domain. We present a specific antenna design and its performance in terms of its transmission characteristics for inter-chip communication in a server node. Lastly, we explore the impact of antenna design on system-level design choices pertaining to Medium Access Control (MAC), topology and modulation techniques suitable for multi-chip systems.",
        "citations": 25
    },
    {
        "title": "Reducing power consumption of datacenter networks with 60ghz wireless server-to-server links",
        "id": "tuWDm5kAAAAJ:dfsIfKJdRG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:dfsIfKJdRG4C",
        "authors": [
            "Sree Gowrishankar Umamaheswaran",
            "Sayed Ashraf Mamun",
            "Amlan Ganguly",
            "Minseok Kwon",
            "Andres Kwasinski"
        ],
        "pub_source": "GLOBECOM 2017-2017 IEEE Global Communications Conference",
        "pub_date": "2017/12/4",
        "description": "Datacenters have become the digital backbone of the modern society and consume enormous amounts of power. Significant portion of the power consumption is due to the power hungry switching fabric necessary for communication in the datacenter. Additionally, the complex cabling in traditional datacenters pose design and maintenance challenges and increase the energy cost of the cooling infrastructure by obstructing the flow of chilled air. In this work we address these problems of traditional datacenters by designing a server-to-server wireless datacenter network (DCN). We propose design methodologies for the use of 60GHz unlicensed millimeter-wave bands to establish direct communication links between servers in a DCN without the need for a conventional fabric. This will reduce the power consumption of the DCN significantly. We first demonstrate that such a power-efficient wireless DCN can sustain the …",
        "citations": 10
    },
    {
        "title": "Gas-Cooled 3D IC with Wireless Interconnects",
        "id": "tuWDm5kAAAAJ:pyW8ca7W8N0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:pyW8ca7W8N0C",
        "authors": [
            "A Ganguly",
            "SG Kandlikar"
        ],
        "pub_source": "US Patent App. 15/587,634",
        "pub_date": "2017/11/9",
        "description": "A three-dimensional integrated circuit includes two or more stacks of one or more active layers; a gas-cooling layer separating the two or more stacks and a wireless interconnect between the two or more stacks enabling communication between the two or more stacks and system including a gas-cooled three-dimensional integrated circuit having wireless data interconnects is disclosed.",
        "citations": 2
    },
    {
        "title": "PaSE: A parallel speedup estimation framework for Network-on-Chip based multicore systems",
        "id": "tuWDm5kAAAAJ:SP6oXDckpogC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:SP6oXDckpogC",
        "authors": [
            "Ghassan Dharb",
            "Naseef Mansoor",
            "Sajeed Shahriat",
            "Amlan Ganguly"
        ],
        "pub_source": "2017 Eighth International Green and Sustainable Computing Conference (IGSC)",
        "pub_date": "2017/10/23",
        "description": "The massive integration of cores in multicore system has enabled chip designer to design systems while meeting the power-performance demands of the applications. However, full-system simulations traditionally used to evaluate the speedup of these systems are computationally expensive and time consuming. On the other hand, analytical speedup models such as Amdahl's law are powerful and fast ways to calculate the achievable speedup of these systems. However, Amdahl's Law disregards the communication among the cores that play a vital role in defining the achievable speedup with the multicore systems. To bridge this gap, in this work, we present PaSE a parallel speedup estimation framework for multicore systems that considers the latency of the Network-on-Chip (NoC). To accurately capture the latency of the NoC we also propose a queuing theory based analytical model. We conduct a case study for …",
        "citations": 1
    },
    {
        "title": "Increasing interposer utilization: A scalable, energy efficient and high bandwidth multicore-multichip integration solution",
        "id": "tuWDm5kAAAAJ:nb7KW1ujOQ8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:nb7KW1ujOQ8C",
        "authors": [
            "M Meraj Ahmed",
            "Md Shahriar Shamim",
            "Naseef Mansoor",
            "Sayed Ashraf Mamun",
            "Amlan Ganguly"
        ],
        "pub_source": "2017 Eighth International Green and Sustainable Computing Conference (IGSC)",
        "pub_date": "2017/10/23",
        "description": "With the increase in number of processing chips in platform based computation intensive systems such as servers, a seamless, scalable, energy efficient and high bandwidth interconnection network is required. Newly envisioned silicon interposers with Network-on-Chip (NoC) interconnection framework have emerged as an energy efficient technology for 2.5D integration of multiple processor and memory chips, where multiple chips are mounted on another die called the interposer and are interconnected using the metal layers of the interposer die. However, conventional interposer based multichip integration is limited to edge-to-edge connections between the adjacent dies leaving the interposer's routing resources underutilized. In this paper, we propose large scale utilization of the available abundant interposer resources for multichip integration by implementing a hypercube interconnection architecture in an …",
        "citations": 17
    },
    {
        "title": "Intra-chip wireless interconnect: The road ahead",
        "id": "tuWDm5kAAAAJ:yD5IFk8b50cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:yD5IFk8b50cC",
        "authors": [
            "Amlan Ganguly",
            "Naseef Mansoor",
            "Md Shahriar Shamim",
            "M Meraj Ahmed",
            "Rounak Singh Narde",
            "Abhishek Vashist",
            "Jayanti Venkataraman"
        ],
        "pub_source": "Proceedings of the 10th International Workshop on Network on Chip Architectures",
        "pub_date": "2017/10/14",
        "description": "On-chip wireless interconnects have been proposed to provide energy-efficient data communication paths between cores in System-on-Chips (SoCs) in the multi and many-core era. Networks-on-Chips (NoCs) when interconnecting hundreds of cores consume large amounts of energy and suffer from high and unpredictable latency due to congestion at intermediate routers. Wireless interconnects alleviate this problem by providing direct single-hop links between distant cores in the chip. While various wireless NoC (WiNoC) architectures have been proposed and evaluated in the in the past decade this technology is not yet adopted in the mainstream industry. In order to benefit from the past decade of research in WiNoC designs a few important myths regarding wireless interconnects need to be dispelled while propelling the research to tangible technology transfer. In this paper several vectors that define the design …",
        "citations": 6
    },
    {
        "title": "A folded wireless network-on-chip using graphene based THz-band antennas",
        "id": "tuWDm5kAAAAJ:u_35RYKgDlwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:u_35RYKgDlwC",
        "authors": [
            "Sagar Saxena",
            "Deekshith Shenoy Manur",
            "Md Shahriar Shamim",
            "Amlan Ganguly"
        ],
        "pub_source": "Proceedings of the 4th acm international conference on nanoscale computing and communication",
        "pub_date": "2017/9/27",
        "description": "1 Long distance data communication over multi-hop wireline paths in conventional Network-on-Chips (NoCs) cause high-energy consumption and degradation in performance. Many emerging interconnect technologies such as 3D integration, photonic, Radio Frequency (RF), and wireless interconnects have been envisioned to alleviate the issues of a metal/dielectric interconnect system. To satisfy the increasing demand for high speed and low power interconnects, THz Wireless NoC (WiNoC) enabled with high-speed direct links between distant cores is desired. In this paper, we present an innovative approach to enable a THz WiNoC with low power wireless devices operating in the THz bands such as graphene based antennas. The novelty of this work is that we propose a torus like folding by using THz band links instead of global wires. With cycle accurate system-level simulations, we demonstrate that they are …",
        "citations": 20
    },
    {
        "title": "A 0.36 pJ/bit, 17Gbps OOK receiver in 45-nm CMOS for inter and intra-chip wireless interconnects",
        "id": "tuWDm5kAAAAJ:b0M2c_1WBrUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:b0M2c_1WBrUC",
        "authors": [
            "Suryanarayanan Subramaniam",
            "Tanmay Shinde",
            "Padmanabh Deshmukh",
            "Md Shahriar Shamim",
            "Mark Indovina",
            "Amlan Ganguly"
        ],
        "pub_source": "2017 30th IEEE International System-on-Chip Conference (SOCC)",
        "pub_date": "2017/9/5",
        "description": "Wireless interconnects are capable of establishing energy-efficient intra and inter-chip data communications. This paper introduces a circuit level design of an energy-efficient millimeter-wave (mm-wave) non-coherent on-off keying (OOK) receiver suitable for such wireless interconnects in 45-nm CMOS process. The receiver consists of a simple two-stage common source structure based Low Noise Amplifier (LNA) and a source degenerated differential Envelope Detector (ED) followed by a Base Band (BB) amplifier stage. Operating at 60GHz, the proposed OOK receiver consumes only 6.1mW DC power from a 1V supply while providing a data rate of 17Gbps and a bit-energy efficiency of 0.36 pJ/bit.",
        "citations": 18
    },
    {
        "title": "W1B: Application specific designs",
        "id": "tuWDm5kAAAAJ:_xSYboBqXhAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:_xSYboBqXhAC",
        "authors": [
            "Amlan Ganguly"
        ],
        "pub_source": "2017 30th IEEE International System-on-Chip Conference (SOCC)",
        "pub_date": "2017/9/5",
        "description": "Start of the above-titled section of the conference proceedings record."
    },
    {
        "title": "Energy-efficient wireless interconnection framework for multichip systems with in-package memory stacks",
        "id": "tuWDm5kAAAAJ:4OULZ7Gr8RgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:4OULZ7Gr8RgC",
        "authors": [
            "Md Shahriar Shamim",
            "M Meraj Ahmed",
            "Naseef Mansoor",
            "Amlan Ganguly"
        ],
        "pub_source": "2017 30th IEEE International System-on-Chip Conference (SOCC)",
        "pub_date": "2017/9/5",
        "description": "Multichip systems with memory stacks and various processing chips are at the heart of platform based designs such as servers and embedded systems. Full utilization of the benefits of these integrated multichip systems need a seamless, and scalable in-package interconnection framework. However, state-of-the-art inter-chip communication requires long wireline channels which increases energy consumption and latency while decreasing data bandwidth. Here, we propose the design of an energy-efficient, seamless wireless interconnection network for multichip systems. We demonstrate with cycle-accurate simulations that such a design reduces the energy consumption and latency while increasing the bandwidth in comparison to modern multichip integration systems.",
        "citations": 7
    },
    {
        "title": "Energy-Efficient Wireless Interconnection Framework for Multichip Systems with In-package Memory Stacks",
        "id": "tuWDm5kAAAAJ:kRWSkSYxWN8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:kRWSkSYxWN8C",
        "authors": [
            "Md Shahriar Shamim",
            "M Meraj Ahmed",
            "Naseef Mansoor",
            "Amlan Ganguly"
        ],
        "pub_source": "arXiv e-prints",
        "pub_date": "2017/9",
        "description": "Multichip systems with memory stacks and various processing chips are at the heart of platform based designs such as servers and embedded systems. Full utilization of the benefits of these integrated multichip systems need a seamless, and scalable in-package interconnection framework. However, state-of-the-art inter-chip communication requires long wireline channels which increases energy consumption and latency while decreasing data bandwidth. Here, we propose the design of an energy-efficient, seamless wireless interconnection network for multichip systems. We demonstrate with cycle-accurate simulations that such a design reduces the energy consumption and latency while increasing the bandwidth in comparison to modern multichip integration systems."
    },
    {
        "title": "Feasibility study of transmission between wireless interconnects in multichip multicore systems",
        "id": "tuWDm5kAAAAJ:cFHS6HbyZ2cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:cFHS6HbyZ2cC",
        "authors": [
            "Rounak Singh Narde",
            "Jayanti Venkataraman",
            "Amlan Ganguly"
        ],
        "pub_source": "2017 IEEE International Symposium on Antennas and Propagation & USNC/URSI National Radio Science Meeting",
        "pub_date": "2017/7/9",
        "description": "The paper presents a feasibility study of transmission between wireless interconnects in Multichip Multicore (MCMC) systems. The MCMC model consists of four IC's, each with four cores that are placed at the corners. For this work, 4 electrically small monopole antennas are considered as wireless interconnects, placed on 3 IC's. Simulation is performed using ANSYS Electronics suite. As expected, transmission decreases with the distance between the antennas. Further, distortions of the radiation pattern due to the lossy silicon layer and the ground plane, significantly affect the transmission between the antennas. For experimental validation, zigzag antennas have been fabricated on silicon wafers. Measurements and analysis for a wireless channel modeling is under progress.",
        "citations": 11
    },
    {
        "title": "An energy-efficient, wireless top-of-rack to top-of-rack datacenter network using 60GHz links",
        "id": "tuWDm5kAAAAJ:EUQCXRtRnyEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:EUQCXRtRnyEC",
        "authors": [
            "Sayed Ashraf Mamun",
            "Sree Gowrishankar Umamaheswaran",
            "Siva Shankar Chandrasekaran",
            "Md Shahriar Shamim",
            "Amlan Ganguly",
            "Minseok Kwon"
        ],
        "pub_source": "2017 IEEE International Conference on Internet of Things (iThings) and IEEE Green Computing and Communications (GreenCom) and IEEE Cyber, Physical and Social Computing (CPSCom) and IEEE Smart Data (SmartData)",
        "pub_date": "2017/6/21",
        "description": "Datacenters have become the digital backbone of the modern society and consume enormous amounts of power. Significant portion of the power consumption is due to the power hungry switching fabric necessary for communication in the datacenter. Additionally, the complex cabling in traditional datacenters pose design and maintenance challenges and increase the energy cost of the cooling infrastructure by obstructing the flow of chilled air. Recent research on wireless datacenters have proposed interconnecting rows of racks at the top-of-rack (ToR) level via wireless links to eliminate the need for complex network of power hungry routers and cables. Links are established using either highly directional phased array antennas or narrow-beam horned antennas between those ToR entities. ToR-to-ToR wireless links have also been used to augment existing wired networks, improving overall performance …",
        "citations": 10
    },
    {
        "title": "Fundamentals of heat dissipation in 3D IC packaging",
        "id": "tuWDm5kAAAAJ:ZHo1McVdvXMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ZHo1McVdvXMC",
        "authors": [
            "Satish G Kandlikar",
            "Amlan Ganguly"
        ],
        "pub_source": "3D Microelectronic Packaging: From Fundamentals to Applications",
        "pub_date": "2017",
        "description": "Cooling of a planar 2D IC chip utilizes heat transfer from a face of the chip through a heat sink. In case of a 3D IC chip stack, the individual chip faces are not available for mounting conventional heat sinks. Mounting the heat sinks on the ends is feasible, but the heat flow paths for the interior chips from the junction to the heat sink become longer. Further, multiple heat sources present along the heat flow paths in stacked chips may create localized hot spots which exceed the allowable junction temperatures. Introducing interlayer cooling with microchannels and introducing fins in the coolant flow paths extend the thermal dissipation capability of a 3D stack; however, this is often accompanied with taller microchannels that lead to longer lengths of through-silicon-vias (TSVs). Placement of TSVs, microchannels walls, and fins present conflicting design requirements. Therefore codesign and innovative …",
        "citations": 6
    },
    {
        "title": "A wireless interconnection framework for seamless inter and intra-chip communication in multichip systems",
        "id": "tuWDm5kAAAAJ:M05iB0D1s5AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:M05iB0D1s5AC",
        "authors": [
            "Md Shahriar Shamim",
            "Naseef Mansoor",
            "Rounak Singh Narde",
            "Vignesh Kothandapani",
            "Amlan Ganguly",
            "Jayanti Venkataraman"
        ],
        "pub_source": "IEEE Transactions on Computers",
        "pub_date": "2016/9/1",
        "description": "Computing modules in typical data center nodes or server racks consist of several multicore chips either on a board or in a System-in-Package (SiP) environment. State-of-the-art inter-chip communication over wireline channels require data signals to travel from internal nets to the peripheral I/O ports and then get routed over the inter-chip channels to the I/O port of the destination chip. Following this, the data is finally routed from the I/O to internal nets of the destination chip over a wireline interconnect fabric. This multihop communication increases energy consumption while decreasing data bandwidth in a multichip system. Also, traditional I/O does not scale well with technology generations due to limitations of pitch. Moreover, intra-chip and inter-chip communication protocol within such a multichip system is often decoupled to facilitate design flexibility. However, a seamless interconnection between on-chip and off …",
        "citations": 95
    },
    {
        "title": "Interference-aware wireless network-on-chip architecture using directional antennas",
        "id": "tuWDm5kAAAAJ:ldfaerwXgEUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ldfaerwXgEUC",
        "authors": [
            "Hemanta Kumar Mondal",
            "Sri Harsha Gade",
            "Md Shahriar Shamim",
            "Sujay Deb",
            "Amlan Ganguly"
        ],
        "pub_source": "IEEE Transactions on Multi-Scale Computing Systems",
        "pub_date": "2016/7/28",
        "description": "Wireless Network-on-Chip (WiNoC) has been recently introduced for addressing the scalability limitations of conventional multi-hop NoC architectures. Existing WiNoC architectures generally use millimeter-wave antennas without significant directional gains, along with token passing protocol to access the shared wireless medium. This limits the achievable performance benefits since only one wireless pair can communicate at a time. It is also not practical in the immediate future to arbitrarily scale up the number of non-overlapping channels by designing transceivers operating in disjoint frequency bands in the millimeter-wave spectrum commonly adopted for on-chip wireless interconnects. Consequently, we explore the use of directional antennas whereby multiple wireless interconnect pairs can communicate simultaneously. However, concurrent wireless communications can result in interference. This can be …",
        "citations": 51
    },
    {
        "title": "Design of antennas for 3D wireless Network-on-Chip with micro-fluidic cooling layers",
        "id": "tuWDm5kAAAAJ:g5m5HwL7SMYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:g5m5HwL7SMYC",
        "authors": [
            "Chetan Kumar Munuswamy",
            "Jayanti Venkataraman",
            "Amlan Ganguly"
        ],
        "pub_source": "2016 IEEE International Symposium on Antennas and Propagation (APSURSI)",
        "pub_date": "2016/6/26",
        "description": "Recent trend in 3-D Network on a Chip (NoC) utilizing wireless interconnects to improve communication speeds have been successful. Liquid cooling channels introduced on top and bottom still leave the interior of the chip as a hot spot. In the present work, novel architecture of 3-D NoC is modeled in different configurations of embedded micro fluidic layers to address the interior heating. Wired interconnects through the fluidic layers is not possible, zig-zag antennas are implemented and placed in different configurations, to serve as wireless interconnects. The thermo-fluidic layers are modeled as channels of dielectric constant 1.75. Each antenna has been individually designed and successfully tuned to resonate at 60 GHz with a return loss (RL) less than -10dB, using ANSYS High Frequency System Simulator (HFSS). The paper also discusses the transmission coefficients and shows low noise up to 10 GHz.",
        "citations": 4
    },
    {
        "title": "A demand-aware predictive dynamic bandwidth allocation mechanism for wireless network-on-chip",
        "id": "tuWDm5kAAAAJ:2P1L_qKh6hAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:2P1L_qKh6hAC",
        "authors": [
            "Naseef Mansoor",
            "Md Shahriar Shamim",
            "Amlan Ganguly"
        ],
        "pub_source": "Proceedings of the 18th System Level Interconnect Prediction Workshop",
        "pub_date": "2016/6/4",
        "description": "Long distance data communication over multi-hop wireline paths in conventional Networks-on-Chips (NoCs) cause high energy consumption and degradation in bandwidth. Wireless interconnects in the millimeter-wave band have emerged as an energy-efficient interconnection paradigm for multi-core chips interconnected with NoCs. However, spatial variations in traffic distribution and temporal variations in workloads can exert variable bandwidth demands on the NoC fabric. Wireless interconnects which do not require a physical layout of interconnects can be utilized to mitigate this issue. In order to dynamically allocate variable bandwidth to the wireless transceivers depending on the demand, the design of a dynamic and efficient Medium Access Control (MAC) mechanism to grant access to the on-chip wireless communication channel is needed. In this paper, a history based predictor, which can predict the …",
        "citations": 25
    },
    {
        "title": "Co-design of 3D wireless network-on-chip architectures with microchannel-based cooling",
        "id": "tuWDm5kAAAAJ:M3NEmzRMIkIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:M3NEmzRMIkIC",
        "authors": [
            "Md Shahriar Shamim",
            "Amlan Ganguly",
            "Chetan Munuswamy",
            "Jayanti Venkatarman",
            "Jose Hernandez",
            "Satish Kandlikar"
        ],
        "pub_source": "2015 Sixth International Green and Sustainable Computing Conference (IGSC)",
        "pub_date": "2015/12/14",
        "description": "Three-dimensional Integrated Circuits (3D ICs) provide promising solutions to the challenges of footprint, device density and energy cost of on-chip communication. However, the increase in power density in 3D ICs due to reduced footprint aggravates the thermal issues in the chip. Liquid cooling through microfluidic channels can provide cooling capacities required for effective management of chip temperatures in 3D ICs. However, pumping liquid through the microchannels can cause high pressure drops causing structural instability in the chip. In order to reduce the pressure drops the height of the microchannels needs to be increased. This in turn makes the vertical interconnects realized by Through-Silicon-Vias longer, increasing delay and power consumption in data transfer. In this paper we propose to realize the vertical interconnects across the cooling layers with on-chip wireless interconnects. We present …",
        "citations": 15
    },
    {
        "title": "Reconfigurable wireless network-on-chip with a dynamic medium access mechanism",
        "id": "tuWDm5kAAAAJ:bEWYMUwI8FkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:bEWYMUwI8FkC",
        "authors": [
            "Naseef Mansoor",
            "Amlan Ganguly"
        ],
        "pub_source": "Proceedings of the 9th International Symposium on Networks-on-Chip",
        "pub_date": "2015/9/28",
        "description": "Wireless interconnects have emerged as an energy-efficient interconnection paradigm for multicore chips with Networks-on-Chips (NoCs). As wireless interconnects have the unique advantage of eliminating the need to layout physical channels they provide an inherent opportunity for dynamic reconfiguration of the NoC architecture. Large temporal and spatial variability in traffic patterns is expected in large multicore chips and especially in future heterogeneous systems-on-chips integrating different kinds of cores such as CPUs, GPUs, ASICs and memory. By establishing on-demand wireless links in response to dynamically varying traffic patterns the data bandwidth and energy efficiency of NoC architectures can be improved compared to static architectures with the same raw bandwidth. We present a dynamic medium access mechanism that establishes wireless links depending on traffic requirements while …",
        "citations": 47
    },
    {
        "title": "An interconnection architecture for seamless inter and intra-chip communication using wireless links",
        "id": "tuWDm5kAAAAJ:iH-uZ7U-co4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:iH-uZ7U-co4C",
        "authors": [
            "Md Shahriar Shamim",
            "Jagan Muralidharan",
            "Amlan Ganguly"
        ],
        "pub_source": "Proceedings of the 9th International Symposium on Networks-on-Chip",
        "pub_date": "2015/9/28",
        "description": "With increase in complexity of multicore chips, efficiency of data transfer between cores of a chip is becoming increasingly challenging. Several novel on-chip network architectures are proposed to improve the design flexibility and communication efficiency in multicore chips. On the other hand, computing modules in typical data center nodes or server racks consist of several multicore chips on either a board or in a System-in-Package (SiP) environment. State-of-the-art interchip communication over wireline channels require data signals to travel from internal nets to the peripheral I/O ports and then get routed over the interchip channels to the destination chip. After reaching the destination chip they will be finally routed from the I/O to the internal nets there. This multihop communication increases latency and energy consumption while decreasing data bandwidth in a multichip system. Moreover, intrachip and …",
        "citations": 16
    },
    {
        "title": "Design methodology for a robust and energy-efficient millimeter-wave wireless network-on-chip",
        "id": "tuWDm5kAAAAJ:TFP_iSt0sucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:TFP_iSt0sucC",
        "authors": [
            "Naseef Mansoor",
            "Pratheep Joe Sullivai Iruthayaraj",
            "Amlan Ganguly"
        ],
        "pub_source": "IEEE Transactions on Multi-Scale Computing Systems",
        "pub_date": "2015/9/22",
        "description": "Wireless Network-on-Chip (WiNoC) architectures with CMOS compatible millimeter-wave (mm-wave) transceivers can achieve significant improvements in energy-efficiency in on-chip data transfer for multicore chips. A token based medium access mechanism is used in mm-wave WiNoC architectures to enable a distributed utilization of the available wireless bandwidth among multiple transmitters. However, on-chip wireless interconnects can suffer from high rates of failures due to challenges in design and manufacturing. Consequently, the token-passing mechanism can fail and significantly degrade the potential benefits of this novel interconnect technology. In this paper, we establish a cross-layer robust and failure-resistant design methodology for WiNoC architectures. By optimizing the WiNoC topology and complementing it with a robust token management scheme and error correction codes, we propose to …",
        "citations": 37
    },
    {
        "title": "Acknowledgement to Reviewers of the Journal of Low Power Electronics and Applications in 2014",
        "id": "tuWDm5kAAAAJ:5awf1xo2G04C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:5awf1xo2G04C",
        "authors": [
            "Feras AlKhalil",
            "Stefan Andrei",
            "François Andrieu",
            "Sa Badrudduza",
            "Paul Beckett",
            "Marc Belleville",
            "David Boyle",
            "Paolo Bruschi",
            "Gyungsu Byun",
            "Benton Calhoun",
            "João Paulo Pereira Do Carmo",
            "Jen-Yuan Cheng",
            "Kyoung-Rok Cho",
            "Stefan Cosemans",
            "Francesco G Della Corte",
            "Stefano di Pascoli",
            "Paul M Furth",
            "Francisco Gamiz",
            "Amlan Ganguly",
            "Ligang Gao",
            "Na Gong",
            "Jingtong Hu",
            "Vita P-H Hu",
            "Shu-Chuan Huang",
            "Hailong Jiao",
            "TS Kalkur",
            "Karol Kalna",
            "Eric Karl",
            "Valeriya Kilchytska",
            "Elias Kougianos",
            "Marco Lanuzza",
            "Yu-Te Liao",
            "Peixiang Liu",
            "Terrence Mak",
            "Kofi AA Makinwa",
            "Pascal Meinerzhagen",
            "Hoang Nguyen",
            "Linwei Niu",
            "Yasuhisa Omura",
            "Joachim Rodrigues",
            "Ulrich Rückert",
            "Angada Sachid",
            "Yogesh Sharma",
            "Eddy Simoen",
            "Scott C Smith",
            "DIMITRIOS Soudris",
            "Nobuyuki Sugii",
            "Armin Tajalli",
            "Stephen Thomas",
            "Athanasios V Vasilakos",
            "Zhijian Xie"
        ],
        "pub_source": "",
        "pub_date": "2015",
        "description": "The article presents a list of the reviewers of the\" Journal of Low Power Electronics and Applications,\" in 2014 including Amlan Ganguly, Na Gong and Linwei Niu."
    },
    {
        "title": "Temperature-aware wireless network-on-chip architecture",
        "id": "tuWDm5kAAAAJ:ZeXyd9-uunAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ZeXyd9-uunAC",
        "authors": [
            "Md Shahriar Shamim",
            "Aniket Mhatre",
            "Naseef Mansoor",
            "Amlan Ganguly",
            "Gill Tsouri"
        ],
        "pub_source": "International Green Computing Conference",
        "pub_date": "2014/11/3",
        "description": "Long-range wireless shortcuts in Network-on-Chip (NoC) architectures are shown to significantly improve energy-efficiency in on-chip data transfer. However, over-utilization of the wireless shortcuts and non-uniform traffic patterns may result in thermal hotpots in the NoC links or switches. In this work we propose a cross-layer approach of optimizing the NoC topology to achieve a balanced traffic distribution and temperature-aware routing (TAR) scheme to avoid thermal hotspots. We demonstrate that the proposed wireless NoC architecture is able to reduce temperature of NoC components and the TAR scheme is able to restrict the temperatures near a target threshold value.",
        "citations": 10
    },
    {
        "title": "Design space exploration for wireless NoCs incorporating irregular network routing",
        "id": "tuWDm5kAAAAJ:dhFuZR0502QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:dhFuZR0502QC",
        "authors": [
            "Paul Wettin",
            "Ryan Kim",
            "Jacob Murray",
            "Xinmin Yu",
            "Partha P Pande",
            "Amlan Ganguly",
            "Deukhyoun Heoamlan"
        ],
        "pub_source": "IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems",
        "pub_date": "2014/10/16",
        "description": "The millimeter-wave small-world wireless network-on-chip (mSWNoC) is an enabling interconnect architecture to design high-performance and low-power multicore chips. As the mSWNoC has an overall irregular topology, it is essential to design and optimize suitable deadlock-free routing mechanisms for it. In this paper, we quantify the latency, energy dissipation, and thermal profiles of mSWNoC architectures by incorporating irregular network routing strategies. We demonstrate that the latency, energy dissipation, and thermal profile are affected by the adopted routing methodologies. The overall system performance and thermal profile are governed by the traffic-dependent optimization of the routing methods. Our aim is to establish the energy-thermal-performance trade-offs for the mSWNoC depending on the exact routing strategy and the characteristics of the benchmarks considered.",
        "citations": 59
    },
    {
        "title": "Heterogeneous photonic network-on-chip with dynamic bandwidth allocation",
        "id": "tuWDm5kAAAAJ:7PzlFSSx8tAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:7PzlFSSx8tAC",
        "authors": [
            "Ankit Shah",
            "Naseef Mansoor",
            "Ben Johnstone",
            "Amlan Ganguly",
            "Sonia Lopez Alarcon"
        ],
        "pub_source": "2014 27th IEEE International System-on-Chip Conference (SOCC)",
        "pub_date": "2014/9/2",
        "description": "Future multicore chips will have hundreds of heterogeneous components including processing engines, custom logic, GPU units, programmable fabrics and distributed memory. Such multicore chips are expected to run varied multiple parallel workloads simultaneously. Hence, different communicating cores will require different bandwidths leading to the necessity of a heterogeneous Network-on-Chip (NoC) architecture. Simply over-provisioning for performance will invariably result in loss of power efficiency. On the other hand, recent research has shown that photonic interconnects are capable of achieving high-bandwidth and energy-efficient on-chip data transfer. In this paper we propose a dynamic heterogeneous photonic NoC (d-HetPNOC) architecture with dynamic bandwidth allocation to achieve better performance and energy-efficiency compared to a homogeneous photonic NoC architecture with the same …",
        "citations": 6
    },
    {
        "title": "CDMA enabled wireless network-on-chip",
        "id": "tuWDm5kAAAAJ:9ZlFYXVOiuMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:9ZlFYXVOiuMC",
        "authors": [
            "Vineeth Vijayakumaran",
            "Manoj Prashanth Yuvaraj",
            "Naseef Mansoor",
            "Nishad Nerurkar",
            "Amlan Ganguly",
            "Andres Kwasinski"
        ],
        "pub_source": "ACM Journal on Emerging Technologies in Computing Systems (JETC)",
        "pub_date": "2014/6/2",
        "description": "Multihop communication links in conventional Networks-on-Chips (NoCs) results in lower rates of data transfer and higher energy dissipation. Long-range millimeter-wave wireless interconnects were envisioned to alleviate this problem. However, the available bandwidth of the wireless channels is limited and hence an efficient media access control (MAC) scheme is required to enhance the utilization of the available bandwidth. In this article we show that with multiple simultaneous access of the shared wireless medium using a Code Division Multiple Access (CDMA) scheme the peak performance can be improved significantly while lowering energy dissipation in data transfer compared to the conventional wireline counterparts as well as state-of-the-art Wireless NoCs using similar technologies. We present a thorough analysis of the reliability in data transfer using the CDMA based wireless links and show that a …",
        "citations": 70
    },
    {
        "title": "Energy-efficient wireless network-on-chip architecture with log-periodic on-chip antennas",
        "id": "tuWDm5kAAAAJ:mVmsd5A6BfQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:mVmsd5A6BfQC",
        "authors": [
            "Md Shahriar Shamim",
            "Naseef Mansoor",
            "Aman Samaiyar",
            "Amlan Ganguly",
            "Sujay Deb",
            "Shobha Sunndar Ram"
        ],
        "pub_source": "Proceedings of the 24th edition of the great lakes symposium on VLSI",
        "pub_date": "2014/5/20",
        "description": "On-chip wireless interconnects have emerged as a promising alternative to conventional wireline interconnects in Network-on-Chip (NoC) fabrics for multicore systems. However, it is not practical in the immediate future to arbitrarily scale up the number of wireless links without innovations in the physical layer. Here, we explore the design of a directional on-chip antenna based on a log-periodic structure. In this paper we propose the design of a wireless NoC (WiNoC) architecture with concurrent wireless links using these directional on-chip antennas. Through cycle accurate simulations we demonstrate that this novel WiNoC architecture attains better performance and energy efficiency compared to the state-of-the-art token based WiNoC of similar topology.",
        "citations": 27
    },
    {
        "title": "Complex network-enabled robust wireless network-on-chip architectures",
        "id": "tuWDm5kAAAAJ:70eg2SAEIzsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:70eg2SAEIzsC",
        "authors": [
            "Paul Wettin",
            "Anuroop Vidapalapati",
            "Amlan Gangul",
            "Partha Pratim Pande"
        ],
        "pub_source": "ACM Journal on Emerging Technologies in Computing Systems (JETC)",
        "pub_date": "2013/10/8",
        "description": "The Network-on-Chip (NoC) paradigm has emerged as a scalable interconnection infrastructure for modern multicore chips. However, with growing levels of integration, the traditional NoCs suffer from high latency and energy dissipation in on-chip data transfer due to conventional multihop metal/dielectric-based interconnects. Three-dimensional integration, on-chip photonics, RF, and wireless links have been proposed as radical low-power and low-latency alternatives to the conventional planar wire-based designs. Wireless NoCs with Carbon NanoTube (CNT) antennas are shown to outperform traditional wire-based NoCs significantly in achievable data rate and energy dissipation. However, such emerging and transformative technologies will be prone to high levels of failures due to various issues related to manufacturing challenges and integration. On the other hand, several naturally occurring complex …",
        "citations": 27
    },
    {
        "title": "An energy-efficient and robust millimeter-wave wireless network-on-chip architecture",
        "id": "tuWDm5kAAAAJ:4DMP91E08xMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:4DMP91E08xMC",
        "authors": [
            "Naseef Mansoor",
            "Amlan Ganguly",
            "Manoj Prashanth Yuvaraj"
        ],
        "pub_source": "2013 IEEE International Symposium on Defect and Fault Tolerance in VLSI and Nanotechnology Systems (DFTS)",
        "pub_date": "2013/10/2",
        "description": "Millimeter-wave (mm-wave) wireless interconnects have emerged as a promising solution to the energy-latency issues of global interconnects. Wireless Network-on-Chip (WiNoC) architectures with CMOS compatible mm-wave transceivers can achieve significant improvements in performance and energy-efficiency in on-chip data transfer for multicore chips. A token-based medium access mechanism is used in several mm-wave WiNoC architectures to enable a distributed and optimal utilization of the available wireless bandwidth among multiple transmitters. However, on-chip wireless interconnects being an emerging technology can suffer from high rates of failures. High frequency transceivers are especially vulnerable to noise. Consequently, failure of the token passing mechanism can significantly degrade the potential benefits of this novel interconnect technology. Traditional error correction mechanisms are …",
        "citations": 9
    },
    {
        "title": "A robust medium access mechanism for millimeter-wave wireless network-on-chip architecture",
        "id": "tuWDm5kAAAAJ:Wp0gIr-vW9MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Wp0gIr-vW9MC",
        "authors": [
            "Naseef Mansoor",
            "Manoj Prashanth Yuvaraj",
            "Amlan Ganguly"
        ],
        "pub_source": "2013 IEEE International SOC Conference",
        "pub_date": "2013/9/4",
        "description": "Wireless Network-on-Chip (WiNoC) has emerged as a promising alternative to conventional wireline Network-on-Chip (NoC) architectures for integrating hundreds of cores on the same die due to higher data bandwidth and energy-efficiency. Token-based medium access mechanism is used in several WiNoC architectures to enable a distributed and optimal utilization of the available wireless bandwidth among multiple transmitters. Consequently, failure of the token passing mechanism can significantly degrade the potential benefits of this novel interconnect technology. In this paper, we propose the design of a small-world WiNoC architecture augmented with a robust token management scheme to overcome the consequences of such failures.",
        "citations": 7
    },
    {
        "title": "Design Technologies for Green and Sustainable Computing Systems",
        "id": "tuWDm5kAAAAJ:MXK_kJrjxJIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:MXK_kJrjxJIC",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Ganguly",
            "Krishnendu Chakrabarty"
        ],
        "pub_source": "Springer",
        "pub_date": "2013/7/17",
        "description": "Modern large-scale computing systems, such as data centers and high-performance computing (HPC) clusters, are severely constrained by power and cooling costs for solving extreme-scale (or exascale) problems. The relentless increase in power consumption is of growing concern due to several reasons, eg, cost, reliability, scalability, and environmental impact. A report from the Environmental Protection Agency (EPA) indicates that the nation’s servers and data centers alone use about 1.5% of the total national energy consumed per year, at a cost of approximately $4.5 billion. The growing energy demands in data centers and HPC clusters are of utmost concern and there is a need to build efficient and sustainable computing environments that reduce the negative environmental impacts. Emerging technologies to support these computing systems are therefore of tremendous interest. Power management in data …",
        "citations": 7
    },
    {
        "title": "Evaluating effects of thermal management in wireless NoC-enabled multicore architectures",
        "id": "tuWDm5kAAAAJ:aqlVkmm33-oC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:aqlVkmm33-oC",
        "authors": [
            "Jacob Murray",
            "Paul Wettin",
            "Partha Pande",
            "Behrooz Shirazi",
            "Nishad Nerurkar",
            "Amlan Ganguly"
        ],
        "pub_source": "2013 International Green Computing Conference Proceedings",
        "pub_date": "2013/6/27",
        "description": "Massive multicore processors are enablers for many information and communication technology (ICT) innovations spanning various domains, including healthcare, defense, and entertainment. In the design of high-performance massive multicore chips, power and heat are dominant constraints. The increasing power consumption is of growing concern due to several reasons, e.g., cost, performance, reliability, scalability, and environmental impact. As we demand more from our computing systems, they will be limited by power, energy, and thermal constraints. Without new paradigms of energy-efficient designs, producing ICT systems capable of meeting the computing, storage, and communication demands of emerging applications will be unlikely. Architectural innovation in conjunction with suitable power and thermal management strategies is the key for designing high performance yet energy-efficient massive …",
        "citations": 8
    },
    {
        "title": "Design space exploration for reliable mm-wave wireless NoC architectures",
        "id": "tuWDm5kAAAAJ:qxL8FJ1GzNcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:qxL8FJ1GzNcC",
        "authors": [
            "Paul Wettin",
            "Partha Pratim Pande",
            "Deukhyoun Heo",
            "Benjamin Belzer",
            "Sujay Deb",
            "Amlan Ganguly"
        ],
        "pub_source": "2013 IEEE 24th International Conference on Application-Specific Systems, Architectures and Processors",
        "pub_date": "2013/6/5",
        "description": "The Network-on-Chip (NoC) paradigm is used as a scalable interconnection infrastructure for multi-core chips. To enhance the performance of conventional interconnect-based multi-core chips, on-chip wireless interconnect has emerged as a radically different technology. However, this emerging interconnect paradigm imposes significant challenges pertaining to reliable integration and design. In this paper, we focus on two types of mm-wave wireless NoC architectures. One is a hierarchical architecture with long-range wireless shortcuts and the other is a power-law connectivity based small-world network without any hierarchy. We demonstrate that though the hierarchical architecture offers more bandwidth with lower energy dissipation than the small-world-based counterpart, it has significantly more area overhead. Also, the power-law connectivity based small-world wireless NoC is more robust in presence of …",
        "citations": 17
    },
    {
        "title": "Energy-efficient multicore chip design through cross-layer approach",
        "id": "tuWDm5kAAAAJ:M3ejUd6NZC8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:M3ejUd6NZC8C",
        "authors": [
            "Paul Wettin",
            "Jacob Murray",
            "Partha Pande",
            "Behrooz Shirazi",
            "Amlan Ganguly"
        ],
        "pub_source": "2013 Design, Automation & Test in Europe Conference & Exhibition (DATE)",
        "pub_date": "2013/3/18",
        "description": "Traditional multi-core designs, based on the Network-on-Chip (NoC) paradigm, suffer from high latency and power dissipation as the system size scales up due to the inherent multi-hop nature of communication. Introducing long-range, low power, and high-bandwidth, single-hop links between far apart cores can significantly enhance the performance of NoC fabrics. In this paper, we propose design of a small-world network based NoC architecture with on-chip millimeter (mm)-wave wireless links. The millimeter wave small-world NoC (mSWNoC) is capable of improving the overall latency and energy dissipation characteristics compared to the conventional mesh-based counterpart. The mSWNoC helps in improving the energy dissipation, and hence the thermal profile, even further in presence of network-level dynamic voltage and frequency scaling (DVFS) without incurring any additional latency penalty.",
        "citations": 24
    },
    {
        "title": "Sustainable and Reliable On-Chip Wireless Communication Infrastructure for Massive Multi-core Systems",
        "id": "tuWDm5kAAAAJ:3fE2CSJIrl8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:3fE2CSJIrl8C",
        "authors": [
            "Amlan Ganguly",
            "Partha Pande",
            "Benjamin Belzer",
            "Alireza Nojeh"
        ],
        "pub_source": "Evolutionary Based Solutions for Green Computing",
        "pub_date": "2013",
        "description": "The Network-on-Chip paradigm has emerged as an enabling methodology to integrate high number of functional cores on a single die. However, the metal interconnect based multi-hop on-chip networks result in high latency and energy dissipation in data transfer. In order to alleviate these problems several emerging interconnect technologies have been proposed. Wireless NoC architectures are shown to outperform the wired counterparts by several orders of magnitude in energy dissipation while achieving higher data transfer rates. However, reliability of the wireless links along with the metal NoC interconnects are known to be a major concern in the future technology nodes. Powerful error control codes based on product codes can enhance the resilience of the wireless channels making the overall NoC more reliable. A unified error control mechanism to enhance the resilience to transient errors of the …",
        "citations": 5
    },
    {
        "title": "Introduction to the special issue on sustainable and green computing systems",
        "id": "tuWDm5kAAAAJ:_kc_bZDykSQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:_kc_bZDykSQC",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Ganguly"
        ],
        "pub_source": "ACM Journal on Emerging Technologies in Computing Systems (JETC) 8 (4), 1-3",
        "pub_date": "2012/11/30",
        "description": "It is our pleasure to introduce this special issue on sustainable and green computing systems. Modern large-scale computing systems, such as data centers and highperformance computing (HPC) clusters are severely constrained by power and cooling costs for solving extreme-scale (or exascale) problems. This increasing power consumption is of growing concern due to several reasons, for example, cost, reliability, scalability, and environmental impact. A report from the Environmental Protection Agency (EPA) indicates that the nation’s servers and data centers alone use about 1.5% of the total national energy consumed per year, at a cost of approximately $4.5 billion. The growing energy demands in data centers and HPC clusters are of utmost concern and there is a need to build efficient and sustainable computing environments that reduce the negative environmental impacts. Emerging technologies to support …",
        "citations": 3
    },
    {
        "title": "Design of an energy-efficient CMOS-compatible NoC architecture with millimeter-wave wireless interconnects",
        "id": "tuWDm5kAAAAJ:4TOpqqG69KYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:4TOpqqG69KYC",
        "authors": [
            "Sujay Deb",
            "Kevin Chang",
            "Xinmin Yu",
            "Suman Prasad Sah",
            "Miralem Cosic",
            "Amlan Ganguly",
            "Partha Pratim Pande",
            "Benjamin Belzer",
            "Deukhyoun Heo"
        ],
        "pub_source": "IEEE Transactions on Computers",
        "pub_date": "2012/9/13",
        "description": "The Network-on-chip (NoC) is an enabling technology to integrate large numbers of embedded cores on a single die. The existing methods of implementing a NoC with planar metal interconnects are deficient due to high latency and significant power consumption arising out of multihop links used in data exchange. To address these problems, we propose design of a hierarchical small-world wireless NoC architecture where the multihop wire interconnects are replaced with high-bandwidth and single-hop long-range wireless shortcuts operating in the millimeter (mm)-wave frequency range. The proposed mm-wave wireless NoC (mWNoC) outperforms the corresponding conventional wireline counterpart in terms of achievable bandwidth and is significantly more energy efficient. The performance improvement is achieved through efficient data routing and optimum placement of wireless hubs. Multiple wireless …",
        "citations": 240
    },
    {
        "title": "Performance evaluation and design trade-offs for wireless network-on-chip architectures",
        "id": "tuWDm5kAAAAJ:Tyk-4Ss8FVUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Tyk-4Ss8FVUC",
        "authors": [
            "Kevin Chang",
            "Sujay Deb",
            "Amlan Ganguly",
            "Xinmin Yu",
            "Suman Prasad Sah",
            "Partha Pratim Pande",
            "Benjamin Belzer",
            "Deukhyoun Heo"
        ],
        "pub_source": "ACM Journal on Emerging Technologies in Computing Systems (JETC)",
        "pub_date": "2012/8/15",
        "description": "Massive levels of integration are making modern multicore chips all pervasive in several domains. High performance, robustness, and energy-efficiency are crucial for the widespread adoption of such platforms. Networks-on-Chip (NoCs) have emerged as communication backbones to enable a high degree of integration in multicore Systems-on-Chip (SoCs). Despite their advantages, an important performance limitation in traditional NoCs arises from planar metal interconnect-based multihop links with high latency and power consumption. This limitation can be addressed by drawing inspiration from the evolution of natural complex networks, which offer great performance-cost trade-offs. Analogous with many natural complex systems, future multicore chips are expected to be hierarchical and heterogeneous in nature as well. In this article we undertake a detailed performance evaluation for hierarchical small-world …",
        "citations": 150
    },
    {
        "title": "Performance evaluation of reliability aware photonic network-on-chip architectures",
        "id": "tuWDm5kAAAAJ:ULOm3_A8WrAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ULOm3_A8WrAC",
        "authors": [
            "Pradheep Khanna Kaliraj",
            "Patrick Sieber",
            "Amlan Ganguly",
            "Ipshita Datta",
            "Debasish Datta"
        ],
        "pub_source": "2012 International Green Computing Conference (IGCC)",
        "pub_date": "2012/6/4",
        "description": "Network-on-Chip (NoC) is the preferred communication backbone for modern multicore chips. However, the multi-hop data transmission using wireline interconnects result in high energy dissipation and latency. Photonic interconnects have emerged as a promising alternative to the conventional metal/dielectric based on-chip wireline interconnects. Several novel architectures have been proposed using photonic waveguides as interconnects, which are capable of reducing the energy dissipation in data transfer significantly. However, the issues of reliability arising due to waveguide losses and adjacent channel crosstalk in photonic waveguides have not received much attention till date. In this paper we evaluate the performance of a photonic NoC architecture designed by segmenting the waveguides into smaller parts to limit the waveguide losses. This multi-segmented bus based photonic NoC (MSB-PNoC …",
        "citations": 15
    },
    {
        "title": "NoC architectures with adaptive code division multiple access based wireless links",
        "id": "tuWDm5kAAAAJ:UebtZRa9Y70C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:UebtZRa9Y70C",
        "authors": [
            "Anuroop Vidapalapati",
            "Vineeth Vijayakumaran",
            "Amlan Ganguly",
            "Andres Kwasinski"
        ],
        "pub_source": "2012 IEEE International Symposium on Circuits and Systems (ISCAS)",
        "pub_date": "2012/5/20",
        "description": "Multi-hop data transfer in conventional Networks-on-Chips (NoCs) results in lower rates of data transfer and higher energy dissipation. Long-range millimeter-wave wireless interconnects were envisioned to alleviate this problem. However, as the bandwidth of the wireless channels is limited an efficient media access control (MAC) scheme is required to enhance the utilization of the available bandwidth. In this paper we show that with multiple simultaneous access of the shared wireless medium using a traffic-adaptive Code Division Multiple Access (CDMA) scheme the peak performance can be improved significantly while lowering energy dissipation in data transfer compared to the conventional wireline counterparts.",
        "citations": 26
    },
    {
        "title": "Wireless NoC as interconnection backbone for multicore chips: Promises and challenges",
        "id": "tuWDm5kAAAAJ:ufrVoPGSRksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:ufrVoPGSRksC",
        "authors": [
            "Sujay Deb",
            "Amlan Ganguly",
            "Partha Pratim Pande",
            "Benjamin Belzer",
            "Deukhyoun Heo"
        ],
        "pub_source": "IEEE Journal on emerging and selected topics in circuits and systems",
        "pub_date": "2012/5/9",
        "description": "Current commercial systems-on-chips (SoCs) designs integrate an increasingly large number of predesigned cores and their number is predicted to increase significantly in the near future. For example, molecular-scale computing promises single or even multiple order-of-magnitude improvements in device densities. The network-on-chip (NoC) is an enabling technology for integration of large numbers of embedded cores on a single die. The existing method of implementing a NoC with planar metal interconnects is deficient due to high latency and significant power consumption arising out of long multi-hop links used in data exchange. The latency, power consumption and interconnect routing problems of conventional NoCs can be addressed by replacing or augmenting multi-hop wired paths with high-bandwidth single-hop long-range wireless links. This opens up new opportunities for detailed investigations into …",
        "citations": 380
    },
    {
        "title": "Cmos compatible many-core noc architectures with multi-channel millimeter-wave wireless links",
        "id": "tuWDm5kAAAAJ:kNdYIx-mwKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:kNdYIx-mwKoC",
        "authors": [
            "Sujay Deb",
            "Kevin Chang",
            "Miralem Cosic",
            "Amlan Ganguly",
            "Partha P Pande",
            "Deukhyoun Heo",
            "Benjamin Belzer"
        ],
        "pub_source": "Proceedings of the great lakes symposium on VLSI",
        "pub_date": "2012/5/3",
        "description": "Traditional many-core designs based on the Network-on-Chip (NoC) paradigm suffer from high latency and power dissipation as the system size scales up due to their inherent multi-hop communication. NoC performance can be significantly enhanced by introducing long-range, low power, and high-bandwidth single-hop wireless links between far apart cores. This paper presents a design methodology and performance evaluation for a hierarchical small-world NoC with CMOS compatible on-chip millimeter (mm)-wave wireless long-range communication links. The proposed wireless NoC offers significantly higher bandwidth and lower energy dissipation compared to its conventional non-hierarchical wired counterpart in presence of both uniform and non-uniform traffic patterns. The performance improvement is achieved through efficient data routing and optimum placement of wireless hubs. Multiple wireless …",
        "citations": 27
    },
    {
        "title": "A denial-of-service resilient wireless NoC architecture",
        "id": "tuWDm5kAAAAJ:8k81kl-MbHgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:8k81kl-MbHgC",
        "authors": [
            "Amlan Ganguly",
            "Mohsin Yusuf Ahmed",
            "Anuroop Vidapalapati"
        ],
        "pub_source": "Proceedings of the great lakes symposium on VLSI",
        "pub_date": "2012/5/3",
        "description": "Wireless Network-on-Chip (NoC) architectures have emerged as an enabling solution to design scalable NoC fabrics for massive many-core chips. However, such massive levels of integration of Intellectual Property (IP) cores make the chips vulnerable to malicious intrusions from untrustworthy processes or vendors. Hence, resilience to various types of hardware security threats is imperative in future many-core chips. In this paper we develop a design methodology to increase the resilience of a wireless NoC to Denial-of-Service (DoS) attacks. We demonstrate that the proposed architecture can sustain higher data transfer rates at lower energy dissipation with the spread of DoS attacks compared to conventional mesh based NoCs.",
        "citations": 24
    },
    {
        "title": "Design of an efficient NoC architecture using millimeter-wave wireless links",
        "id": "tuWDm5kAAAAJ:Se3iqnhoufwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Se3iqnhoufwC",
        "authors": [
            "Sujay Deb",
            "Kevin Chang",
            "Amlan Ganguly",
            "Xinmin Yu",
            "Christof Teuscher",
            "Partha Pande",
            "Deukhyoun Heo",
            "Benjamin Belzer"
        ],
        "pub_source": "Thirteenth International Symposium on Quality Electronic Design (ISQED)",
        "pub_date": "2012/3/19",
        "description": "The Network-on-Chip (NoC) is an enabling technology to integrate large numbers of embedded cores on a single die. Traditional multi-core designs based on the NoC paradigm suffer from high latency and power dissipation due to the inherent multi-hop nature of communication. The performance of NoC fabrics can be significantly enhanced by introducing long-range, low power, and high-bandwidth single-hop links between far apart cores. In this paper we present a design methodology and performance evaluation for a hierarchical small-world NoC with on-chip millimeter (mm)-wave wireless channels as long-range communication links. The proposed wireless NoC offers significantly better performance in terms of achievable bandwidth and energy dissipation compared to its conventional multi-hop wired counterpart in both uniform and non-uniform traffic scenarios. The performance improvement is achieved …",
        "citations": 51
    },
    {
        "title": "Energy-Eﬃcient Network-on-Chip Architectures for Multi-Core Systems",
        "id": "tuWDm5kAAAAJ:abG-DnoFyZgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:abG-DnoFyZgC",
        "authors": [
            "Partha Pande",
            "Amlan Ganguly",
            "Sujay Deb",
            "Kevin Chang"
        ],
        "pub_source": "Handbook of Energy-Aware and Green Computing, Volume 1",
        "pub_date": "2012/1/24",
        "description": "Modern large-scale computing systems, such as data centers and high-performance computing (HPC) clusters are severely constrained by power and cooling costs for solving extreme-scale (or exascale) problems. This increasing power consumption is of growing concern due to several reasons, for example, cost, reliability, scalability, and environmental impact. A report from the Environmental Protection Agency (EPA) indicates that the nation’s servers and data centers alone used about 1.5% of the total national energy consumed per year, for a cost of approximately $4.5 billion. The growing energy demands in data centers andHPCclusters are of utmost concern and there is a need to build eﬃcient and sustainable computing environments that reduce the negative environmental impacts. On the other hand, continuing progress and integration levels in silicon technologiesmakepossible complete end-user …"
    },
    {
        "title": "Energy-Efficient Network-on-Chip Architectures for Multi-Core Systems.",
        "id": "tuWDm5kAAAAJ:NMxIlDl6LWMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:NMxIlDl6LWMC",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Ganguly",
            "Sujay Deb",
            "Kevin Chang"
        ],
        "pub_source": "Handbook of Energy-Aware and Green Computing",
        "pub_date": "2012",
        "citations": 2
    },
    {
        "title": "Application of Massive Transfusion Protocol is Associated with Low Incidence of Coagulopathy and Mortality Rate",
        "id": "tuWDm5kAAAAJ:YOwf2qJgpHMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:YOwf2qJgpHMC",
        "authors": [
            "A Khalafallah",
            "AM Albarzan",
            "A Ganguly",
            "G Bates",
            "F Gavin"
        ],
        "pub_source": "J Blood Disord Transfus",
        "pub_date": "2012",
        "description": "Background: Massive haemorrhage and subsequent Massive Transfusion (MT) are associated with serious, often fatal complications including intractable Disseminated Intravascular Coagulation (DIC). Historically undesirable outcomes demonstrate the need to improve the management approach of MT. It is clear that evidence-based guidelines and protocols should be developed with the aim of improving MT-outcome.Methods: We implemented an evidence-based MT-Protocol (MTP) in 2007 and studied all patients (105) from Jan 2008 to Jan 2011 who required MT and were treated with the MTP at our institution. The MTP includes two phases and incorporates a fixed volume of Fresh Frozen Plasma (FFP), cryoprecipitate and platelets in addition to Packed Red Blood Cells (PRBC).Results: The median age of patients was 57 years (range, 18-86). The male to female ratio was 74: 31. Median Hb was 90 g/L (range, 44-110) and platelet count was 190/nl (range, 34-817). Thirteen patients developed mild DIC; 22 moderate DIC and one severe DIC. D-dimer showed average increase of 7.9 mg/L with a range between 0.6-35 mg/L (Normal< 0.5). Average INR was 1.97,(range, 1.2-7.2), while average APTT was 36 seconds (range, 22-88s). The mortality rate was 11.4%(12/105) and these were mainly related to underlying trauma rather than DIC with the exception of 1 patient. The average number of transfused PRBC was 15 units (range, 6-42); cryoprecipitate, 20 (range, 10-60); platelets, 2 (range, 1-7) and FFP, 8 (range, 2-20).Conclusion: Despite serious bleeding secondary to trauma or surgery, the implementation of MTP seems to have reduced the …",
        "citations": 6
    },
    {
        "title": "A unified error control coding scheme to enhance the reliability of a hybrid wireless network-on-chip",
        "id": "tuWDm5kAAAAJ:LkGwnXOMwfcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:LkGwnXOMwfcC",
        "authors": [
            "Amlan Ganguly",
            "Partha Pande",
            "Benjamin Belzer",
            "Alireza Nojeh"
        ],
        "pub_source": "2011 IEEE international symposium on defect and fault tolerance in VLSI and nanotechnology systems",
        "pub_date": "2011/10/3",
        "description": "Hybrid wireless Network-on-Chip (NoC) has emerged as an alternative to the traditional multi-hop wire line NoC to achieve higher performance and low energy dissipation in on-chip data transfer. However, introduction of on-chip wireless links lowers the overall reliability of the data communication fabric. In this paper we propose a unified Error Control Coding (ECC) mechanism which can be effectively used to restore the reliability of a Wireless NoC (WiNoC). We demonstrate that with carefully designed ECC schemes in the WiNoC it is possible to achieve high gains in performance due to the wireless links while maintaining comparable reliability as that of a traditional wire line NoC.",
        "citations": 38
    },
    {
        "title": "Curbing energy cravings in networks: A cross-sectional view across the micro-macro boundary",
        "id": "tuWDm5kAAAAJ:Zph67rFs4hoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Zph67rFs4hoC",
        "authors": [
            "Amlan Ganguly",
            "Partha Kundu",
            "Pradip Bose"
        ],
        "pub_source": "Proceedings of the Fifth ACM/IEEE International Symposium on Networks-on-Chip",
        "pub_date": "2011/5/1",
        "description": "The soaring power dissipation of computing infrastructures has effectively become a key performance bottleneck. At the same time, thermal issues arising from power hungry devices result in compromising reliability of such systems. At present, the processor cores within a chip multiprocessor (CMP) are interconnected using on-chip networks. At the same time, the emerging era of cloud computing and the associated large-scale distributed computing model are stretching the limits of computer networking. Hence, as an essential and pervasive fabric that binds all computing machinery, there is an underlying network that appears with varying scale and characteristics. In this paper, we take a look at methodologies for better management of the power budget across the cross-section of computing systems traversing the boundary between micro-level on-chip networks to macro-level cloud computing. We discuss …"
    },
    {
        "title": "Complex network inspired fault-tolerant NoC architectures with wireless links",
        "id": "tuWDm5kAAAAJ:YsMSGLbcyi4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:YsMSGLbcyi4C",
        "authors": [
            "Amlan Ganguly",
            "Paul Wettin",
            "Kevin Chang",
            "Partha Pande"
        ],
        "pub_source": "Proceedings of the fifth ACM/IEEE International Symposium on Networks-on-Chip",
        "pub_date": "2011/5/1",
        "description": "The Network-on-Chip (NoC) paradigm has emerged as a scalable interconnection infrastructure for modern multi-core chips. However, with growing levels of integration, the traditional NoCs suffer from high latency and energy dissipation in on-chip data transfer due to conventional metal/dielectric based interconnects. Three-dimensional integration, on-chip photonic, RF and wireless links have been proposed as radical low-power and low-latency alternatives to the conventional planar wire-based designs. Wireless NoCs with Carbon Nanotube (CNT) antennas are shown to outperform traditional wire based NoCs by several orders of magnitude in power dissipation and latency. However such transformative technologies will be prone to high levels of faults and failures due to various issues related to manufacturing and integration. On the other hand, several naturally occurring complex networks such as colonies of …",
        "citations": 56
    },
    {
        "title": "Sustainability through massively integrated computing: Are we ready to break the energy efficiency wall for single-chip platforms?",
        "id": "tuWDm5kAAAAJ:WF5omc3nYNoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:WF5omc3nYNoC",
        "authors": [
            "Partha Pande",
            "Fabien Clermidy",
            "Diego Puschini",
            "Imen Mansouri",
            "Paul Bogdan",
            "Radu Marculescu",
            "Amlan Ganguly"
        ],
        "pub_source": "2011 Design, Automation & Test in Europe",
        "pub_date": "2011/3/14",
        "description": "While traditional cluster computers are more constrained by power and cooling costs for solving extreme-scale (or exascale) problems, the continuing progress and integration levels in silicon technologies make possible complete end-user systems on a single chip. This massive level of integration makes modern multicore chips all pervasive in domains ranging from climate forecasting and astronomical data analysis, to consumer electronics, smart phones, and biological applications. Consequently, designing multicore chips for exascale computing while using the embedded systems design principles looks like a promising alternative to traditional cluster-based solutions. This paper aims to present an overview of new, far-reaching design methodologies and run-time optimization techniques that can help breaking the energy efficiency wall in massively integrated single-chip computing platforms.",
        "citations": 18
    },
    {
        "title": "Comparative performance evaluation of wireless and optical NoC architectures",
        "id": "tuWDm5kAAAAJ:0EnyYjriUFMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:0EnyYjriUFMC",
        "authors": [
            "Sujay Deb",
            "Kevin Chang",
            "Amlan Ganguly",
            "Partha Pande"
        ],
        "pub_source": "23rd IEEE international SOC conference",
        "pub_date": "2010/9/27",
        "description": "Network-on-Chip architectures with various new emerging interconnect technologies offer unprecedented performance gain compared to their more conventional planar metal interconnect-based counterparts. A comparative analysis of these emerging NoCs will provide a better understanding towards adopting them in the mainstream design. This paper compares performance of small-world NoC architectures having wireless and RF links with optical NoCs and presents design trade offs with system size scaling. Our analysis demonstrates that the small-world NoC architecture with THz wireless shortcuts provides the best performance-area overhead trade-off compared to the other NoCs for both uniform and non-uniform traffic across various system sizes.",
        "citations": 24
    },
    {
        "title": "Scalable hybrid wireless network-on-chip architectures for multicore systems",
        "id": "tuWDm5kAAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Amlan Ganguly",
            "Kevin Chang",
            "Sujay Deb",
            "Partha Pratim Pande",
            "Benjamin Belzer",
            "Christof Teuscher"
        ],
        "pub_source": "IEEE Transactions on Computers",
        "pub_date": "2010/8/19",
        "description": "Multicore platforms are emerging trends in the design of System-on-Chips (SoCs). Interconnect fabrics for these multicore SoCs play a crucial role in achieving the target performance. The Network-on-Chip (NoC) paradigm has been proposed as a promising solution for designing the interconnect fabric of multicore SoCs. But the performance requirements of NoC infrastructures in future technology nodes cannot be met by relying only on material innovation with traditional scaling. The continuing demand for low-power and high-speed interconnects with technology scaling necessitates looking beyond the conventional planar metal/dielectric-based interconnect infrastructures. Among different possible alternatives, the on-chip wireless communication network is envisioned as a revolutionary methodology, capable of bringing significant performance gains for multicore SoCs. Wireless NoCs (WiNoCs) can be designed …",
        "citations": 376
    },
    {
        "title": "Enhancing performance of network-on-chip architectures with millimeter-wave wireless interconnects",
        "id": "tuWDm5kAAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Sujay Deb",
            "Amlan Ganguly",
            "Kevin Chang",
            "Partha Pande",
            "Benjamin Beizer",
            "Deuk Heo"
        ],
        "pub_source": "ASAP 2010-21st IEEE International Conference on Application-specific Systems, Architectures and Processors",
        "pub_date": "2010/7/7",
        "description": "In a traditional Network-on-Chip (NoC), latency and power dissipation increase with system size due to its inherent multi-hop communications. The performance of NoC communication fabrics can be significantly enhanced by introducing long-range, low power, high bandwidth direct links between far apart cores. In this paper a design methodology for a scalable hierarchical NoC with on-chip millimeter (mm)-wave wireless links is proposed. The proposed wireless NoC offers significantly higher throughput and lower energy dissipation compared to its conventional multi-hop wired counterpart. It is also demonstrated that the proposed hierarchical NoC with long range wireless links shows significant performance gains in presence of various application-specific traffic and multicast scenarios.",
        "citations": 124
    },
    {
        "title": "Towards a scalable and reliable wireless network-on-chip",
        "id": "tuWDm5kAAAAJ:5nxA0vEk-isC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:5nxA0vEk-isC",
        "authors": [
            "Amlan Ganguly"
        ],
        "pub_source": "Washington State University",
        "pub_date": "2010",
        "description": "Multi-core platforms are emerging trends in the design of Systems-on-Chip (SoCs). Interconnect fabrics for these multi-core SoCs play a crucial role in achieving the target performance. The Network-on-Chip (NoC) paradigm has been proposed as a promising solution for designing the interconnect fabric of multi-core SoCs. But the performance requirements of NoC infrastructures in future technology nodes cannot be met by relying only on material innovation with traditional scaling. The continuing demand for low power and high speed interconnects with technology scaling necessitates looking beyond the conventional planar metal/dielectric-based interconnect infrastructures. Among different possible alternatives, the on-chip wireless communication network is envisioned as a revolutionary methodology, capable of bringing significant performance gains for multi-core SoCs. Wireless NoCs (WiNoCs) can be …",
        "citations": 1
    },
    {
        "title": "Hybrid wireless network on chip: A new paradigm in multi-core design",
        "id": "tuWDm5kAAAAJ:UeHWp8X0CEIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:UeHWp8X0CEIC",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Ganguly",
            "Kevin Chang",
            "Christof Teuscher"
        ],
        "pub_source": "Proceedings of the 2nd international Workshop on Network on Chip Architectures",
        "pub_date": "2009/12/12",
        "description": "The performance benefits of conventional Network-on-Chip (NoC) architectures are limited by the high latency and energy dissipation in long distance multihop communication between embedded cores. This limitation of conventional NoC architectures can be addressed by introducing long-range, high bandwidth and low power wireless links between the distant cores. Using miniaturized on-chip antennas as an enabling technology, wireless NoCs (WiNoCs) can be designed. In this paper, we elaborate the design principles of a hybrid WiNoC. It is demonstrated that a WiNoC outperforms its wireline counterpart and the performance gain is more significant for larger system size.",
        "citations": 59
    },
    {
        "title": "Performance evaluation of wireless networks on chip architectures",
        "id": "tuWDm5kAAAAJ:Y0pCki6q_DkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Y0pCki6q_DkC",
        "authors": [
            "Amlan Ganguly",
            "Kevin Chang",
            "Partha Pratim Pande",
            "Benjamin Belzer",
            "Alireza Nojeh"
        ],
        "pub_source": "2009 10th International Symposium on Quality Electronic Design",
        "pub_date": "2009/3/16",
        "description": "The performance benefits of conventional Network-on-Chip (NoC) architectures are limited by the high latency and energy dissipation in long distance multihop communication between embedded cores. To alleviate these problems, wireless on-chip networks are envisioned. Using miniaturized on-chip antennas as an enabling technology, wireless NoCs (WiNoCs) can be designed. In this paper we elaborate on the design methodology and technology requirements for a WiNoC and evaluate its performance. It is demonstrated that a WiNoC outperforms its wireline counterpart in terms of network throughput and latency, and that energy dissipation improves by an order of magnitude.",
        "citations": 32
    },
    {
        "title": "Crosstalk-aware channel coding schemes for energy efficient and reliable NOC interconnects",
        "id": "tuWDm5kAAAAJ:u-x6o8ySG0sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:u-x6o8ySG0sC",
        "authors": [
            "Amlan Ganguly",
            "Partha Pratim Pande",
            "Benjamin Belzer"
        ],
        "pub_source": "IEEE Transactions on Very Large Scale Integration (VLSI) Systems",
        "pub_date": "2009/3/16",
        "description": "Network-on-chip (NOC) is emerging as a revolutionary methodology to integrate numerous intellectual property blocks in a single die. It is the packet switching-based communications backbone that interconnects the components on multicore system-on-chip (SoC). A major challenge that NOC design is expected to face is related to the intrinsic unreliability of the interconnect infrastructure under technology limitations. By incorporating error control coding schemes along the interconnects, NOC architectures are able to provide correct functionality in the presence of different sources of transient noise and yet have lower overall energy dissipation. In this paper, designs of novel joint crosstalk avoidance and triple-error-correction/quadruple-error-detection codes are proposed, and their performance is evaluated in different NOC fabrics. It is demonstrated that the proposed codes outperform other existing coding …",
        "citations": 139
    },
    {
        "title": "Test and fault tolerance for networks-on-chip infrastructures",
        "id": "tuWDm5kAAAAJ:hqOjcs7Dif8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:hqOjcs7Dif8C",
        "authors": [
            "Partha Pratim Pande",
            "Cristian Grecu",
            "Amlan Ganguly",
            "Andre Ivanov",
            "Resve Saleh"
        ],
        "pub_source": "NETWORKS-ON-CHIPS",
        "pub_date": "2009",
        "description": "Traditionally, correct fabrication of integrated circuits is verified by postmanufacturing testing using different techniques ranging from scan-based techniques to delay and current-based tests [1]. Due to their particular nature, Networks-on-Chips (NoCs) are exposed to a range of faults that can escape the classic test procedures. Such faults include crosstalk, faults in the buffers of NoC routers, and higher-level faults such as packet mis-routing and data scrambling [2]. These fault types add to the classic faults that must be tested postfabrication for all integrated circuits (stuck-at, opens, shorts, memory faults, etc.). Consequently, the test time of NoC-based systems increases considerably due to these new faults. Test time is an important component of the test cost and, implicitly, of the total fabrication cost of a chip. For large volume production, the total time that a chip requires for testing must be reduced as much as …",
        "citations": 2
    },
    {
        "title": "Reliability of wireless on-chip interconnects based on carbon nanotube antennas",
        "id": "tuWDm5kAAAAJ:eQOLeE2rZwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:eQOLeE2rZwMC",
        "authors": [
            "A Nojeh",
            "P Pande",
            "A Ganguly",
            "S Sheikhaei",
            "B Belzer",
            "A Ivanov"
        ],
        "pub_source": "2008 IEEE 14th International Mixed-Signals, Sensors, and Systems Test Workshop",
        "pub_date": "2008/6/18",
        "description": "Design technologies for integrated systems beyond the current CMOS era will present unprecedented advantages such as very high device densities and challenges such as soaring power dissipation issues. Most of the research effort in the emerging area of nanoelectronics has revolved around creating novel devices to replace the traditional CMOS transistor. The development of higher-level communication architectures necessary for integrating such devices into high performance systems has not received the same level of attention so far. With the current trend of CMOS scaling, traditional planar metal-based on-chip interconnect schemes are projected to be the principal bottleneck in meeting the performance needs and specifications of Systems on Chip (SoCs). Three-dimensional integration and on-chip optical and RF communication links have been envisioned as promising alternatives. In this paper we …",
        "citations": 15
    },
    {
        "title": "Design of low power & reliable networks on chip through joint crosstalk avoidance and multiple error correction coding",
        "id": "tuWDm5kAAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:9yKSN-GCB0IC",
        "authors": [
            "Amlan Ganguly",
            "Partha Pratim Pande",
            "Benjamin Belzer",
            "Cristian Grecu"
        ],
        "pub_source": "Journal of electronic testing",
        "pub_date": "2008/6",
        "description": "Network on Chip (NoC) is an enabling methodology of integrating a very high number of intellectual property (IP) blocks in a single System on Chip (SoC). A major challenge that NoC design is expected to face is the intrinsic unreliability of the interconnect infrastructure under technology limitations. Research must address the combination of new device-level defects or error-prone technologies within systems that must deliver high levels of reliability and dependability while satisfying other hard constraints such as low energy consumption. By incorporating novel error correcting codes it is possible to protect the NoC communication fabric against transient errors and at the same time lower the energy dissipation. We propose a novel, simple coding scheme called Crosstalk Avoiding Double Error Correction Code (CADEC). Detailed analysis followed by simulations with three commonly used NoC …",
        "citations": 67
    },
    {
        "title": "Novel interconnect infrastructures for massive multicore chips—an overview",
        "id": "tuWDm5kAAAAJ:roLk4NBRz8UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:roLk4NBRz8UC",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Ganguly",
            "Benjamin Belzer",
            "Alireza Nojeh",
            "Andre Ivanov"
        ],
        "pub_source": "2008 IEEE International Symposium on Circuits and Systems (ISCAS), 2777-2780",
        "pub_date": "2008/5/18",
        "description": "With the well-known trend of CMOS scaling as per Moore’s Law, traditional on-chip interconnect systems are reaching the point of having a very limited ability to meet the performance needs and specifications of Systems-on-Chip (SoCs). The conventional two-dimensional (2D) copper-based IC has inherent limitations due to the geometrical constraints of the planar structure. Innovative interconnect paradigms based on optical technologies, RF/wireless, carbon nanotubes, or 3D integration are promising alternatives that may indeed overcome the challenges encountered. In this paper we present an overview of different emerging non-traditional approaches to achieve massive degree of integration in a single chip. The advantages and underlying challenges of each method are highlighted.",
        "citations": 9
    },
    {
        "title": "Energy reduction through crosstalk avoidance coding in networks on chip",
        "id": "tuWDm5kAAAAJ:W7OEmFMy1HYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:W7OEmFMy1HYC",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Ganguly",
            "Haibo Zhu",
            "Cristian Grecu"
        ],
        "pub_source": "Journal of Systems Architecture",
        "pub_date": "2008/3/1",
        "description": "Commercial designs are currently integrating from 10 to 100 embedded processors in a single system on chip (SoC) and the number is likely to increase significantly in the near future. With this ever increasing degree of integration, design of communication architectures for large, multi-core SoCs is a challenge. Traditional bus-based systems will no longer be able to meet the clock cycle requirements of these big SoCs. Instead, the communication requirements of these large multi processor SoCs (MP-SoCs) are convened by the emerging network-on-chip (NoC) paradigm. Crosstalk between adjacent wires is an important signal integrity issue in NoC communication fabrics and it can cause timing violations and extra energy dissipation. Crosstalk avoidance codes (CACs) can be used to improve the signal integrity by reducing the effective coupling capacitance, lowering the energy dissipation of wire segments. As …",
        "citations": 25
    },
    {
        "title": "Applicability of energy efficient coding methodology to address signal integrity in 3D NoC fabrics",
        "id": "tuWDm5kAAAAJ:_FxGoFyzp5QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:_FxGoFyzp5QC",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Gangul",
            "Brett Feero",
            "Cristian Grecu"
        ],
        "pub_source": "13th IEEE International On-Line Testing Symposium (IOLTS 2007)",
        "pub_date": "2007/7/8",
        "description": "Three dimensional (3D) network on chip (NoC) has attracted researchers' attention recently. 3D NoCs are capable of achieving better system throughput and lower latency compared to the corresponding 2D implementations. To fully exploit the performance benefits of 3D architectures, it is imperative to address signal integrity issues in the design phase and its implications on energy dissipation. In this work we show that by incorporating joint crosstalk avoidance and multiple error correction schemes it is possible to enhance the robustness and reduce the energy dissipation simultaneously for both the 3D and more conventional planar NoC architectures. The achievable energy savings in 3D NoCs is significantly more than that in 2D structures.",
        "citations": 8
    },
    {
        "title": "Addressing signal integrity in networks on chip interconnects through crosstalk-aware double error correction coding",
        "id": "tuWDm5kAAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Amlan Ganguly",
            "Partha Pratim Pande",
            "Benjamin Belzer",
            "Cristian Grecu"
        ],
        "pub_source": "IEEE Computer Society Annual Symposium on VLSI (ISVLSI'07)",
        "pub_date": "2007/3/9",
        "description": "The network on chip (NoC) paradigm continues to increasingly capture interest from the industrial and academic communities. Signal integrity is projected to present critical challenges in the design and implementation of NoCs. The widespread adoption and deployment of the NoC paradigm will only be possible if it inherently addresses system level signal integrity and reliability issues in addition to easing the design process. In order to protect the NoC interconnect infrastructures against different transient malfunctions, we propose to modify the data packets with joint crosstalk avoidance and double error correction codes. This not only makes the NoC architecture tolerant against transient malfunctions, but also lowers energy dissipation",
        "citations": 26
    },
    {
        "title": "Transient error resilience in network-on-chip communication fabrics",
        "id": "tuWDm5kAAAAJ:KlAtU1dfN6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:KlAtU1dfN6UC",
        "authors": [
            "Amlan Ganguly"
        ],
        "pub_source": "Washington State University",
        "pub_date": "2007/5",
        "description": "I would like to take this opportunity to express my gratefulness to my advisor Dr. Partha Pratim Pande for having guided me through the curriculum so well. His active involvement in my research and incessant inspiration has made this work possible. I also thank him for having allowed me freedom of thought and choice of research direction. Special thanks goes to Dr. Benjamin Belzer for having helped me with his expertise in coding theory providing a strong buttress to my work. I would also like to thank my colleagues Mr. Brett Feero, Mr. Haibo Zhu and Mr. Souradip Sarkar for their frequent help and brainstorming which always helped me to strengthen the foundations of my conceptual understanding of the problems. My parents, Mr. Ashutosh Ganguly and Mrs. Uma Ganguly have always been extremely inspiring. Through their experience and caring they have made it possible for me to pursue research at a school of higher learning. Without their support none of this work would have been possible.",
        "citations": 1
    },
    {
        "title": "Design of low power & reliable networks on chip through joint crosstalk avoidance and forward error correction coding",
        "id": "tuWDm5kAAAAJ:u5HHmVD_uO8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:u5HHmVD_uO8C",
        "authors": [
            "Partha Pratim Pande",
            "Amlan Ganguly",
            "Brett Feero",
            "Benjamin Belzer",
            "Cristian Grecu"
        ],
        "pub_source": "2006 21st IEEE International Symposium on Defect and Fault Tolerance in VLSI Systems",
        "pub_date": "2006/10/4",
        "description": "With the ever-increasing degrees of integration, design of communication architectures for big systems on chip (SoCs) is a challenge. The communication requirements of these large multi processor SoCs (MP-SoCs) are convened by the emerging network-on-a-chip (NoC) paradigm. To become a viable alternative IC design methodology, the NoC paradigm must address system-level reliability issues, which are among the dominant concerns for SoC design. The basic operations of NoCs are governed by on-chip packet switched networks. On the other hand, incorporation of different coding schemes in SoC design is being investigated as a means to increase system reliability. As NoCs are built on packet-switching, it is very natural to modify the data packets by adding extra bits of coded information to protect against any transient malfunction. By incorporating joint crosstalk avoidance coding (CAC) and forward …",
        "citations": 79
    },
    {
        "title": "Crosstalk-aware energy reduction in NOC communication fabrics",
        "id": "tuWDm5kAAAAJ:zYLM7Y9cAGgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:zYLM7Y9cAGgC",
        "authors": [
            "Partha Pratim Pande",
            "Haibo Zhu",
            "Amlan Ganguly",
            "Cristian Grecu"
        ],
        "pub_source": "2006 IEEE International SOC Conference",
        "pub_date": "2006/9/24",
        "description": "Interconnect fabrics of multi-core systems - on-chip are confronted with increased crosstalk effects and energy dissipation. Crosstalk avoidance coding (CAC) is a promising way to reduce the coupling capacitance of the interconnect wires. We propose a method to address both crosstalk and energy dissipation in networks-on-chip (NoC) by modifying the structure of the data packets and reducing the number of coding-decoding operations. Our results show that by incorporating crosstalk avoidance coding (CAC) schemes in the NoC data stream it is possible to save a significant amount of energy while communicating between multiple IP cores.",
        "citations": 19
    },
    {
        "title": "Energy reduction through crosstalk avoidance coding in NoC paradigm",
        "id": "tuWDm5kAAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:qjMakFHDy7sC",
        "authors": [
            "Partha Pratim Pande",
            "Haibo Zhu",
            "Amlan Ganguly",
            "Cristian Grecu"
        ],
        "pub_source": "9th EUROMICRO Conference on Digital System Design (DSD'06)",
        "pub_date": "2006/8/30",
        "description": "Commercial designs are currently integrating from 10 to 100 embedded functional and storage blocks in a single SoC and the number is likely to increase significantly in the near future. With this ever increasing degree of integration, design of communication architectures for big SoCs is a challenge. The communication requirements of these large multi processor SoCs (MP-SoCs) are convened by the emerging network-on-a-chip (NoC) paradigm. The basic operations of NoC infrastructures are governed by on-chip packet-switched networks. Crosstalk between adjacent wires is an issue in NoC communication fabrics and it can cause timing violations and extra power dissipation. Crosstalk avoidance codes (CACs) can be used to improve signal integrity and also reduce the coupling capacitance and hence the energy dissipation of a wire segment. By incorporating crosstalk avoidance coding (CAC) in NoC data …",
        "citations": 46
    },
    {
        "title": "An embedded system for pollution control in automobiles by using a MEMS accelerometer signal",
        "id": "tuWDm5kAAAAJ:hFOr9nPyWt4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:hFOr9nPyWt4C",
        "authors": [
            "S Kal",
            "A Ganguly",
            "Andrea Boni"
        ],
        "pub_source": "2005 IEEE Conference on Emerging Technologies and Factory Automation",
        "pub_date": "2005/9/19",
        "description": "In this paper an embedded system for the pollution control in automobiles is described. In particular, the focus is on the description of the control algorithm, which receives, as an input, a signal from a MEMS accelerometer and uses it to control the fuel injection rate, in order to reduce the toxic emissions from the exhaust gases. A DSP implementation and simulation results of the same are detailed",
        "citations": 7
    },
    {
        "title": "An embedded system for pollution control in automobiles by Using a MEMS accelerometer Signal",
        "id": "tuWDm5kAAAAJ:EkHepimYqZsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:EkHepimYqZsC",
        "authors": [
            "A Ganguly",
            "Andrea Boni",
            "S Kal"
        ],
        "pub_source": "10th IEEE International Conference on Emerging Technologies and Factory Automation",
        "pub_date": "2005",
        "description": "An embedded system for pollution control in automobiles by Using a MEMS accelerometer \nSignal IRIS IRIS Home Sfoglia Macrotipologie & tipologie Autore Titolo Riviste Serie IT Italiano \nItaliano English English LOGIN 1.IRIS 2.SIARI UNITN 3.04 Convegni (Proceedings) 4.04.1 \nSaggio in atti di convegno (Paper in Proceedings) An embedded system for pollution control \nin automobiles by Using a MEMS accelerometer Signal Boni, Andrea; 2005-01-01 Scheda \nbreve Scheda completa Scheda completa (DC) Anno di pubblicazione (Date of publication) \n2005 Titolo del volume (Proceedings title) 10th IEEE International Conference on Emerging \nTechnologies and Factory Automation Luogo di edizione (Place of publication) Piscataway \n(NJ) Casa editrice (Publisher) IEEE Tutti gli autori A., Ganguly; Boni, Andrea; S., Kal Appare \nnelle tipologie: 04.1 Saggio in atti di convegno (Paper in Proceedings) File in questo prodotto: …"
    },
    {
        "title": "RIT Digital Institutional Repositor y",
        "id": "tuWDm5kAAAAJ:4MWp96NkSFoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:4MWp96NkSFoC",
        "authors": [
            "Abhishek Vashist",
            "Maojia Li",
            "Amlan Ganguly",
            "Sai Manoj PD",
            "Clark Hochgraf"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "With the ever-increasing demands of e-commerce, the need for smarter warehousing is increasing exponentially. Such warehouses requires industry automation beyond Industry 4.0. In this work, we use consumer-grade millimeter-wave (mmWave) equipment to enable fast, and low-cost implementation of our localization system. However, the consumer-grade mmWave routers suffer from coarse-grained channel state information due to cost-effective antenna array design limiting the accuracy of localization systems. To address these challenges, we present a Machine Learning (ML) and Kalman Filter (KF) integrated localization system (KF-Loc). The ML model learns the complex wireless features for predicting the static position of the robot. When in dynamic motion, the static ML estimates suffer from position mispredictions, resulting in loss of accuracy. To overcome the loss in accuracy, we design and integrate a …"
    },
    {
        "title": "IEEE SOCC Organising Committee",
        "id": "tuWDm5kAAAAJ:BUYA1_V_uYcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:BUYA1_V_uYcC",
        "authors": [
            "Affiliation General Jürgen Becker",
            "Andrew Marshall",
            "Amlan Ganguly",
            "Ram Krishnamurthy",
            "Magdy Bayoumi",
            "Danella Zhao",
            "Mohamed El-Hadedu Aly",
            "Publicity Gillian McDowell",
            "Ramalingam Sridhar",
            "Kieran McLaughlin",
            "Finance Thomas Büchner"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "IEEE SOCC Organising Committee Page 1 xiii IEEE SOCC Organising Committee Chairs \nNames & Affiliation General Jürgen Becker, KIT, Germany Andrew Marshall, University of Texas, \nDallas, USA Technical Program Tanja Harbaum, KIT, Germany Amlan Ganguly, Rochester \nInstitute of Technology, USA Industrial Program Sakir Sezer, NVIDIA Corporation, UK Ram \nKrishnamurthy, Intel, USA Special Session Magdy Bayoumi, University of Louisiana at Lafayette, \nUSA Danella Zhao, Old Dominion University, USA Mohamed El-Hadedu Aly, California State \nPolytechnic University, Pomona, USA Publicity Gillian McDowell, NVIDIA Corporation, UK \nRamalingam Sridhar, SUNY at Buffalo, USA Publications Fahad Siddiqui, NVIDIA Corporation, \nUK Kieran McLaughlin, Queen’s University Belfast, UK Finance Thomas Büchner, IBM \nCorp., Germany IEEE CAS Liaison Mircea Stan, University of Virginia, USA Conference …"
    },
    {
        "title": "Session details: Session 5: The World of Neural Networks",
        "id": "tuWDm5kAAAAJ:j8SEvjWlNXcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:j8SEvjWlNXcC",
        "authors": [
            "Amlan Ganguly"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Session details: Session 5: The World of Neural Networks | Proceedings of the 2018 on Great \nLakes Symposium on VLSI skip to main content ACM Digital Library home ACM home Google, \nInc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals \nMagazines Proceedings Books SIGs Conferences People More Search ACM Digital Library \nSearchSearch Advanced Search glsvlsi Conference Proceedings Upcoming Events Authors \nAffiliations Award Winners More Home Conferences GLSVLSI Proceedings GLSVLSI '18 \nSession details: Session 5: The World of Neural Networks section Share on Session details: \nSession 5: The World of Neural Networks Session Chair: Amlan Ganguly Rochester Institute \nof Technology Rochester Institute of Technology View Profile Authors Info & Claims GLSVLSI \n'18: Proceedings of the 2018 on Great Lakes Symposium on VLSIMay 2018https://doi.org/…"
    },
    {
        "title": "2020 Index IEEE Computer Architecture Letters Vol. 19",
        "id": "tuWDm5kAAAAJ:tzM49s52ZIMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:tzM49s52ZIMC",
        "authors": [
            "R Bodduna",
            "D Brooks",
            "TE Carlson",
            "F Catthoor",
            "M Cavus",
            "A Chang",
            "A Chaudhary",
            "Y Che",
            "C Chen",
            "Z Chen",
            "W Choe",
            "ZI Chowdhury",
            "Z Chu",
            "M Connolly",
            "M Daneshtalab",
            "C Delimitrou",
            "L Deng",
            "H Desai",
            "TD Doudali",
            "AA Elkhail",
            "S Eyerman",
            "D Fan",
            "A Faust",
            "B Feinberg",
            "V Ganesan",
            "A Ganguly",
            "A Garcia-Ortiz",
            "J Gaudiot",
            "A Gavrilovska",
            "F Golshan",
            "P Gu",
            "D Guo",
            "M Guo"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "2020 Index IEEE Computer Architecture Letters Vol. 19 Page 1 1 IEEE COMPUTER \nARCHITECTURE LETTERS, VOL. 20, NO. 1, JANUARY-JUNE 2021 This index covers all \ntechnical items—papers, correspondence, reviews, etc.—that appeared in this periodical \nduring 2020, and items from previous years that were commented upon or corrected in 2020. \nDepartments and other items may also be covered if they have been judged to have archival \nvalue. The Author Index contains the primary entry for each item, listed under the first author’s \nname. The primary entry includes the coauthors’ names, the title of the paper or other item, and \nits location, specified by the publication abbreviation, year, month, and inclusive pagination. \nThe Subject Index contains entries describing the item under all appropriate subject headings, \nplus the first author’s name, the publication abbreviation, month, and year, and inclusive pages. …"
    },
    {
        "title": "2021 IEEE 39th International Conference on Computer Design (ICCD)| 978-1-6654-3219-1/21/$31.00© 2021 IEEE| DOI: 10.1109/ICCD53106. 2021.00099",
        "id": "tuWDm5kAAAAJ:7T2F9Uy0os0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:7T2F9Uy0os0C",
        "authors": [
            "Jaume Abella",
            "Shanmukha Murali Achyutha",
            "Nicolas Bohm Agostini",
            "Md Rubel Ahmed",
            "Baris Aksanli",
            "Khitam M Alatoun",
            "Mohammed Al-hayanni",
            "Sk Subidh Ali",
            "Todd Austin",
            "Aydin Aysu",
            "Hanyeoreum Bae",
            "Rong Bai",
            "Subho S Banerjee",
            "Marco Barbone",
            "Kevin Barker",
            "Kanad Basu",
            "Luca Benini",
            "Valeria Bertacco",
            "Kunal Bharathi",
            "Guillermo Botella",
            "Cormac Brick",
            "Nazareno Bruschi",
            "Xiaojun Cai",
            "Jing Cao",
            "Luca P Carloni",
            "Benjamin Carrion Schafer",
            "Francisco J Cazorla",
            "Deming Chen",
            "Dongwei Chen",
            "Jianxi Chen",
            "Quan Chen",
            "Xiangru Chen",
            "Zehao Chen",
            "Zhaohui Chen",
            "Wei Cheng",
            "Xu Cheng",
            "Yueqiang Cheng",
            "Andrew A Chien",
            "Kyunghwan Choi",
            "Prattay Chowdhury",
            "Ki-Seok Chung",
            "Stefan Dan Ciocirlan",
            "Mark Connolly",
            "Francesco Conti",
            "Huimin Cui",
            "Weihao Cui",
            "Guohao Dai",
            "Yuya Degawa",
            "Alberto A Del Barrio",
            "David Du",
            "Xiaoming Du",
            "Pete Ehrett",
            "Guy Eichler",
            "Ahmed Eltawil",
            "Teodor-Dumitru Ene",
            "Florian Enescu",
            "Isaías Felzmann",
            "Jingnai Feng",
            "Mohammed Fouda",
            "Kaihua Fu",
            "Amlan Ganguly",
            "Georgi Gaydadjiev",
            "Shijian Ge",
            "Tong Geng",
            "Sabih H Gerez",
            "Soumendu Ghosh",
            "Jeremy Giesen"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Author Index Page 1 Author Index Abella, Jaume 344 Achyutha, Shanmukha Murali 608 \nAgostini, Nicolas Bohm 33 Ahmed, Md Rubel 492 Aksanli, Baris 93, 321 Alatoun, Khitam M. \n608 Al-hayanni, Mohammed 117 Ali, Sk Subidh 599 Austin, Todd 395 Aysu, Aydin 583 Bae, \nHanyeoreum 316 Bai, Rong 174 Banerjee, Subho S. 299 Barbone, Marco 374 Barker, Kevin \n33 Basu, Kanad 252 Benini, Luca 409 Bertacco, Valeria 395 Bharathi, Kunal 41 Botella, \nGuillermo 138 Brick, Cormac 13 Bruschi, Nazareno 409 Cai, Xiaojun 25 Cao, Jing 551 Carloni, \nLuca P. 101 Carrion Schafer, Benjamin 1, 591 Cazorla, Francisco J. 344 Chen, Deming 299 \nChen, Dongwei 208 Chen, Jianxi 154 Chen, Quan 290, 307 Chen, Xiangru 285 Chen, \nZehao 25 Chen, Zhaohui 583 Chen, Ziyi 361 Cheng, Chung-Kuan 366 Cheng, Hsiang-Yun \n260 Cheng, Wei 575 Cheng, Xu 196, 208 Cheng, Yueqiang 559 Chien, Andrew A. 480 Choi, …"
    },
    {
        "title": "Umit Ogras CASES Chair University of Wisconsin-Madison",
        "id": "tuWDm5kAAAAJ:NJ774b8OgUMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:NJ774b8OgUMC",
        "authors": [
            "Ali Akoglu",
            "Lars Bauer",
            "Ganapati Bhat",
            "Swarup Bhunia",
            "Oliver Bringmann",
            "Luca Carloni",
            "Jeronimo Castrillon",
            "Wanli Chang",
            "Henri-Pierre Charles",
            "Mainak Chaudhuri",
            "Anup Das",
            "Jana Doppa",
            "Lide Duan",
            "Christophe Dubach",
            "William Fornaciari",
            "Amlan Ganguly",
            "Dibakar Gope",
            "Per Gunnar Kjeldsberg",
            "Puneet Gupta",
            "Yuko Hara-Azumi",
            "Joerg Henkel",
            "Jingtong Hu",
            "Paolo Ienne",
            "Changhee Jung",
            "Ramesh Karri",
            "Ryan Kim"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Provides a listing of current committee members and society officers."
    },
    {
        "title": "Acknowledgement to Reviewers of Journal of Low Power Electronics and Applications in 2019",
        "id": "tuWDm5kAAAAJ:W5xh706n7nkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:W5xh706n7nkC",
        "authors": [
            "Rajdeep Adhikari",
            "Giovanni Agosta",
            "Orazio Aiello",
            "Iddo Amit",
            "Asim Anwar",
            "Eladio Durán Aranda",
            "Diego Arcos-Aviles",
            "Jose-Maria Arnau",
            "Woorham Bae",
            "Padmanabhan Balasubramanian",
            "Antonio Di Bartolomeo",
            "Peter A Beerel",
            "Nicu Bizon",
            "Lisane Brisolara De Brisolara",
            "José Carlos Campelo",
            "Óscar Carranza",
            "Gerard Champenois",
            "Joel Charrier",
            "Lin Cheng",
            "Kyungwho Choi",
            "Minsu Choi",
            "Suji Choi",
            "Hwang-Cherng Chow",
            "Kwok Tai Chui",
            "Francesco Conti",
            "Christophe Delebarre",
            "Luigi Pio Di Noia",
            "Robert-Alexandru Dobre",
            "Jaya Dofe",
            "Manuel Jesús Domínguez-Morales",
            "Ashkan Eghbal",
            "Emanuele Enrico",
            "Vincenzo Eramo",
            "Flavio Esposito",
            "Marcelo Fernandes",
            "Jose Frances-Villora",
            "Matthias Függer",
            "Amlan Ganguly",
            "Robért Glein",
            "Radu Godina",
            "David W Graham",
            "Qingbo Guo",
            "Eric Gutierrez",
            "Mohammad Rafiqul Haider",
            "Ke Han",
            "Klaus Schütt Hansen",
            "Mohamed Hassan",
            "Weng-Geng Ho",
            "Zahir Hussain",
            "Bouraoui Ilahi"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The editorial team greatly appreciates the reviewers who have dedicated their considerable time and expertise to the journal’s rigorous editorial process over the past 12 months, regardless of whether the papers are finally published or not. In 2019, a total of 30 papers were published in the journal, with a median time to first decision of 23.5 days and a median time from submission to publication of 53 days. The editors would like to express their sincere gratitude to the following reviewers for their generous contribution in 2019: Adhikari, Rajdeep"
    },
    {
        "title": "Acknowledgement to Reviewers of Journal of Low Power Electronics and Applications in 2018",
        "id": "tuWDm5kAAAAJ:_Ybze24A_UAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:_Ybze24A_UAC",
        "authors": [
            "Sergi Abadal",
            "Michael Agyeman",
            "Filipp A Akopyan",
            "Muhammad Nadeem Akram",
            "Talib Al-Ameri",
            "Ricardo Albarracín",
            "Hammam Alsafrjalani",
            "Giovanni Ansaloni",
            "Hartwig Anzt",
            "Jose-Maria Arnau",
            "Rafael Aroca",
            "Sameer Arora",
            "Francis Assadian",
            "Woorham Bae",
            "Shahab Bahrami",
            "Thar Baker",
            "Padmanabhan Balasubramanian",
            "Evgeny Belyaev",
            "Yu Bi",
            "Enrique Blair",
            "Sebastien Boisseau",
            "Αngeliki Brouzgou",
            "Andrea Calimera",
            "Jose Manuel Cano Garcia",
            "Alexandra Carpen-Amarie",
            "Anjan Chakrabarty",
            "En-Chih Chang",
            "Yao-Feng Chang",
            "Wenjie Che",
            "Chunhui Chen",
            "Yu-Huei Cheng",
            "Ching-Hwa Cheng",
            "Zheng Jun Chew",
            "Minsu Choi",
            "Lukas Chrpa",
            "Angel Cid-Pastor",
            "Radu Ioan Ciobanu",
            "Francesco Conti",
            "Pasquale Corsonello",
            "Giovanni Crupi",
            "Angel De Castro",
            "Michele Dei",
            "Aidin Delnavaz",
            "Jia Di",
            "Wenbo Ding",
            "Jaya Dofe",
            "Aniruddha Dutta",
            "Vladimir Dyo",
            "Maher Fakih",
            "Xin Fan",
            "Igor Filanovsky",
            "Fabio Frustaci",
            "Michal Fularz",
            "Amlan Ganguly",
            "Gaetano D Gargiulo",
            "Manuel Gasulla",
            "Franck Gechter",
            "Mohamed Ghoneim",
            "Konstantinos Giannakis",
            "Jonathan Graham-Harper-Cater",
            "Mariagrazia Graziano",
            "Damien Guilbert",
            "Xinfei Guo",
            "Amin Hajizadeh",
            "Md Rifat Hazari",
            "Zhezhi He"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Acknowledgement to Reviewers of Journal of Low Power Electronics and Applications in 2018 \nAcknowledgement to Reviewers of Journal of Low Power Electronics and Applications in 2018 \nFull Text Rigorous peer-review is the corner-stone of high-quality academic publishing. The \neditorial team greatly appreciates the reviewers who contributed their knowledge and expertise \nto the journal’s editorial process over the past 12 months. In 2018, a total of 47 papers were \npublished in the journal, with a median time to first decision of 17 days and a median time to \npublication of 40 days. The editors would like to express their sincere gratitude to the following \nreviewers for their cooperation and dedication in 2018: Abadal, Sergi Li, Rui Agyeman, \nMichael Li, Xueqing Akopyan, Filipp A. Lin, Bor-Ren Akram, Muhammad Nadeem Lin, \nPei-Hung Al-Ameri, Talib Lin, Shu-Yen Albarracín, Ricardo Liu, Anfeng Alsafrjalani, Hammam …"
    },
    {
        "title": "Track Chairs",
        "id": "tuWDm5kAAAAJ:UHK10RUVsp4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:UHK10RUVsp4C",
        "authors": [
            "Amlan Ganguly",
            "Weiqiang Liu",
            "Varun Chandola",
            "Kumar Yelamarthi",
            "Edmond Nurellari",
            "Shakti Sinha",
            "Md Tauhidur Rahman",
            "Ajit Jha",
            "Hung La",
            "Fathi Amsaad",
            "Abhinav Kumar",
            "Bishnu Das",
            "Rashmi Jha",
            "S Sainarayanan",
            "Soumyajit Poddar",
            "Manish Goswami",
            "Hansraj Singh Bhamra",
            "Dharanidhar Dang",
            "Chandan Giri",
            "Mohammad Haider",
            "Ahmed Khourshed",
            "Naseef Mansoor",
            "Joycee Mekie",
            "Sandeep Miryala",
            "Nagi Naganathan",
            "Shilpa Pendyala",
            "Tauhidur Rahman",
            "Sudip Roy",
            "Sandeep Saini",
            "Muhammad Shafique",
            "Suraj Sharma",
            "Theo Theocharides",
            "Theocharis Theocharides",
            "Xiaoqing Wen",
            "Jaya Dofe",
            "YBN Kumar",
            "Devarshi Das",
            "Sagar Koorapati",
            "Ramesh Vaddi",
            "Santosh Kumar Vishvakarma",
            "Mahbub Alam"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Program Committee Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.ises 2020 Program Committee 2020, pp. \n19-21, DOI Bookmark: 10.1109/iSES50453.2020.00008 Keywords Authors Abstract Provides a \nlisting of current committee members and society officers. Program Committee iSES 2020 Track \nChairs Amlan Ganguly, Rochester Institute of Technology, US Weiqiang Liu, Nanjing University \nof Aeronautics and Astronautics, CN Varun Chandola, University at Buffalo, US Kumar …"
    },
    {
        "title": "VLSID & ES 2018–List of Reviewers",
        "id": "tuWDm5kAAAAJ:eq2jaN3J8jMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:eq2jaN3J8jMC",
        "authors": [
            "Abhinav Kranti",
            "Rajat Subhra Chakraborty",
            "Gaurav Saini",
            "Alex Doboli",
            "Rajendra Patrikar",
            "Govardhan Rao",
            "Amey Kulkarni",
            "Rajesh Bhagwat",
            "Gregory Chang",
            "Amir Masoud Gharehbaghi",
            "Rajiv Joshi",
            "Heba Khdr",
            "Amit Patra",
            "Ramesh Karri",
            "Honglan Jiang",
            "Amlan Ganguly",
            "Rangharajan Venkatesan",
            "Hwisoo So",
            "Amol Dharangutte",
            "Robert Karam",
            "Jack Tang",
            "Andreas Veneris",
            "Robert Wille",
            "Jiang Guiyuan",
            "Ankur Gupta",
            "Rolf Drechsler",
            "Jing Ye",
            "Ansuman Banerjee",
            "Sachin Patkar",
            "Ketan Budhiya",
            "Arijit Mondal",
            "Sandip Ray",
            "Lokesh Siddhu",
            "Arijit Raychowdhury",
            "Santanu Mahapatra",
            "Mahesh Balasubramanian",
            "Aritra Hazra",
            "Santosh Balasubramanian",
            "Mahesh Kumashikar",
            "Arnab Sarkar",
            "Santosh Vishvakarma",
            "Mandar Datar",
            "Arun Joseph Seetharam Narasimhan Manikandan RR",
            "Arya Rahimi",
            "Sheikh Nijam Ali",
            "Manish Rana",
            "Aryabartta Sahu",
            "Shigeru Yamashita",
            "Marc Stöttinger",
            "Aviral Shrivastava",
            "Shivam Bhasin",
            "Marcel Walter",
            "Bai Nguyen",
            "Shobha Vasudevan",
            "Michael Shamouilian",
            "Basant Dwivedi",
            "Shreepad Karmalkar",
            "Michele Lora",
            "Bhargab Bhattacharya",
            "Shreyas Sen",
            "Mike Hayenga",
            "Bibhu Datta Sahoo",
            "Siddharth Garg",
            "Mohammad Khayatian",
            "Bijan Alizadeh",
            "Siew Kei Lam",
            "Mohammadreza Mehrabian",
            "Bodhisatwa Mazumdar",
            "Smruti R Sarangi",
            "Morgan Ledwon",
            "Brajesh Kumar Kaushik",
            "Somyendu Raha",
            "Moslem Didehban",
            "Chandan Kumar Sarkar",
            "Soumya Pandit",
            "Piyoosh Purushottam Nair"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Reviewers Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource \nCenter Press Room Advertising About Us IEEE IEEE Computer Society IEEE Computer Society \nDigital Library My Subscriptions Magazines Journals Conference Proceedings Institutional \nSubscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press \nRoom Advertising About Us Cart All Advanced Search Conference Cover Image Download \n1.Home 2.Proceedings 3.vlsid 2018 Reviewers 2018, pp. xxiv-xxvii, DOI Bookmark: \n10.1109/VLSID.2018.14 Keywords Authors Abstract The conference offers a note of thanks and \nlists its reviewers. VLSID & ES 2018 31st International Conference on VLSI Design and 17th \nInternational Conference on Embedded Systems VLSID & ES 2018 – List of Reviewers Abhinav \nKranti Rajat Subhra Chakraborty Gaurav Saini Abhishek Dixit Rajendra Bishnoi gautam …"
    },
    {
        "title": "Organizing Committee v Technical Program Committee vi Steering Committee vii Keynote talk 1: How to Evaluate Efficient Deep Neural Network Approaches",
        "id": "tuWDm5kAAAAJ:_B80troHkn4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:_B80troHkn4C",
        "authors": [
            "Sergi Abadal",
            "Salvatore Monteleone",
            "Amlan Ganguly"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "NoCArc 2020 TOC Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings \nInstitutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center \nPress Room Advertising About Us Cart All Advanced Search Conference Cover Image \nDownload 1.Home 2.Proceedings 3.nocarc 2020 NoCArc 2020 TOC 2020, pp. ii, DOI Bookmark: \n10.1109/NoCArc51382.2020.9234570 Keywords Authors Table of ContentsMessage from \nthe ChairsSergi Abadal, Salvatore Monteleone, and Amlan GangulyUniversitat Politècnica \nde Catalunya, Spain; CY Cergy Paris Université, ENSEA, CNRS, France; Rochester Institute \nof Technology, NY, USiiiOrganizing Committee vTechnical Program Committee viSteering …"
    },
    {
        "title": "TPC Chairs",
        "id": "tuWDm5kAAAAJ:tkaPQYYpVKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:tkaPQYYpVKoC",
        "authors": [
            "Salvatore Monteleone",
            "Amlan Ganguly",
            "Ishan G Thakkar",
            "Naseef Mansoor",
            "John Jose"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "NoCArc 2020 Committees Toggle navigation IEEE Computer Society Digital Library Jobs Tech \nNews Resource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings \nInstitutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center \nPress Room Advertising About Us Cart All Advanced Search Conference Cover Image Download \n1.Home 2.Proceedings 3.nocarc 2020 NoCArc 2020 Committees 2020, pp. ii, DOI Bookmark: \n10.1109/NoCArc51382.2020.9234583 Keywords Authors 13th International Workshop \non Network on Chip Architectures (NoCArc)Organizing CommitteeGeneral Chair•Sergi \nAbadal, Universitat Politècnica de Catalunya, SpainTPC Chairs•Salvatore Monteleone, \nCY Cergy Paris Université, ENSEA, CNRS, France•Amlan Ganguly, Rochester Institute …"
    },
    {
        "title": "Unconventional Computing and What It Means for the Future of Interconnects",
        "id": "tuWDm5kAAAAJ:Y5dfb0dijaUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:Y5dfb0dijaUC",
        "authors": [
            "Amlan Ganguly"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Summary form only given, as follows. A record of the panel discussions was not made available for publication as part of the conference proceedings. The growing performance needs of modern data-driven applications related to the Internet-of-Things (IoT), Big Data, and Artificial Intelligence (AI) result in demand for increasingly higher levels of computational complexity, storage capacity, and communication performance in computing devices. Therefore, to meet the proliferating demands for computing without overshooting the global energy budget, scaling up the performance of the future computing systems with significant improvement in their energy-efficiency is of paramount importance. However, the computing industry will no longer be able to scale up computing capability and energy-efficiency using the basic approach of scaling down the transistor feature sizes or improving the bandwidth of conventional …"
    },
    {
        "title": "2015 Index IEEE Transactions on Multi-Scale Computing Systems Vol.",
        "id": "tuWDm5kAAAAJ:JV2RwH3_ST0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:JV2RwH3_ST0C",
        "authors": [
            "C Andras Moritz",
            "O Arias",
            "N Banerjee",
            "S Bhunia",
            "K Chakrabarty",
            "RS Chakraborty",
            "P Chang",
            "Y Chen",
            "Y Chien",
            "K Choi",
            "SJ Desai",
            "A Ganguly",
            "D Guo",
            "J Han",
            "K Hoang",
            "M Huang",
            "M Ibrahim",
            "PJS Iruthayaraj",
            "NK Jha",
            "Y Jin",
            "AP Johnson",
            "P Junsangsri",
            "SH Kang",
            "D Kim",
            "JH Ko",
            "S Lee",
            "K Li",
            "W Li",
            "F Liu",
            "M Liu",
            "F Lombardi",
            "N Mansoor",
            "M Mozaffari-Kermani",
            "BA Mudassar",
            "D Mukhopadhyay",
            "S Mukhopadhyay",
            "CJ Myers",
            "A Nelson",
            "AM Nia",
            "D Niu",
            "M Nourani",
            "OD Olorode"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "2015 Index IEEE Transactions on Multi-Scale Computing Systems Vol. 1 Page 1 238 IEEE \nTRANSACTIONS ON MULTI-SCALE COMPUTING SYSTEMS, VOL. 1, NO. 4, DECEMBER \n2015 2015 Index IEEE Transactions on Multi-Scale Computing Systems Vol. 1 This index \ncovers all technical items — papers, correspondence, reviews, etc. — that appeared in this \nperiodical during 2015, and items from previous years that were commented upon or corrected \nin 2015. Departments and other items may also be covered if they have been judged to have \narchival value. The Author Index contains the primary entry for each item, listed under the first \nauthor’s name. The primary entry includes the coauthors’ names, the title of the paper or other \nitem, and its location, specified by the publication abbreviation, year, month, and inclusive \npagination. The Subject Index contains entries describing the item under all appropriate subject …"
    },
    {
        "title": "Cristinel Ababei 255 KN Abhilash 347 Mohamed Abid 204 Cristhian Manuel Duran",
        "id": "tuWDm5kAAAAJ:L8Ckcad2t8MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:L8Ckcad2t8MC",
        "authors": [
            "Isam Akkawi",
            "Ali Akogluy",
            "Sonia Lopez Alarcon",
            "Ahmed Aldammas",
            "Abdullah Al-Dhelaan",
            "Shahab Ardalan",
            "Oliver Arnold",
            "David Asher",
            "Aytac Atac",
            "Raid Ayoubz",
            "Poona Bahrebar",
            "Virendra Bansal",
            "Mohammed S BenSaleh",
            "Nitesh K Bharadwaj",
            "Johan Borg",
            "Lilian Bossuet",
            "Nazeih M Botros",
            "Matt Briggs",
            "Wayne P Burleson",
            "Unni Chandran",
            "Chih-Yuan Chang",
            "Tian-Sheuan Chang",
            "Chih-Chi Chang",
            "Zhi-Hao Chang",
            "Shouri Chatterjee",
            "Yi-Chun Chen",
            "Wen-Cheng Chen",
            "Shih-Ming Chen",
            "Xiaofang Chen",
            "Zong-Yi Chen",
            "Jiaoyan Chen",
            "He Chen",
            "Chen Chen",
            "T-C Chen Oscal",
            "Zhimiao Chen",
            "Yu-Hsuan Chen",
            "Liang-Chia Cheng",
            "Jun-Hua Chiang",
            "Chiu-Sing Choy",
            "Jennifer Blain Christen",
            "Ting-Li Chu",
            "Yuan-Hua Chu",
            "Ching-Te Chuang",
            "Ching-Che Chung",
            "Chao-Kuei Chung",
            "Ezequiel Coelho",
            "Ellis Coheny",
            "Sorin Cotafona",
            "Adrian Cristal",
            "Shreyas Darne",
            "Aravind Dasu",
            "Sujay Deb",
            "Yi Deng",
            "Raj S Dua",
            "Shukai Duan",
            "Sourav Dutta",
            "Vasant Easwaran",
            "Jeremy S Edwards",
            "Jim Ellis",
            "D Azzedin",
            "Yuan Fang",
            "Hooman Farkhani",
            "Gerhard Fettweis",
            "Michael Fritze",
            "Peter Gadfort",
            "Amlan Ganguly",
            "Bharat Garg",
            "Robert Gauthier",
            "Heni Ghariani",
            "Ahmed Ginawi",
            "Satish Grandhi",
            "Paul Gratz",
            "Peter Gregorius"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Author index Page 1 xxvii AUTHOR INDEX Cristinel Ababei 255 KN Abhilash 347 Mohamed \nAbid 204 Cristhian Manuel Duran Acevedo 473 Isam Akkawi 268 Ali Akogluy 11 Sonia Lopez \nAlarcon 249 Ahmed Aldammas 177 Abdullah Al-Dhelaan 177 Shahab Ardalan 92 Oliver \nArnold 29 David Asher 268 Aytac Atac 426 Raid Ayoubz 146 Poona Bahrebar 70 Virendra \nBansal 336 Mohammed S. BenSaleh 204 Nitesh K Bharadwaj 306 Johan Borg 225 Lilian \nBossuet 330 Nazeih M. Botros 35 Matt Briggs 293 Wayne P. Burleson 341 Unni Chandran 324 \nChih-Yuan Chang 76 Tian-Sheuan Chang 76 Chih-Chi Chang 420 Zhi-Hao Chang 455 Shouri \nChatterjee 440 Yi-Chun Chen 76 Wen-Cheng Chen 98 Shih-Ming Chen 125 Xiaofang Chen \n471 Zong-Yi Chen 231 Jiaoyan Chen 274 He Chen 299 Chen Chen 415 Oscal T.-C Chen \n420 Zhimiao Chen 426 Yu-Hsuan Chen 455 Liang-Chia Cheng 286 Jun-Hua Chiang 125 Yi-…"
    },
    {
        "title": "ICPADS 2013",
        "id": "tuWDm5kAAAAJ:QIV2ME_5wuYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=tuWDm5kAAAAJ:QIV2ME_5wuYC",
        "authors": [
            "Sadia Afroz",
            "Sayaka Akioka",
            "Ahmed Ali-Eldin",
            "Abdelhalim Amer",
            "Elena Apostol",
            "Yupeng Chen",
            "Eunsang Cho",
            "Alexandru Costan",
            "Jin Cui",
            "Chengcheng Dai",
            "Carlos Díaz",
            "Jens Domke",
            "Youngmoon Eom",
            "Xi Fang",
            "Min Feng",
            "Keisuke Fukuda",
            "Amlan Ganguly",
            "Jason Gionta",
            "Neil Gong",
            "Zhitao Gong",
            "Saurabh Gupta",
            "Khaled Hamidouche",
            "Akihiro Hayashi",
            "Azam Hossain",
            "Longbo Huang",
            "Shadi Ibrahim",
            "Youngbin Im",
            "Akimitsu Kanzaki",
            "Farzad Khorasani",
            "Seok Kyoo Kim",
            "Seoyoung Kim",
            "Sai Charan Koduru",
            "Krish Kr",
            "Hojin Lee",
            "Wubin Li",
            "Yusen Li",
            "Xiongfei Liao",
            "Changhui Lin",
            "Miao Luo",
            "Alberto Magni",
            "Turbo Majumder",
            "Mayank Misra",
            "Diana Moise",
            "Lifeng Nai",
            "Moohyun Nam",
            "Bruno Nardelli",
            "Sourav Pal",
            "Miquel Pericas",
            "Kishore Kumar",
            "Wasiur Rahman",
            "Raghu Rajachandrasekhar",
            "Ivan Rodero",
            "Kento Sato",
            "Mina Sedaghat",
            "Bikash Sharma",
            "Rong Shi",
            "Hyogi Sim",
            "Junho Suh",
            "Petter Svärd",
            "Nidhi Tiwari",
            "Ruben Torres",
            "Radu Tudoran",
            "Akshay Venkatesh",
            "Keval Vora",
            "Trong-Hieu Vu",
            "Chao Wang",
            "Xiaofei Wang",
            "Yan Wang",
            "Changjun Wu",
            "Wenjian Xu",
            "Kok Lim Yau",
            "Lei Ye"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The conference offers a note of thanks and lists its reviewers."
    }
]