[
    {
        "title": "Evolving Face Mask Guidance During a Pandemic and Potential Harm to Public Perception: Infodemiology Study of Sentiment and Emotion on Twitter",
        "id": "3NxR_wkAAAAJ:W7OEmFMy1HYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:W7OEmFMy1HYC",
        "authors": [
            "Divya Ramjee",
            "Catherine C Pollack",
            "Marie-Laure Charpignon",
            "Shagun Gupta",
            "Jessica Malaty Rivera",
            "Ghinwa El Hayek",
            "Adam G Dunn",
            "Angel N Desai",
            "Maimuna S Majumder"
        ],
        "pub_source": "Journal of Medical Internet Research",
        "pub_date": "2023/2/27",
        "description": "Background Throughout the COVID-19 pandemic, US Centers for Disease Control and Prevention policies on face mask use fluctuated. Understanding how public health communications evolve around key policy decisions may inform future decisions on preventative measures by aiding the design of communication strategies (eg, wording, timing, and channel) that ensure rapid dissemination and maximize both widespread adoption and sustained adherence. Objective We aimed to assess how sentiment on masks evolved surrounding 2 changes to mask guidelines: (1) the recommendation for mask use on April 3, 2020, and (2) the relaxation of mask use on May 13, 2021. Methods We applied an interrupted time series method to US Twitter data surrounding each guideline change. Outcomes were changes in the (1) proportion of positive, negative, and neutral tweets and (2) number of words within a tweet tagged with a given emotion (eg, trust). Results were compared to COVID-19 Twitter data without mask keywords for the same period. Results There were fewer neutral mask-related tweets in 2020 (β=–3.94 percentage points, 95% CI –4.68 to –3.21; P<.001) and 2021 (β=–8.74, 95% CI –9.31 to –8.17; P<.001). Following the April 3 recommendation (β=.51, 95% CI .43-.59; P<.001) and May 13 relaxation (β=3.43, 95% CI 1.61-5.26; P<.001), the percent of negative mask-related tweets increased. The quantity of trust-related terms decreased following the policy change on April 3 (β=–.004, 95% CI –.004 to –.003; P<.001) and May 13 (β=–.001, 95% CI –.002 to 0; P=.008 …",
        "citations": 2
    },
    {
        "title": "The relationship between sextortion during COVID-19 and pre-pandemic intimate partner violence: A large study of victimization among diverse US men and women",
        "id": "3NxR_wkAAAAJ:zYLM7Y9cAGgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:zYLM7Y9cAGgC",
        "authors": [
            "Asia A Eaton",
            "Divya Ramjee",
            "Jessica F Saunders"
        ],
        "pub_source": "Victims & Offenders",
        "pub_date": "2023/2/17",
        "description": "In a large and diverse sample of U. S. adults, we assessed participants’ experience with pre-COVID in-person intimate partner violence (IPV) victimization and with sextortion victimization during COVID to better understand the relationship between these phenomena. Experiencing sexual IPV pre-COVID increased the likelihood that men and women would experience sextortion during COVID. Men, Black and Native women, LGBTQ individuals, and emerging adults more often experienced sextortion during COVID than other groups. Implications for research on technology-facilitated sexual violence and practice with survivors are explored.",
        "citations": 22
    },
    {
        "title": "Is Evolving Face Mask Guidance During a Pandemic Harmful to Public Perception?: An Analysis of Sentiment and Emotion on Twitter: Infodemiology Study.",
        "id": "3NxR_wkAAAAJ:Y0pCki6q_DkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:Y0pCki6q_DkC",
        "authors": [
            "D Ramjee",
            "CC Pollack",
            "ML Charpignon",
            "S Gupta",
            "JM Rivera",
            "G El Hayek",
            "A Dunn",
            "AN Desai",
            "MS Majumder"
        ],
        "pub_source": "Journal of Medical Internet Research",
        "pub_date": "2023/1/5",
        "description": "Throughout the COVID-19 pandemic, US Centers for Disease Control and Prevention policies on face mask usage fluctuated. Understanding how public health communications evolve around key policy decisions may inform future decisions around preventative measures by aiding the design of communication strategies (eg, wording, timing, channel) that ensure rapid dissemination and maximize both widespread adoption and sustained adherence. Assess how mask sentiment evolved surrounding two changes to mask guidelines:(1) recommendation for mask usage on April 3, 2020 and (2) relaxation of mask usage on May 13, 2021. Interrupted time series methods were applied to US Twitter data surrounding each guideline change. Outcomes were changes in the (1) proportion of positive, negative, and neutral tweets and (2) number of words within a tweet tagged with a given emotion (eg, trust). Results were compared to COVID-19 Twitter data without mask keywords for the same period. There were fewer neutral mask-related tweets in 2020 (β=-3.94 percentage points, 95% CI:-4.68,-3.21, P<. 001) and 2021 (β=-8.74, 95% CI:-9.31,-8.17, P<. 001). Following the April 3rd recommendation (β= 0.51, 95% CI: 0.43, 0.59, P<. 001) and May 13th relaxation (β= 3.43, 95% CI: 1.61, 5.26, P<. 001), the percent of negative mask-related tweets increased. The amount of trust-related terms decreased following the policy change on April 3 (β=-0.004, 95% CI:-0.004,-0.003, P<. 001) and May 13 (β=-0.001, 95% CI:-0.002, 0, P=. 008). The US-Twitter population responded negatively and with less trust following guideline shifts related to masking, regardless of …"
    },
    {
        "title": "Evaluating criminal justice reform during COVID-19: The need for a novel sentiment analysis package",
        "id": "3NxR_wkAAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Divya Ramjee",
            "Louisa H Smith",
            "Anhvinh Doanvo",
            "Marie-Laure Charpignon",
            "Alyssa McNulty-Nebel",
            "Elle Lett",
            "Angel N Desai",
            "Maimuna S Majumder"
        ],
        "pub_source": "PLOS digital health",
        "pub_date": "2022/7/13",
        "description": "The health and safety of incarcerated persons and correctional personnel have been prominent in the U.S. news media discourse during the COVID-19 pandemic. Examining changing attitudes toward the health of the incarcerated population is imperative to better assess the extent to which the general public favors criminal justice reform. However, existing natural language processing lexicons that underlie current sentiment analysis (SA) algorithms may not perform adequately on news articles related to criminal justice due to contextual complexities. News discourse during the pandemic has highlighted the need for a novel SA lexicon and algorithm (i.e., an SA package) tailored for examining public health policy in the context of the criminal justice system. We analyzed the performance of existing SA packages on a corpus of news articles at the intersection of COVID-19 and criminal justice collected from state-level outlets between January and May 2020. Our results demonstrated that sentence sentiment scores provided by three popular SA packages can differ considerably from manually-curated ratings. This dissimilarity was especially pronounced when the text was more polarized, whether negatively or positively. A randomly selected set of 1,000 manually scored sentences, and the corresponding binary document term matrices, were used to train two new sentiment prediction algorithms (i.e., linear regression and random forest regression) to verify the performance of the manually-curated ratings. By better accounting for the unique context in which incarceration-related terminologies are used in news media, both of our proposed models …",
        "citations": 1
    },
    {
        "title": "Is Evolving Face Mask Guidance During a Pandemic Harmful to Public Perception?: An Analysis of Sentiment and Emotion on Twitter",
        "id": "3NxR_wkAAAAJ:Tyk-4Ss8FVUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:Tyk-4Ss8FVUC",
        "authors": [
            "Divya Ramjee",
            "Catherine C Pollack",
            "Marie Charpignon",
            "Shagun Gupta",
            "Jessica Malaty Rivera",
            "Ghinwa El Hayek",
            "Angel Desai",
            "Maimuna S Majumder"
        ],
        "pub_source": "An Analysis of Sentiment and Emotion on Twitter (April 16, 2022)",
        "pub_date": "2022/4/16",
        "description": "Throughout the COVID-19 pandemic, US Centers for Disease Control and Prevention policies on face mask usage fluctuated. This study assessed how mask sentiment evolved surrounding two policy announcements:(1) mask recommendation on April 3, 2020 and (2) relaxation on May 13, 2021. Interrupted time series methods were applied to US Twitter data surrounding each policy change. Outcomes were changes in the (1) proportion of positive, negative, and neutral tweets and (2) number of words within a tweet tagged with a given emotion (eg, trust). Results were compared to COVID-19 Twitter data without mask keywords for the same period. There were fewer neutral mask-related tweets in 2020 (β=-3.94 percentage points, 95% CI:-4.68,-3.21, P<. 001) and 2021 (β=-8.74, 95% CI:-9.31,-8.17, P<. 001). Following the April 3rd recommendation (β= 0.51, 95% CI: 0.43, 0.59, P<. 001) and May 13th relaxation (β= 3.43, 95% CI: 1.61, 5.26, P<. 001), the percent of negative mask-related tweets increased. The amount of trust-related terms decreased following the policy change on April 3 (β=-0.004, 95% CI:-0.004,-0.003, P<. 001) and May 13 (β=-0.001, 95% CI:-0.002, 0, P=. 008). The US-Twitter population responded negatively and with less trust following policy shifts, regardless of whether the policy recommended or relaxed mask usage. Federal agencies should ensure that changes in public health recommendations are communicated concisely and rapidly."
    },
    {
        "title": "Evaluating criminal justice reform during COVID-19: The need for a novel sentiment analysis package. PLOS Digit Health 1 (7): e0000063",
        "id": "3NxR_wkAAAAJ:YsMSGLbcyi4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:YsMSGLbcyi4C",
        "authors": [
            "D Ramjee",
            "LH Smith",
            "A Doanvo",
            "ML Charpignon",
            "A McNulty-Nebel",
            "E Lett"
        ],
        "pub_source": "",
        "pub_date": "2022",
        "description": "The health and safety of incarcerated persons and correctional personnel have been prominent in the US news media discourse during the COVID-19 pandemic. Examining changing attitudes toward the health of the incarcerated population is imperative to better assess the extent to which the general public favors criminal justice reform. However, existing natural language processing lexicons that underlie current sentiment analysis (SA) algorithms may not perform adequately on news articles related to criminal justice due to contextual complexities. News discourse during the pandemic has highlighted the need for a novel SA lexicon and algorithm (ie, an SA package) tailored for examining public health policy in the context of the criminal justice system. We analyzed the performance of existing SA packages on a corpus of news articles at the intersection of COVID-19 and criminal justice collected from state-level outlets between January and May 2020. Our results demonstrated that sentence sentiment scores provided by three popular SA packages can differ considerably from manually-curated ratings. This dissimilarity was especially pronounced when the text was more polarized, whether negatively or positively. A randomly selected set of 1,000 manually scored sentences, and the corresponding binary document term matrices, were used to train two new sentiment prediction algorithms (ie, linear regression and random forest regression) to verify the performance of the manually-curated ratings. By better accounting for the unique context in which incarceration-related terminologies are used in news media, both of our proposed models …"
    },
    {
        "title": "Evaluating Criminal Justice Reform During COVID-19: The Need for a Novel Sentiment Analysis Package (preprint)",
        "id": "3NxR_wkAAAAJ:eQOLeE2rZwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:eQOLeE2rZwMC",
        "authors": [
            "Divya Ramjee",
            "Louisa Smith",
            "Anhvinh Doanvo",
            "Marie Charpignon",
            "Alyssa McNulty",
            "Angel Desai",
            "Maimuna Majumder"
        ],
        "pub_source": "",
        "pub_date": "2021",
        "description": "Existing natural language processing lexicons that underlie current sentiment analysis (SA) algorithms may not perform adequately in certain academic disciplines depending on contextual complexities. The health and safety of incarcerated persons and correctional personnel have been prominent in news media discourse during the COVID-19 pandemic, potentially highlighting the need for a novel SA lexicon and algorithm that is tailored for the examination of public health policy in the context of the criminal justice system. We utilized a text corpus consisting of news articles at the intersection of COVID-19 and criminal justice to analyze the performance of existing lexicons collected across state-level outlets between January and May 2020. Our results demonstrated that sentence sentiment scores provided by three popular SA packages differ considerably from manually-curated ratings. This dissimilarity was especially pronounced when the text was more polarized, whether negatively or positively. A randomly selected set of 1,000 manually scored sentences, and the corresponding binary document term matrices, were used to train two new sentiment prediction algorithms (ie, linear regression and random forest regression) to verify the performance of the manually-curated ratings. By better accounting for the unique context in which incarceration-related terminologies are used in news media, both of our proposed models outperformed all existing SA packages considered for comparison. Our findings suggest that there is a need to develop a novel lexicon, and potentially an accompanying algorithm, for analysis of text related to public health …"
    },
    {
        "title": "COVID-19 and digital contact tracing: Regulating the future of public health surveillance",
        "id": "3NxR_wkAAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Divya Ramjee",
            "Pollyanna Sanderson",
            "Imran Malek"
        ],
        "pub_source": "Cardozo L. Rev. De-Novo",
        "pub_date": "2021",
        "description": "Given the scale of the coronavirus disease 2019 (COVID-19) pandemic, dependence on traditional contact tracingI alone may prove insufficient for countries to effectively and efficiently track and trace the spread of the severe acute respiratory coronavirus 2 (SARS-CoV-2). 2 With continued reliance on digital connectivity for numerous aspects of our lives, digital surveillance tools provide a potential opportunity to supplement existing contact tracing initiatives by facilitating the fast identification of known and unknown contacts. 3 Pressure is mounting to develop epidemiologically-useful digital tools, as states across the United States continue lifting stay-at-home orders and attempt to return to normal operations. 4 Over twenty states are currently considering, designing, or implementing digital contact tracing tools. s The accelerated development and launch of these tools",
        "citations": 14
    },
    {
        "title": "Machine learning maps research needs in COVID-19 literature",
        "id": "3NxR_wkAAAAJ:u-x6o8ySG0sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:u-x6o8ySG0sC",
        "authors": [
            "Anhvinh Doanvo",
            "Xiaolu Qian",
            "Divya Ramjee",
            "Helen Piontkivska",
            "Angel Desai",
            "Maimuna Majumder"
        ],
        "pub_source": "Patterns",
        "pub_date": "2020/12/11",
        "description": "As of August 2020, thousands of COVID-19 (coronavirus disease 2019) publications have been produced. Manual assessment of their scope is an overwhelming task, and shortcuts through metadata analysis (e.g., keywords) assume that studies are properly tagged. However, machine learning approaches can rapidly survey the actual text of publication abstracts to identify research overlap between COVID-19 and other coronaviruses, research hotspots, and areas warranting exploration. We propose a fast, scalable, and reusable framework to parse novel disease literature. When applied to the COVID-19 Open Research Dataset, dimensionality reduction suggests that COVID-19 studies to date are primarily clinical, modeling, or field based, in contrast to the vast quantity of laboratory-driven research for other (non-COVID-19) coronavirus diseases. Furthermore, topic modeling indicates that COVID-19 publications …",
        "citations": 43
    },
    {
        "title": "Evaluating interest in off-label use of disinfectants for COVID-19",
        "id": "3NxR_wkAAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:9yKSN-GCB0IC",
        "authors": [
            "Jessica Malaty Rivera",
            "Shagun Gupta",
            "Divya Ramjee",
            "Ghinwa Y El Hayek",
            "Nisrine El Amiri",
            "Angel N Desai",
            "Maimuna S Majumder"
        ],
        "pub_source": "The Lancet Digital Health",
        "pub_date": "2020/11/1",
        "description": "In February, 2020, during the initial phase of the COVID-19 pandemic, the US Centers for Disease Control and Prevention (CDC) made recommendations to clean and disinfect frequently-handled objects, which triggered nationwide panic buying of disinfectant products such as Clorox and Lysol. Numerous regu latory agencies and public health organisations (eg, CDC, US Food and Drug Administration, US Consumer Product Safety Commission, and the American Association of Poison Control Centers [AAPCC]) have repeatedly advised against ingestion and other off-label use of disinfectants and cleaning products. However, during a White House press briefing on April 23, 2020, President Trump implied that the White House Coronavirus Task Force should investigate injections of disinfectant as a potential treatment for COVID-19. 1 Health communication research shows that ideological and political affiliations …",
        "citations": 14
    },
    {
        "title": "Evaluating Interest in Off-Label Use of Disinfectants for COVID-19 with Google Trends",
        "id": "3NxR_wkAAAAJ:u5HHmVD_uO8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:u5HHmVD_uO8C",
        "authors": [
            "Jessica Malaty Rivera",
            "Shagun Gupta",
            "Divya Ramjee",
            "Ghinwa El Hayek",
            "Nisrine El Amiri",
            "Angel Desai",
            "Maimuna S Majumder"
        ],
        "pub_source": "The Lancet Digital Health",
        "pub_date": "2020/6/29",
        "description": "In the initial months of the Coronavirus Disease 2019 (COVID-19) pandemic, the US Centers for Disease Control and Prevention (CDC) made recommendations to clean and disinfect frequently-handled objects, triggering panic-buying of disinfectant products like Clorox® and Lysol® nationwide. During a White House press briefing on April 23, 2020, President Trump publicly implied that the White House Coronavirus Task Force should investigate injections of disinfectant as potential treatment for COVID-19. Across the United States, we evaluated Google Trends data to determine search interest from January 1, 2020 to May 10, 2020 regarding (1) the purchase and consumption of disinfectants and (2) poison control centers, which were included to examine correlated behavioral outcomes. Our work demonstrates a contemporaneous correlation between the President’s remarks and online search trends, with an over 3,000% overnight uptick in search interest for off-label use of disinfectants as well as increases in poison control cases. Public officials have the responsibility during public health emergencies to communicate issues that are evidence-based, and misleading information may adversely affect public knowledge and behavior.",
        "citations": 5
    },
    {
        "title": "Machine Learning Maps Research Needs in COVID-19 Literature (preprint)",
        "id": "3NxR_wkAAAAJ:WF5omc3nYNoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:WF5omc3nYNoC",
        "authors": [
            "Anhvinh L Doanvo",
            "Xiaolu Qian",
            "Divya Ramjee",
            "Helen Piontkivska",
            "Angel N Desai"
        ],
        "pub_source": "",
        "pub_date": "2020",
        "description": "SummaryManually assessing the scope of the thousands of publications on the COVID-19 (coronavirus disease 2019) pandemic is an overwhelming task. Shortcuts through metadata analysis (eg, keywords) assume that studies are properly tagged. However, machine learning approaches can rapidly survey the actual text of coronavirus abstracts to identify research overlap between COVID-19 and other coronavirus diseases, research hotspots, and areas warranting exploration. We propose a fast, scalable, and reusable framework to parse novel disease literature. When applied to the COVID-19 Open Research Dataset (CORD-19), dimensionality reduction suggested that COVID-19 studies to date are primarily clinical-, modeling-or field-based, in contrast to the vast quantity of laboratory-driven research for other (non-COVID-19) coronavirus diseases. Topic modeling also indicated that COVID-19 publications have thus far focused primarily on public health, outbreak reporting, clinical care, and testing for coronaviruses, as opposed to the more limited number focused on basic microbiology, including pathogenesis and transmission."
    },
    {
        "title": "The challenges of forensic genealogy: Dirty data, electronic evidence, and privacy concerns",
        "id": "3NxR_wkAAAAJ:UeHWp8X0CEIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:UeHWp8X0CEIC",
        "authors": [
            "Divya Ramjee",
            "Katelyn Ringrose"
        ],
        "pub_source": "Denv. L. Rev.",
        "pub_date": "2020",
        "description": "While forensic genealogy continues to gain popularity as a law enforcement tool for solving cold cases, discrepancies in testing and evidentiary standards, as well as ethical and privacy issues, continue to plague the practice. This Article examines the investigatory role of genetic information and the various methods by which genetic information can be collected, used, or shared, including by law enforcement. In the era of Big Data, we must understand the limitations posed by the reliability and accuracy of information included in private and publicly available genealogy databases and how those limitations compete with the desire to implement valid machine learning algorithms in the fields of criminology and law. Realizing that advancements in science often outpace regulatory legislation, this Article addresses ways in which private and publicly available genealogy services can safeguard genetic information …",
        "citations": 13
    },
    {
        "title": "Watch where you walk: law enforcement surveillance and protester privacy",
        "id": "3NxR_wkAAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:qjMakFHDy7sC",
        "authors": [
            "Katelyn Ringrose",
            "Divya Ramjee"
        ],
        "pub_source": "Calif. L. Rev. Online",
        "pub_date": "2020",
        "description": "Protest is a fundamental feature of democracy, yet protesters have been continuously met with domestic surveillance mechanisms intended to chill public free expression and criminalize lawful behavior. The deployment of privacy-invasive measures against protesters in public spaces has an extensive and storied history-one often rooted in racism and discrimination.'And while the technology may have changed, the purpose remains the same: to surveil, identify, and detain dissenters. 2",
        "citations": 12
    },
    {
        "title": "Using Africa as a Dumping Ground: Implications of Counterfeiting and Intellectual Property Infringement for Africa",
        "id": "3NxR_wkAAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=3NxR_wkAAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Kebharu Smith",
            "Divya Ramjee",
            "Tanya Hill"
        ],
        "pub_source": "The Brand Protection Professional",
        "pub_date": "2019/12"
    }
]