[
    {
        "title": "Finding Optimal Solutions with Neighborly Help",
        "id": "Z9W_SPAAAAAJ:k8Z6L05lTy4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:k8Z6L05lTy4C",
        "authors": [
            "Fabian Frei",
            "Elisabet Burjons",
            "Edith Hemaspaandra",
            "Dennis Komm",
            "David Wehner"
        ],
        "pub_source": "CISPA",
        "pub_date": "2024/3/6",
        "description": "Can we efficiently compute optimal solutions to instances of a hard problem from optimal solutions to neighbor instances, that is, instances with one local modification? For example, can we efficiently compute an optimal coloring for a graph from optimal colorings for all one-edge-deleted subgraphs? Studying such questions not only gives detailed insight into the structure of the problem itself, but also into the complexity of related problems, most notably, graph theory’s core notion of critical graphs (e.g., graphs whose chromatic number decreases under deletion of an arbitrary edge) and the complexity-theoretic notion of minimality problems (also called criticality problems, e.g., recognizing graphs that become 3-colorable when an arbitrary edge is deleted). We focus on two prototypical graph problems, colorability and vertex cover. For example, we show that it is NP-hard to compute an optimal coloring for a graph from optimal colorings for all its one-vertex-deleted subgraphs, and that this remains true even when optimal solutions for all one-edge-deleted subgraphs are given. In contrast, computing an optimal coloring from all (or even just two) one-edge-added supergraphs is in P. We observe that vertex cover exhibits a remarkably different behavior, demonstrating the power of our model to delineate problems from each other more precisely on a structural level. Moreover, we provide a number of new complexity results for minimality and criticality problems. For example, we prove that MINIMAL-3-UNCOLORABILITY is complete for  (differences of NP sets), which was previously known only for the more amenable case of deleting vertices rather than …"
    },
    {
        "title": "Check for updates",
        "id": "Z9W_SPAAAAAJ:MLfJN-KU85MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:MLfJN-KU85MC",
        "authors": [
            "Zack Fitzsimmons¹",
            "Edith Hemaspaandra"
        ],
        "pub_source": "Fundamentals of Computation Theory: 24th International Symposium, FCT 2023, Trier, Germany, September 18–21, 2023, Proceedings",
        "pub_date": "2023/9/21",
        "description": "It is important to study how strategic agents can affect the outcome of an election. There has been a long line of research in the computational study of elections on the complexity of manipulative actions such as manipulation and bribery. These problems model scenarios such as voters casting strategic votes and agents campaigning for voters to change their votes to make a desired candidate win. A common assumption is that the preferences of the voters follow the structure of a domain restriction such as single peakedness, and so manipulators only consider votes that also satisfy this restriction. We introduce the model where the preferences of the voters define their own restriction and strategic actions must “conform\" by using only these votes. In this model, the election after manipulation will retain common domain restrictions. We explore the computational complexity of conformant manipulative actions and we discuss how conformant manipulative actions relate to other manipulative actions."
    },
    {
        "title": "The Complexity of -Arrowing",
        "id": "Z9W_SPAAAAAJ:tuHXwOkdijsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:tuHXwOkdijsC",
        "authors": [
            "Zohair Raza Hassan",
            "Edith Hemaspaandra",
            "Stanisław Radziszowski"
        ],
        "pub_source": "International Symposium on Fundamentals of Computation Theory",
        "pub_date": "2023/9/18",
        "description": "For fixed nonnegative integers k and , the -Arrowing problem asks whether a given graph, G, has a red/blue coloring of E(G) such that there are no red copies of  and no blue copies of . The problem is trivial when , but has been shown to be coNP-complete when . In this work, we show that the problem remains coNP-complete for all pairs of k and , except (3, 4), and when .Our result is only the second hardness result for (F, H)-Arrowing for an infinite family of graphs and the first for 1-connected graphs. Previous hardness results for (F, H)-Arrowing depended on constructing graphs that avoided the creation of too many copies of F and H, allowing easier analysis of the reduction. This is clearly unavoidable with paths and thus requires a more careful approach. We define and prove the existence of special graphs that we refer to as “transmitters.” Using transmitters, we construct gadgets for three distinct …"
    },
    {
        "title": "Complexity of conformant election manipulation",
        "id": "Z9W_SPAAAAAJ:b1wdh0AR-JQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:b1wdh0AR-JQC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "International Symposium on Fundamentals of Computation Theory",
        "pub_date": "2023/9/18",
        "description": "It is important to study how strategic agents can affect the outcome of an election. There has been a long line of research in the computational study of elections on the complexity of manipulative actions such as manipulation and bribery. These problems model scenarios such as voters casting strategic votes and agents campaigning for voters to change their votes to make a desired candidate win. A common assumption is that the preferences of the voters follow the structure of a domain restriction such as single peakedness, and so manipulators only consider votes that also satisfy this restriction. We introduce the model where the preferences of the voters define their own restriction and strategic actions must “conform” by using only these votes. In this model, the election after manipulation will retain common domain restrictions. We explore the computational complexity of conformant manipulative actions and we …"
    },
    {
        "title": "The Complexity of -Arrowing",
        "id": "Z9W_SPAAAAAJ:kuK5TVdYjLIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:kuK5TVdYjLIC",
        "authors": [
            "Zohair Raza Hassan",
            "Edith Hemaspaandra",
            "Stanisław Radziszowski"
        ],
        "pub_source": "arXiv preprint arXiv:2307.10510",
        "pub_date": "2023/7/20",
        "description": "For fixed nonnegative integers  and , the -Arrowing problem asks whether a given graph, , has a red/blue coloring of  such that there are no red copies of  and no blue copies of . The problem is trivial when , but has been shown to be coNP-complete when . In this work, we show that the problem remains coNP-complete for all pairs of  and , except , and when . Our result is only the second hardness result for -Arrowing for an infinite family of graphs and the first for 1-connected graphs. Previous hardness results for -Arrowing depended on constructing graphs that avoided the creation of too many copies of  and , allowing easier analysis of the reduction. This is clearly unavoidable with paths and thus requires a more careful approach. We define and prove the existence of special graphs that we refer to as ``transmitters.'' Using transmitters, we construct gadgets for three distinct cases: 1)  and , 2) , and 3) . For -Arrowing we show a polynomial-time algorithm by reducing the problem to 2SAT, thus successfully categorizing the complexity of all -Arrowing problems."
    },
    {
        "title": "Using weighted matching to solve 2-approval/veto control and bribery",
        "id": "Z9W_SPAAAAAJ:TIZ-Mc8IlK0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:TIZ-Mc8IlK0C",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "arXiv preprint arXiv:2305.16889",
        "pub_date": "2023/5/26",
        "description": "Determining the complexity of election attack problems is a major research direction in the computational study of voting problems. The paper \"Towards completing the puzzle: complexity of control by replacing, adding, and deleting candidates or voters\" by Erd\\'elyi et al. (JAAMAS 2021) provides a comprehensive study of the complexity of control problems. The sole open problem is constructive control by replacing voters for 2-Approval. We show that this case is in P, strengthening the recent RP (randomized polynomial-time) upper bound due to Fitzsimmons and Hemaspaandra (IJCAI 2022). We show this by transforming 2-Approval CCRV to weighted matching. We also use this approach to show that priced bribery for 2-Veto elections is in P. With this result, and the accompanying (unsurprising) result that priced bribery for 3-Veto elections is NP-complete, this settles the complexity for -Approval and -Veto standard control and bribery cases.",
        "citations": 1
    },
    {
        "title": "Formal Methods for NFA Equivalence: QBFs, Witness Extraction, and Encoding Verification",
        "id": "Z9W_SPAAAAAJ:ILKRHgRFtOwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ILKRHgRFtOwC",
        "authors": [
            "Edith Hemaspaandra",
            "David E Narváez"
        ],
        "pub_source": "International Conference on Intelligent Computer Mathematics",
        "pub_date": "2022/9/17",
        "description": "Nondeterministic finite automata (NFAs) are an important model of computation. The equivalence problem for NFAs is known to be PSPACE-complete, and several specialized algorithms have been developed to solve this problem. In this paper, we approach the equivalence problem for NFAs by means of another PSPACE-complete problem: quantified satisfiability (QSAT). QSAT asks whether a quantified Boolean formula (QBF) is true. We encode the NFA equivalence problem as a QBF which is true if and only if the input NFAs are not equivalent. In addition to determining the equivalence of NFAs, we are also able to decode strings that witness the inequivalence of two NFAs by looking into the solving certificate. This is a novel application of certified QSAT solving. Lastly, we formally verify key aspects of the encoding in the Isabelle/HOL theorem prover."
    },
    {
        "title": "The complexity of online bribery in sequential elections",
        "id": "Z9W_SPAAAAAJ:XD-gHx7UXLsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:XD-gHx7UXLsC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Journal of Computer and System Sciences",
        "pub_date": "2022/8/1",
        "description": "Prior work on the complexity of bribery assumes that the bribery happens simultaneously, and that the briber has full knowledge of all votes. However, in many real-world settings votes come in sequentially, and the briber may have a use-it-or-lose-it moment to decide whether to alter a given vote, and when making that decision the briber may not know what votes remaining voters will cast. We introduce a model for, and initiate the study of, bribery in such an online, sequential setting. We show that even for election systems whose winner-determination problem is polynomial-time computable, an online, sequential setting may vastly increase the complexity of bribery, jumping the problem up to completeness for high levels of the polynomial hierarchy or even PSPACE. But we also show that for some natural, important election systems, such a dramatic complexity increase does not occur, and we pinpoint the …",
        "citations": 4
    },
    {
        "title": "Insight into voting problem complexity using randomized classes",
        "id": "Z9W_SPAAAAAJ:4MWp96NkSFoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:4MWp96NkSFoC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "arXiv preprint arXiv:2204.12856",
        "pub_date": "2022/4/27",
        "description": "The first step in classifying the complexity of an NP problem is typically showing the problem in P or NP-complete. This has been a successful first step for many problems, including voting problems. However, in this paper we show that this may not always be the best first step. We consider the problem of constructive control by replacing voters (CCRV) introduced by Loreggia et al. (2015) for the scoring rule First-Last, which is defined by . We show that this problem is equivalent to Exact Perfect Bipartite Matching, and so CCRV for First-Last can be determined in random polynomial time. So on the one hand, if CCRV for First-Last is NP-complete then RP = NP, which is extremely unlikely. On the other hand, showing that CCRV for First-Last is in P would also show that Exact Perfect Bipartite Matching is in P, which would solve a well-studied 40-year-old open problem. By considering RP as an option we also gain insight into the complexity of CCRV for 2-Approval, ultimately showing it in P, which settles the complexity of the sole open problem in the comprehensive table from Erd\\'{e}lyi et al. (2021).",
        "citations": 5
    },
    {
        "title": "Feedback Tools and Motivation to Persist in Intro CS Theory",
        "id": "Z9W_SPAAAAAJ:g3aElNc5_aQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:g3aElNc5_aQC",
        "authors": [
            "Ivona Bezáková",
            "Kimberly Fluet",
            "Edith Hemaspaandra",
            "Hannah Miller",
            "David E Narváez"
        ],
        "pub_source": "Proceedings of the 54th ACM Technical Symposium on Computer Science Education V. 2",
        "pub_date": "2022/3/1",
        "description": "Introductory assignments in CS Theory ask students to construct instances of various computational models (such as finite automata, regular expressions, context-free grammars, or push-down automata) for a given language. Verifying the correctness of their model instance is challenging for beginner CS Theory students since the concepts are abstract and there are infinitely many possible inputs. The popular JFLAP software allows students to visualize the running of their instance on a specific input. We recently developed a server extension to JFLAP which checks whether a student's instance is equivalent to the instructor's solution and, if not, it returns a \"witness string,'' an input string on which the student's construction and the correct solution differ. We report on comparing student performance and perceptions in three course sections of CS Theory that differed in the tools the students used for model-construction …"
    },
    {
        "title": "Effective Succinct Feedback for Intro CS Theory: A JFLAP Extension",
        "id": "Z9W_SPAAAAAJ:ML0RJ9NH7IQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ML0RJ9NH7IQC",
        "authors": [
            "Ivona Bezáková",
            "Kimberly Fluet",
            "Edith Hemaspaandra",
            "Hannah Miller",
            "David E Narváez"
        ],
        "pub_source": "Proceedings of the 53rd ACM Technical Symposium on Computer Science Education-Volume 1",
        "pub_date": "2022/2/22",
        "description": "Computing theory is often perceived as challenging by students, and verifying the correctness of a student's automaton or grammar is time-consuming for instructors. Aiming to provide benefits to both students and instructors, we designed an automated feedback tool for assignments where students construct automata or grammars. Our tool, built as an extension to the widely popular JFLAP software, determines if a submission is correct, and for incorrect submissions it provides a \"witness\" string demonstrating the incorrectness. We studied the usage and benefits of our tool in two terms, Fall 2019 and Spring 2021. Each term, students in one section of the Introduction to Computer Science Theory course were required to use our tool for sample homework questions targeting DFAs, NFAs, RegExs, CFGs, and PDAs. In Fall 2019, this was a regular section of the course. We also collected comparison data from another …",
        "citations": 2
    },
    {
        "title": "Complexity of stability",
        "id": "Z9W_SPAAAAAJ:9Nmd_mFXekcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:9Nmd_mFXekcC",
        "authors": [
            "Fabian Frei",
            "Edith Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Journal of Computer and System Sciences",
        "pub_date": "2022/2/1",
        "description": "Graph parameters such as the clique number and the chromatic number are central in many areas, ranging from computer networks to linguistics to computational neuroscience to social networks. In particular, the chromatic number of a graph can be applied in solving practical tasks as diverse as pattern matching, scheduling jobs to machines, allocating registers in compiler optimization, and even solving Sudoku puzzles. Typically, however, the underlying graphs are subject to (often minor) changes. To make these applications of graph parameters robust, it is important to know which graphs are stable in the sense that adding or deleting single edges or vertices does not change them. We initiate the study of stability of graphs in terms of their computational complexity. We show for various central graph parameters that deciding the stability of a given graph is complete for Θ 2 p, a well-known complexity class in the …",
        "citations": 10
    },
    {
        "title": "Kemeny consensus complexity",
        "id": "Z9W_SPAAAAAJ:AvfA0Oy_GE0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:AvfA0Oy_GE0C",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "arXiv preprint arXiv:2105.08540",
        "pub_date": "2021/5/18",
        "description": "The computational study of election problems generally focuses on questions related to the winner or set of winners of an election. But social preference functions such as Kemeny rule output a full ranking of the candidates (a consensus). We study the complexity of consensus-related questions, with a particular focus on Kemeny and its qualitative version Slater. The simplest of these questions is the problem of determining whether a ranking is a consensus, and we show that this problem is coNP-complete. We also study the natural question of the complexity of manipulative actions that have a specific consensus as a goal. Though determining whether a ranking is a Kemeny consensus is hard, the optimal action for manipulators is to simply vote their desired consensus. We provide evidence that this simplicity is caused by the combination of election system (Kemeny), manipulative action (manipulation), and manipulative goal (consensus). In the process we provide the first completeness results at the second level of the polynomial hierarchy for electoral manipulation and for optimal solution recognition.",
        "citations": 3
    },
    {
        "title": "Witness feedback for introductory CS theory assignments",
        "id": "Z9W_SPAAAAAJ:URolC5Kub84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:URolC5Kub84C",
        "authors": [
            "Ivona Bezáková",
            "Kimberly Fluet",
            "Edith Hemaspaandra",
            "Hannah Miller",
            "David E Narváez"
        ],
        "pub_source": "Proceedings of the 52nd ACM Technical Symposium on Computer Science Education",
        "pub_date": "2021/3/3",
        "description": "Computing theory analyzes abstract computational models to rigorously study the computational difficulty of various problems. Introductory computing theory can be challenging for undergraduate students, and the overarching goal of our research is to help students learn these computational models. The most common pedagogical tool for interacting with these models is the Java Formal Languages and Automata Package (JFLAP). We developed a JFLAP server extension, which accepts homework submissions from students, evaluates the submission as correct or incorrect, and provides a witness string when the submission is incorrect. Our extension currently provides witness feedback for deterministic finite automata, nondeterministic finite automata, regular expressions, context-free grammars, and pushdown automata. In Fall 2019, we ran a preliminary investigation on two synchronized sections (Control and …",
        "citations": 1
    },
    {
        "title": "Effective feedback for introductory cs theory: A jflap extension and student persistence",
        "id": "Z9W_SPAAAAAJ:vDijr-p_gm4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:vDijr-p_gm4C",
        "authors": [
            "Ivona Bezáková",
            "Kimberly Fluet",
            "Edith Hemaspaandra",
            "Hannah Miller",
            "David E Narváez"
        ],
        "pub_source": "arXiv preprint arXiv:2012.01546",
        "pub_date": "2020/12/2",
        "description": "Computing theory analyzes abstract computational models to rigorously study the computational difficulty of various problems. Introductory computing theory can be challenging for undergraduate students, and the main goal of our research is to help students learn these computational models. The most common pedagogical tool for interacting with these models is the Java Formal Languages and Automata Package (JFLAP). We developed a JFLAP server extension, which accepts homework submissions from students, evaluates the submission as correct or incorrect, and provides a witness string when the submission is incorrect. Our extension currently provides witness feedback for deterministic finite automata, nondeterministic finite automata, regular expressions, context-free grammars, and pushdown automata. In Fall 2019, we ran a preliminary investigation on two sections (Control and Study) of the required undergraduate course Introduction to Computer Science Theory. The Study section used our extension for five targeted homework questions, and the Control section solved and submitted these problems using traditional means. Our results show that on these five questions, the Study section performed better on average than the Control section. Moreover, the Study section persisted in submitting attempts until correct, and from this finding, our preliminary conclusion is that minimal (not detailed or grade-based) witness feedback helps students to truly learn the concepts. We describe the results that support this conclusion as well as a related hypothesis conjecturing that with witness feedback and unlimited number of submissions, partial …",
        "citations": 1
    },
    {
        "title": "The Robustness of LWPP and WPP, with an Application to Graph Reconstruction",
        "id": "Z9W_SPAAAAAJ:hkOj_22Ku90C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:hkOj_22Ku90C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Holger Spakowski",
            "Osamu Watanabe"
        ],
        "pub_source": "computational complexity",
        "pub_date": "2020/12",
        "description": "We show that the counting class LWPP remains unchanged even if one allows a polynomial number of gap values rather than one. On the other hand, we show that it is impossible to improve this from polynomially many gap values to a superpolynomial number of gap values by relativizable proof techniques. The first of these results implies that the Legitimate Deck Problem (from the study of graph reconstruction) is in LWPP (and thus low for PP, i.e., $$\\rm PP^{Legitimate Deck} = PP$$                                                               PP                                                Legitimate                         Deck                                                                 =                     PP                                    ) if the weakened version of the Reconstruction Conjecture holds in which the number of nonisomorphic preimages is assumed merely to be polynomially bounded. This strengthens the 1992 result of Köbler, Schöning & Torán that the Legitimate Deck …",
        "citations": 1
    },
    {
        "title": "Control in the presence of manipulators: cooperative and competitive cases",
        "id": "Z9W_SPAAAAAJ:EkHepimYqZsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:EkHepimYqZsC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Autonomous Agents and Multi-Agent Systems",
        "pub_date": "2020/10",
        "description": "Control and manipulation are two of the most studied types of attacks on elections. In this paper, we study the complexity of control attacks on elections in which there are manipulators. We study both the case where the “chair” who is seeking to control the election is allied with the manipulators, and the case where the manipulators seek to thwart the chair. In the latter case, we see that the order of play substantially influences the complexity. We prove upper bounds, holding over every election system with a polynomial-time winner problem, for all standard control cases, and some of these bounds are at the second or third level of the polynomial hierarchy, and we provide matching lower bounds to prove these tight. Nonetheless, for important natural systems the complexity can be much lower. We prove that for approval and plurality elections, the complexity of even competitive clashes between a controller and …",
        "citations": 1
    },
    {
        "title": "Prototype of an automated feedback tool for intro CS theory",
        "id": "Z9W_SPAAAAAJ:0KyAp5RtaNEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:0KyAp5RtaNEC",
        "authors": [
            "Ivona Bezáková",
            "Edith Hemaspaandra",
            "Aryeh Lieberman",
            "Hannah Miller",
            "David E Narváez"
        ],
        "pub_source": "Proceedings of the 51st ACM Technical symposium on computer science education",
        "pub_date": "2020/2/26",
        "description": "Computing theory is an important part of computer science education, introducing students to computational models of increasing power to study possibilities and limitations of computation. The subject is, however, very abstract and mathematical, and students often struggle with it. Students must master various computational models, but there is often a lengthy delay from the time a model is introduced until a student gets feedback on their related assignment. During this time, the course has typically moved far ahead, and students become progressively more lost. To alleviate this problem, we developed a prototype of an automated feedback tool for CS theory, which extends the widely used JFLAP software. Our tool currently handles student submissions of deterministic and non-deterministic finite automata, regular expressions, context-free grammars, and push-down automata homework, where an instructor …",
        "citations": 3
    },
    {
        "title": "Search versus decision for election manipulation problems",
        "id": "Z9W_SPAAAAAJ:yB1At4FlUx8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:yB1At4FlUx8C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Curtis Menton"
        ],
        "pub_source": "ACM Transactions on Computation Theory (TOCT)",
        "pub_date": "2020/2/11",
        "description": "Most theoretical definitions about the complexity of manipulating elections focus on the decision problem of recognizing which instances can be successfully manipulated rather than the search problem of finding the successful manipulative actions. Since the latter is a far more natural goal for manipulators, that definitional focus may be misguided if these two complexities can differ. Our main result is that they probably do differ: If P ≠ NP ∩ coNP (which itself is well known to hold if integer factoring is hard), then for election manipulation, election bribery, and some types of election control, there are election systems for which the problem of recognizing which instances can be successfully manipulated is polynomial-time solvable, yet the task of producing the successful manipulations cannot be done in polynomial time.",
        "citations": 15
    },
    {
        "title": "31st International Symposium on Algorithms and Computation (ISAAC 2020)",
        "id": "Z9W_SPAAAAAJ:Z5m8FVwuT1cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:Z5m8FVwuT1cC",
        "authors": [
            "Sang-il Oum",
            "Ke Yi",
            "Louis Dublois",
            "Tesshu Hanaka",
            "Mehdi Khosravian Ghadikolaei",
            "Michael Lampis",
            "Nikolaos Melissinos",
            "Anadi Agrawal",
            "Paweł Gawrychowski",
            "Qilong Feng",
            "Zhen Zhang",
            "Ziyun Huang",
            "Jinhui Xu",
            "Jianxin Wang",
            "Yoshifumi Sakai",
            "Shunsuke Inenaga",
            "Dibyayan Chakraborty",
            "Sandip Das",
            "Florent Foucaud",
            "Harmender Gahlawat",
            "Dimitri Lajou",
            "Bodhayan Roy",
            "Guido Brückner",
            "Ignaz Rutter",
            "Joachim Gudmundsson",
            "Yuan Sha",
            "Sampson Wong",
            "Haozhou Pang",
            "Mohammad R Salavatipour",
            "Dylan Hyatt-Denesik",
            "Mirmahdi Rahgoshay",
            "Leo Alcock",
            "Sualeh Asif",
            "Jeffrey Bosboom",
            "Josh Brunner",
            "Charlotte Chen",
            "Erik D Demaine",
            "Rogers Epstein",
            "Adam Hesterberg",
            "Lior Hirschfeld",
            "William Hu",
            "Jayson Lynch",
            "Sarah Scheffler",
            "Lillian Zhang",
            "Marc van Kreveld",
            "Tillmann Miltzow",
            "Tim Ophelders",
            "Willem Sonke",
            "Jordi L Vermeulen",
            "Trung Thanh Nguyen",
            "Jörg Rothe",
            "Takao Asano",
            "Hiroyuki Umeda",
            "Wolfgang Mulzer",
            "Max Willert",
            "Dylan Hendrickson",
            "Julian Wellman",
            "Martin Koutecký",
            "Johannes Zink",
            "Fabian Frei",
            "Edith Hemaspaandra",
            "Tomohiro Koana",
            "Christian Komusiewicz",
            "Frank Sommer",
            "Kangsan Kim",
            "Yongho Shin",
            "Hyung-Chan An",
            "Walter Kern",
            "Daniël Paulusma",
            "Bartłomiej Dudek",
            "Sanjana Dey",
            "Subhas C Nandy",
            "Arunabha Sen",
            "Meng He",
            "J Ian Munro",
            "Yakov Nekrich",
            "Sebastian Wild",
            "Kaiyu Wu",
            "Fedor V Fomin",
            "Petr A Golovach",
            "Lars Jaffke",
            "Geevarghese Philip",
            "Danil Sagunov",
            "Maciej Dulęba",
            "Wojciech Janczewski",
            "Stefan Funke",
            "Felix Weitbrecht",
            "Kentaro Sumigawa",
            "Sankardeep Chakraborty",
            "Kunihiko Sadakane",
            "Srinivasa Rao Satti",
            "Arnaud Casteigts",
            "Anne-Sophie Himmel",
            "Hendrik Molter",
            "Philipp Zschoche",
            "Peter Bradshaw",
            "Tomáš Masařk"
        ],
        "pub_source": "Schloss Dagstuhl-Leibniz-Zentrum für Informatik GmbH",
        "pub_date": "2020",
        "description": "Portal - ISAAC 2020 ISAAC 2020 December 14-18, 2020, Hong Kong, China (Virtual \nConference) 31st International Symposium on Algorithms and Computation (ISAAC 2020) Yixin \nCao and Siu-Wing Cheng and Minming Li (Eds.) ISBN 978-3-95977-173-3, LIPICS Vol. 181 \nISSN 1868-8969 Additional Information License Conference Website Complete volume (PDF, \n36 MB) Search Publication Server Authors Agrawal, Anadi Ahn, Jungho Alcock, Leo Amir, \nAmihood An, Hyung-Chan Aronov, Boris Asano, Takao Asif, Sualeh Bartier, Valentin Bellitto, \nThomas Bentert, Matthias Bhaskar, Umang Bille, Philip Boneh, Itai Bosboom, Jeffrey Bousquet, \nNicolas Bradshaw, Peter Brunner, Josh Brückner, Guido Bérczi, Kristóf Cantu, Angel A. Cao, \nYixin Cardinal, Jean Casteigts, Arnaud Chakraborty, Dibyayan Chakraborty, Sankardeep Chen, \nCharlotte Chen, Hubie Chen, Ke Cheng, Siu-Wing Chia, Nai-Hui Cho, Hwan-Gue Dallard, …",
        "citations": 3
    },
    {
        "title": "Election score can be harder than winner",
        "id": "Z9W_SPAAAAAJ:tKAzc9rXhukC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:tKAzc9rXhukC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "ECAI 2020",
        "pub_date": "2020",
        "description": "Voting rules based on scores generally determine the winner by computing the score of each candidate and the winner is the candidate with the best score. It would be natural to expect that computing the winner of an election is at least as hard as computing the score of a candidate. We show that this is not always the case. In particular, we show that for Young elections for dichotomous preferences the winner problem is easy, while determining the score of a candidate is hard. This complexity behavior has not been seen before and is unusual. The easiness of the winner problem for dichotomous Young crucially uses the fact that dichotomous preferences guarantee the transitivity of the majority relation. In addition to dichotomous preferences we also look at single-peaked preferences, the most well-studied domain restriction that guarantees the transitivity of the majority relation. We show that for the three major …",
        "citations": 4
    },
    {
        "title": "Very hard electoral control problems",
        "id": "Z9W_SPAAAAAJ:-_dYPAW6P2MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:-_dYPAW6P2MC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra",
            "Alexander Hoover",
            "David E Narváez"
        ],
        "pub_source": "Proceedings of the AAAI Conference on Artificial Intelligence",
        "pub_date": "2019/7/17",
        "description": "It is important to understand how the outcome of an election can be modified by an agent with control over the structure of the election. Electoral control has been studied for many election systems, but for all these systems the winner problem is in P, and so control is in NP. There are election systems, such as Kemeny, that have many desirable properties, but whose winner problems are not in NP. Thus for such systems control is not in NP, and in fact we show that it is typically complete for∑ p 2 (ie, NP NP, the second level of the polynomial hierarchy). This is a very high level of complexity. Approaches that perform quite well for solving NP problems do not necessarily work for∑ p 2-complete problems. However, answer set programming is suited to express problems in∑ p 2, and we present an encoding for Kemeny control.",
        "citations": 5
    },
    {
        "title": "High-multiplicity election problems",
        "id": "Z9W_SPAAAAAJ:1yQoGdGgb4wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:1yQoGdGgb4wC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "Autonomous Agents and Multi-Agent Systems",
        "pub_date": "2019/7/1",
        "description": "The computational study of elections generally assumes that the preferences of the electorate come in as a list of votes. Depending on the context, it may be much more natural to represent the list succinctly, as the distinct votes of the electorate and their counts, i.e., high-multiplicity representation. We consider how this representation affects the complexity of election problems. High-multiplicity representation may be exponentially smaller than standard representation, and so many polynomial-time algorithms for election problems in standard representation become exponential-time. Surprisingly, for polynomial-time election problems, we are often able to either adapt the same approach or provide new algorithms to show that these problems remain polynomial-time in the high-multiplicity case; this is in sharp contrast to the case where each voter has a weight, where the complexity usually increases. In the …",
        "citations": 6
    },
    {
        "title": "Finding optimal solutions with neighborly help",
        "id": "Z9W_SPAAAAAJ:z_wVstp3MssC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:z_wVstp3MssC",
        "authors": [
            "Elisabet Burjons",
            "Fabian Frei",
            "Edith Hemaspaandra",
            "Dennis Komm",
            "David Wehner"
        ],
        "pub_source": "arXiv preprint arXiv:1906.10078",
        "pub_date": "2019/6/24",
        "description": "Can we efficiently compute optimal solutions to instances of a hard problem from optimal solutions to neighboring (i.e., locally modified) instances? For example, can we efficiently compute an optimal coloring for a graph from optimal colorings for all one-edge-deleted subgraphs? Studying such questions not only gives detailed insight into the structure of the problem itself, but also into the complexity of related problems; most notably graph theory's core notion of critical graphs (e.g., graphs whose chromatic number decreases under deletion of an arbitrary edge) and the complexity-theoretic notion of minimality problems (also called criticality problems, e.g., recognizing graphs that become 3-colorable when an arbitrary edge is deleted). We focus on two prototypical graph problems, Colorability and Vertex Cover. For example, we show that it is NP-hard to compute an optimal coloring for a graph from optimal colorings for all its one-vertex-deleted subgraphs, and that this remains true even when optimal solutions for all one-edge-deleted subgraphs are given. In contrast, computing an optimal coloring from all (or even just two) one-edge-added supergraphs is in P. We observe that Vertex Cover exhibits a remarkably different behavior, demonstrating the power of our model to delineate problems from each other more precisely on a structural level. Moreover, we provide a number of new complexity results for minimality and criticality problems. For example, we prove that Minimal-3-UnColorability is complete for DP (differences of NP sets), which was previously known only for the more amenable case of deleting vertices rather than edges. For Vertex …",
        "citations": 7
    },
    {
        "title": "Credimus",
        "id": "Z9W_SPAAAAAJ:PR6Y55bgFSsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:PR6Y55bgFSsC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "The Future of Economic Design: The Continuing Development of a Field as Envisioned by Its Researchers",
        "pub_date": "2019",
        "description": "We believe that economic design and computational complexity—while already important to each other—should become even more important to each other with each passing year. But for that to happen, experts in on the one hand such areas as social choice, economics, and political science and on the other hand computational complexity will have to better understand each other’s worldviews. This article, written by two complexity theorists who also work in computational social choice theory, focuses on one direction of that process by presenting a brief overview of how most computational complexity theorists view the world. Although our immediate motivation is to make the lens through which complexity theorists see the world be better understood by those in the social sciences, we also feel that even within computer science it is very important for nontheoreticians to understand how theoreticians think, just as it …"
    },
    {
        "title": "Department of Computer Science Rochester Institute of Technology Rochester, NY 14623, USA www. cs. rit. edu/∼ eh",
        "id": "Z9W_SPAAAAAJ:nrtMV_XWKgEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:nrtMV_XWKgEC",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "arXiv preprint arXiv:1711.00201",
        "pub_date": "2017/11",
        "description": "We believe that economic design and computational complexity—while already important to each other—should become even more important to each other with each passing year. But for that to happen, experts in on the one hand such areas as social choice, economics, and political science and on the other hand computational complexity will have to better understand each other’s worldviews. This article, written by two complexity theorists who also work in computational social choice theory, focuses on one direction of that process by presenting a brief overview of how most computational complexity theorists view the world. Although our immediate motivation is to make the lens through which complexity theorists see the world be better understood by those in the social sciences, we also feel that even within computer science it is very important for nontheoreticians to understand how theoreticians think, just as it is equally important within computer science for theoreticians to understand how nontheoreticians think."
    },
    {
        "title": "The complexity of online voter control in sequential elections",
        "id": "Z9W_SPAAAAAJ:WqliGbK-hY8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:WqliGbK-hY8C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Autonomous Agents and Multi-Agent Systems",
        "pub_date": "2017/9",
        "description": "Previous work on voter control, which refers to situations where a chair seeks to change the outcome of an election by deleting, adding, or partitioning voters, takes for granted that the chair knows all the voters’ preferences and that all votes are cast simultaneously. However, elections are often held sequentially and the chair thus knows only the previously cast votes and not the future ones, yet needs to decide instantaneously which control action to take. We introduce a framework that models online voter control in sequential elections. We show that the related problems can be much harder than in the standard (non-online) case: For certain election systems, even with efficient winner problems, online control by deleting, adding, or partitioning voters is -complete, even if there are only two candidates. In addition, we obtain (by a new characterization of coNP in terms of weight-bounded alternating Turing machines …",
        "citations": 17
    },
    {
        "title": "The complexity of controlling candidate-sequential elections",
        "id": "Z9W_SPAAAAAJ:a0OBvERweLwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:a0OBvERweLwC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Theoretical Computer Science",
        "pub_date": "2017/5/23",
        "description": "Candidate control of elections is the study of how adding or removing candidates can affect the outcome. However, the traditional study of the complexity of candidate control is in the model in which all candidates and votes are known up front. This paper develops a model for studying online control for elections where the structure is sequential with respect to the candidates, and in which the decision regarding adding and deleting must be irrevocably made at the moment the candidate is presented. We show that great complexity—PSPACE-completeness—can occur in this setting, but we also provide within this setting polynomial-time algorithms for the most important of election systems, plurality.",
        "citations": 33
    },
    {
        "title": "The complexity of succinct elections",
        "id": "Z9W_SPAAAAAJ:Y5dfb0dijaUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:Y5dfb0dijaUC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "Proceedings of the AAAI Conference on Artificial Intelligence",
        "pub_date": "2017/2/12",
        "description": "The computational study of elections generally assumes that the preferences of the electorate come in as a list of votes. Depending on the context, it may be much more natural to represent the preferences of the electorate succinctly, as the distinct votes and their counts. Though the succinct representation may be exponentially smaller than the nonsuccinct, we find only one natural case where the complexity increases, in sharp contrast to the case where each voter has a weight, where the complexity usually increases.",
        "citations": 4
    },
    {
        "title": "Dichotomy for pure scoring rules under manipulative electoral actions",
        "id": "Z9W_SPAAAAAJ:ZuybSZzF8UAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ZuybSZzF8UAC",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "Proceedings of the Twenty-second European Conference on Artificial Intelligence",
        "pub_date": "2016/8/29",
        "description": "Scoring systems are an extremely important class of election systems. We study the complexity of manipulation, constructive control by deleting voters (CCDV), and bribery for scoring systems. For manipulation, we show that for all scoring rules with a constant number of different coefficients, manipulation is in P. And we conjecture that there is no dichotomy theorem. On the other hand, we obtain dichotomy theorems for CCDV and bribery. More precisely, we show that both of these problems are easy for 1-approval, 2-approval, 1-veto, 2-veto, 3-veto, generalized 2-veto, and (2, 1, ..., 1, 0), and hard in all other cases. These results are the \"dual\" of the dichotomy theorem for the constructive control by adding voters (CCAV) problem from [14], but do not at all follow from that result. In particular, proving hardness for CCDV is harder than for CCAV since we do not have control over what the controller can delete, and …",
        "citations": 19
    },
    {
        "title": "Modeling Single-Peakedness for Votes with Ties",
        "id": "Z9W_SPAAAAAJ:HE397vMXCloC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:HE397vMXCloC",
        "authors": [
            "Zack FITZSIMMONSa Edith HEMASPAANDRA"
        ],
        "pub_source": "STAIRS 2016: Proceedings of the Eighth European Starting AI Researcher Symposium",
        "pub_date": "2016/8/23",
        "description": "Single-peakedness is one of the most important and well-known domain restrictions on preferences. The computational study of single-peaked electorates has largely been restricted to elections with tie-free votes, and recent work that studies the computational complexity of manipulative attacks for single-peaked elections for votes with ties has been restricted to nonstandard models of single-peaked preferences for top orders. We study the computational complexity of manipulation for votes with ties for the standard model of single-peaked preferences and for single-plateaued preferences. We show that these models avoid the anomalous complexity behavior exhibited by the other models. We also state a surprising result on the relation between the societal axis and the complexity of manipulation for single-peaked preferences."
    },
    {
        "title": "Manipulation complexity of same-system runoff elections",
        "id": "Z9W_SPAAAAAJ:J-pR_7NvFogC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:J-pR_7NvFogC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Annals of Mathematics and Artificial Intelligence",
        "pub_date": "2016/8",
        "description": "Do runoff elections, using the same voting rule as the initial election but just on the winning candidates, increase or decrease the complexity of manipulation? Does allowing revoting in the runoff increase or decrease the complexity relative to just having a runoff without revoting? For both weighted and unweighted voting, we show that even for election systems with simple winner problems the complexity of manipulation, manipulation with runoffs, and manipulation with revoting runoffs are independent. On the other hand, for some important, well-known election systems we determine what holds for each of these cases. For no such systems do we find runoffs lowering complexity, and for some we find that runoffs raise complexity. Ours is the first paper to show that for natural, unweighted election systems, runoffs can increase the manipulation complexity.",
        "citations": 4
    },
    {
        "title": "Modeling single-peakedness for votes with ties",
        "id": "Z9W_SPAAAAAJ:uJ-U7cs_P_0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:uJ-U7cs_P_0C",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "arXiv preprint arXiv:1604.08191",
        "pub_date": "2016/4/27",
        "description": "Single-peakedness is one of the most important and well-known domain restrictions on preferences. The computational study of single-peaked electorates has largely been restricted to elections with tie-free votes, and recent work that studies the computational complexity of manipulative attacks for single-peaked elections for votes with ties has been restricted to nonstandard models of single-peaked preferences for top orders. We study the computational complexity of manipulation for votes with ties for the standard model of single-peaked preferences and for single-plateaued preferences. We show that these models avoid the anomalous complexity behavior exhibited by the other models. We also state a surprising result on the relation between the societal axis and the complexity of manipulation for single-peaked preferences.",
        "citations": 9
    },
    {
        "title": "Complexity dichotomies for unweighted scoring rules",
        "id": "Z9W_SPAAAAAJ:olpn-zPbct0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:olpn-zPbct0C",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "arXiv preprint arXiv:1604.05264",
        "pub_date": "2016/4/18",
        "description": "Scoring systems are an extremely important class of election systems. We study the complexity of manipulation, constructive control by deleting voters (CCDV), and bribery for scoring systems. For manipulation, we show that for all scoring rules with a constant number of different coefficients, manipulation is in P. And we conjecture that there is no dichotomy theorem. On the other hand, we obtain dichotomy theorems for CCDV and bribery problem. More precisely, we show that both of these problems are easy for 1-approval, 2-approval, 1-veto, 2-veto, 3-veto, generalized 2-veto, and (2,1,...,1,0), and hard in all other cases. These results are the \"dual\" of the dichotomy theorem for the constructive control by adding voters (CCAV) problem from (Hemaspaandra, Hemaspaandra, Schnoor, AAAI 2014), but do not at all follow from that result. In particular, proving hardness for CCDV is harder than for CCAV since we do not have control over what the controller can delete, and proving easiness for bribery tends to be harder than for control, since bribery can be viewed as control followed by manipulation.",
        "citations": 2
    },
    {
        "title": "Dodgson's Rule and Young's Rule.",
        "id": "Z9W_SPAAAAAJ:zLWjf1WUPmwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:zLWjf1WUPmwC",
        "authors": [
            "Ioannis Caragiannis",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Handbook of computational social choice",
        "pub_date": "2016",
        "description": "Dodgson’s and Young’s election systems, dating from 1876 and 1977, are beautiful, historically resonant election systems. Surprisingly, both of these systems turn out to have highly intractable winner-determination problems: The winner problems of these systems are complete for parallel access to NP. This chapter discusses both the complexity of these winner-determination problems and approaches—through heuristic algorithms, fixed-parameter algorithms, and approximation algorithms—to circumventing that complexity.",
        "citations": 26
    },
    {
        "title": "The complexity of manipulative actions in single-peaked societies",
        "id": "Z9W_SPAAAAAJ:1qzjygNMrQYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:1qzjygNMrQYC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Economics and computation: An introduction to algorithmic game theory, computational social choice, and fair division",
        "pub_date": "2016",
        "description": "Anna and Belle, who now have become so aware of their role as guides in this book that they can even refer to the book’s content, meet on what will be a very exciting day for them. Let’s listen in on their conversation.",
        "citations": 11
    },
    {
        "title": "Bypassing combinatorial protections: Polynomial-time algorithms for single-peaked electorates",
        "id": "Z9W_SPAAAAAJ:V3AGJWp-ZtQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:V3AGJWp-ZtQC",
        "authors": [
            "Felix Brandt",
            "Markus Brill",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Journal of Artificial Intelligence Research",
        "pub_date": "2015/7/22",
        "description": "For many election systems, bribery (and related) attacks have been shown NP-hard using constructions on combinatorially rich structures such as partitions and covers. This paper shows that for voters who follow the most central political-science model of electorates-- single-peaked preferences--those hardness protections vanish. By using single-peaked preferences to simplify combinatorial covering challenges, we for the first time show that NP-hard bribery problems--including those for Kemeny and Llull elections--fall to polynomial time for single-peaked electorates. By using single-peaked preferences to simplify combinatorial partition challenges, we for the first time show that NP-hard partition-of-voters problems fall to polynomial time for single-peaked electorates. We show that for single-peaked electorates, the winner problems for Dodgson and Kemeny elections, though Θ2p-complete in the general case, fall to polynomial time. And we completely classify the complexity of weighted coalition manipulation for scoring protocols in single-peaked electorates.",
        "citations": 90
    },
    {
        "title": "Weighted electoral control",
        "id": "Z9W_SPAAAAAJ:p2g8aNsByqUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:p2g8aNsByqUC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Journal of Artificial Intelligence Research",
        "pub_date": "2015/4/20",
        "description": "Although manipulation and bribery have been extensively studied under weighted voting, there has been almost no work done on election control under weighted voting. This is unfortunate, since weighted voting appears in many important natural settings. In this paper, we study the complexity of controlling the outcome of weighted elections through adding and deleting voters. We obtain polynomial-time algorithms, NP-completeness results, and for many NP-complete cases, approximation algorithms. In particular, for scoring rules we completely characterize the complexity of weighted voter control. Our work shows that for quite a few important cases, either polynomial-time exact algorithms or polynomial-time approximation algorithms exist.",
        "citations": 58
    },
    {
        "title": "Complexity of manipulative actions when voting with ties",
        "id": "Z9W_SPAAAAAJ:BrmTIyaxlBUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:BrmTIyaxlBUC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra"
        ],
        "pub_source": "Algorithmic Decision Theory: 4th International Conference, ADT 2015, Lexington, KY, USA, September 27–30, 2015, Proceedings 4",
        "pub_date": "2015",
        "description": "Most of the computational study of election problems has assumed that each voter’s preferences are, or should be extended to, a total order. However in practice voters may have preferences with ties. We study the complexity of manipulative actions on elections where voters can have ties, extending the definitions of the election systems (when necessary) to handle voters with ties. We show that for natural election systems allowing ties can both increase and decrease the complexity of manipulation and bribery, and we state a general result on the effect of voters with ties on the complexity of control.",
        "citations": 14
    },
    {
        "title": "More natural models of electoral control by partition",
        "id": "Z9W_SPAAAAAJ:5Ul4iDaHHb8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:5Ul4iDaHHb8C",
        "authors": [
            "Gábor Erdélyi",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Algorithmic Decision Theory: 4th International Conference, ADT 2015, Lexington, KY, USA, September 27–30, 2015, Proceedings 4",
        "pub_date": "2015",
        "description": "“Control” studies attempts to set the outcome of elections through the addition, deletion, or partition of voters or candidates. The set of benchmark control types was largely set in the 1992 paper by Bartholdi, Tovey, and Trick that introduced control, and there now is a large literature studying how many of the benchmark types various election systems are vulnerable to, i.e., have polynomial-time attack algorithms for. However, although the longstanding benchmark models of addition and deletion model relatively well the real-world settings that inspire them, the longstanding benchmark models of partition model settings that are arguably quite distant from those they seek to capture. In this paper, we introduce—and for some important cases analyze the complexity of—new partition models that seek to better capture many real-world partition settings. In particular, in many partition settings one …",
        "citations": 44
    },
    {
        "title": "A control dichotomy for pure scoring rules",
        "id": "Z9W_SPAAAAAJ:B3FOqHPlNUQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:B3FOqHPlNUQC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "Proceedings of the AAAI Conference on Artificial Intelligence",
        "pub_date": "2014/6/21",
        "description": "Scoring systems are an extremely important class of election systems. A length-m (so-called) scoring vector applies only to m-candidate elections. To handle general elections, one must use a family of vectors, one per length. The most elegant approach to making sure such families are\" family-like''is the recently introduced notion of (polynomial-time uniform) pure scoring rules, where each scoring vector is obtained from its precursor by adding one new coefficient. We obtain the first dichotomy theorem for pure scoring rules for a control problem. In particular, for constructive control by adding voters (CCAV), we show that CCAV is solvable in polynomial time for k-approval with k<= 3, k-veto with k<= 2, every pure scoring rule in which only the two top-rated candidates gain nonzero scores, and a particular rule that is a\" hybrid\" of 1-approval and 1-veto. For all other pure scoring rules, CCAV is NP-complete. We also investigate the descriptive richness of different models for defining pure scoring rules, proving how more rule-generation time gives more rules, proving that rationals give more rules than do the natural numbers, and proving that some restrictions previously thought to be\" wlog\" in fact do lose generality.",
        "citations": 32
    },
    {
        "title": "Single-peaked consistency for weak orders is easy",
        "id": "Z9W_SPAAAAAJ:LPZeul_q3PIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:LPZeul_q3PIC",
        "authors": [
            "Zack Fitzsimmons"
        ],
        "pub_source": "arXiv preprint arXiv:1406.4829",
        "pub_date": "2014/6/18",
        "description": "In economics and social choice single-peakedness is one of the most important and commonly studied models for preferences. It is well known that single-peaked consistency for total orders is in P. However in practice a preference profile is not always comprised of total orders. Often voters have indifference between some of the candidates. In a weak preference order indifference must be transitive. We show that single-peaked consistency for weak orders is in P for three different variants of single-peakedness for weak orders. Specifically, we consider Black's original definition of single-peakedness for weak orders, Black's definition of single-plateaued preferences, and the existential model recently introduced by Lackner. We accomplish our results by transforming each of these single-peaked consistency problems to the problem of determining if a 0-1 matrix has the consecutive ones property.",
        "citations": 17
    },
    {
        "title": "The complexity of online manipulation of sequential elections",
        "id": "Z9W_SPAAAAAJ:yD5IFk8b50cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:yD5IFk8b50cC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Journal of Computer and System Sciences",
        "pub_date": "2014/6/1",
        "description": "Most work on manipulation assumes that all preferences are known to the manipulators. However, in many settings elections are open and sequential. We introduce a framework, in which manipulators can see the past votes but not the future ones, to model online coalitional manipulation of sequential elections, and we show that here manipulation can be extremely complex even for election systems with simple winner problems. We also show that for some of the most important election systems such manipulation is simple in certain settings. Among our highlights are: Depending on the size of the manipulative coalition, the online manipulation problem can be complete for each level of the polynomial hierarchy or even for PSPACE. We obtain the most dramatic contrast to date between the nonunique-winner and unique-winner models: Online weighted manipulation for plurality is in P in the nonunique-winner …",
        "citations": 36
    },
    {
        "title": "Bribery and voter control under voting-rule uncertainty",
        "id": "Z9W_SPAAAAAJ:sSrBHYA8nusC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:sSrBHYA8nusC",
        "authors": [
            "Gabor Erdelyi",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems",
        "pub_date": "2014/5/5",
        "description": "We study manipulative actions, especially bribery and control, under “voting-rule uncertainty,” which means that there are two or more rules that may be used to determine the election’s outcome. Among our highlights are that we show a new case in which “ties matter,” we link manipulation and bribery in a way that shows many cases of single-bribery to be in polynomial time, we explore the relations between the bribery and control complexities of the underlying systems and their “uncertain” combination, and we obtain many results about the complexity of natural voting rules under votingrule uncertainty, most notably regarding control by adding voters under election families of the form {k1-Approval,..., kℓ-Approval, ˆk1-Veto,..., ˆkℓ-Veto}.",
        "citations": 16
    },
    {
        "title": "Control in the presence of manipulators: Cooperative and competitive cases",
        "id": "Z9W_SPAAAAAJ:tOudhMTPpwUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:tOudhMTPpwUC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "arXiv preprint arXiv:1308.0544",
        "pub_date": "2013/8/2",
        "description": "Control and manipulation are two of the most studied types of attacks on elections. In this paper, we study the complexity of control attacks on elections in which there are manipulators. We study both the case where the \"chair\" who is seeking to control the election is allied with the manipulators, and the case where the manipulators seek to thwart the chair. In the latter case, we see that the order of play substantially influences the complexity. We prove upper bounds, holding over every election system with a polynomial-time winner problem, for all standard control cases, and some of these bounds are at the second or third level of the polynomial hierarchy, and we provide matching lower bounds to prove these tight. Nonetheless, for important natural systems the complexity can be much lower. We prove that for approval and plurality elections, the complexity of even competitive clashes between a controller and manipulators falls far below those high bounds, even as low as polynomial time. Yet for a Borda-voting case we show that such clashes raise the complexity unless NP = coNP.",
        "citations": 15
    },
    {
        "title": "X THEN X: Manipulation of same-system runoff elections",
        "id": "Z9W_SPAAAAAJ:P5F9QuxV20EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:P5F9QuxV20EC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "arXiv preprint arXiv:1301.6118",
        "pub_date": "2013/1/25",
        "description": "Do runoff elections, using the same voting rule as the initial election but just on the winning candidates, increase or decrease the complexity of manipulation? Does allowing revoting in the runoff increase or decrease the complexity relative to just having a runoff without revoting? For both weighted and unweighted voting, we show that even for election systems with simple winner problems the complexity of manipulation, manipulation with runoffs, and manipulation with revoting runoffs are independent, in the abstract. On the other hand, for some important, well-known election systems we determine what holds for each of these cases. For no such systems do we find runoffs lowering complexity, and for some we find that runoffs raise complexity. Ours is the first paper to show that for natural, unweighted election systems, runoffs can increase the manipulation complexity.",
        "citations": 4
    },
    {
        "title": "Weighted Manipulation for Four-Candidate Llull Is Easy.",
        "id": "Z9W_SPAAAAAJ:NhqRSupF_l8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:NhqRSupF_l8C",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "ECAI",
        "pub_date": "2012/8/15",
        "description": "Our main contribution is a surprising polynomial-time algorithm for weighed coalitional manipulation of four-candidate Copeland1 (also known as Llull) elections. On the technical side, our algorithm relies on a polynomial-time routine that solves a variant of the partition problem. We also show that there is a pseudopolynomial-time algorithm for weighted coalitional manipulation with a fixed number of candidates under any anonymous rule with a polynomial-time winner-determination procedure.",
        "citations": 10
    },
    {
        "title": "Online Voter Control in Sequential Elections.",
        "id": "Z9W_SPAAAAAJ:dfsIfKJdRG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:dfsIfKJdRG4C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "ECAI",
        "pub_date": "2012/8/15",
        "description": "Previous work on voter control, which refers to situations where a chair seeks to change the outcome of an election by deleting, adding, or partitioning voters, takes for granted that the chair knows all the voters’ preferences and that all votes are cast simultaneously. However, elections are often held sequentially and the chair thus knows only the previously cast votes and not the future ones, yet needs to decide instantaneously which control action to take. We introduce a framework that models online voter control in sequential elections. We show that the related problems can be much harder than in the standard (non-online) case: For certain election systems, even with efficient winner problems, online control by deleting, adding, or partitioning voters is PSPACE-complete, even if there are only two candidates. In addition, we obtain completeness for coNP in the deleting/adding cases with a bounded deletion/addition limit, and for NP in the partition cases with only one candidate. Finally, we show that for plurality, online control by deleting or adding voters is in P, and for partitioning voters is coNP-hard.",
        "citations": 20
    },
    {
        "title": "Search versus decision for election manipulation problems",
        "id": "Z9W_SPAAAAAJ:cFHS6HbyZ2cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:cFHS6HbyZ2cC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Curtis Menton"
        ],
        "pub_source": "arXiv preprint arXiv:1202.6641",
        "pub_date": "2012/2/29",
        "description": "Most theoretical definitions about the complexity of manipulating elections focus on the decision problem of recognizing which instances can be successfully manipulated, rather than the search problem of finding the successful manipulative actions. Since the latter is a far more natural goal for manipulators, that definitional focus may be misguided if these two complexities can differ. Our main result is that they probably do differ: If integer factoring is hard, then for election manipulation, election bribery, and some types of election control, there are election systems for which recognizing which instances can be successfully manipulated is in polynomial time but producing the successful manipulations cannot be done in polynomial time.",
        "citations": 45
    },
    {
        "title": "A universally defined undecidable unimodal logic",
        "id": "Z9W_SPAAAAAJ:GnPB-g6toBAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:GnPB-g6toBAC",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "International Symposium on Mathematical Foundations of Computer Science",
        "pub_date": "2011/8/22",
        "description": "Modal logics are widely used in computer science. The complexity of their satisfiability problems has been an active field of research since the 1970s. We prove that even very “simple” modal logics can be undecidable: We show that there is an undecidable unimodal logic that can be obtained by restricting the allowed models with an equality-free first-order formula in which only universal quantifiers appear.",
        "citations": 10
    },
    {
        "title": "The complexity of manipulative attacks in nearly single-peaked electorates",
        "id": "Z9W_SPAAAAAJ:M3NEmzRMIkIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:M3NEmzRMIkIC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Proceedings of the 13th conference on theoretical aspects of rationality and knowledge",
        "pub_date": "2011/7/12",
        "description": "Many electoral bribery, control, and manipulation problems (which we will refer to in general as \"manipulative actions\" problems) are NP-hard in the general case. It has recently been noted that many of these problems fall into polynomial time if the electorate is single-peaked (i.e., is polarized along some axis/issue). However, real-world electorates are not truly single-peaked. There are usually some mavericks, and so real-world electorates tend to merely be nearly single-peaked. This paper studies the complexity of manipulative-action algorithms for elections over nearly single-peaked electorates, for various notions of nearness and various election systems. We provide instances where even one maverick jumps the manipulative-action complexity up to NP-hardness, but we also provide many instances where a reasonable number of mavericks can be tolerated without increasing the manipulative-action complexity.",
        "citations": 120
    },
    {
        "title": "A simplest undecidable modal logic",
        "id": "Z9W_SPAAAAAJ:maZDTaKrznsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:maZDTaKrznsC",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "arXiv preprint arXiv:1105.0845",
        "pub_date": "2011/5/4",
        "description": "Modal logics are widely used in computer science. The complexity of their satisfiability problems has been an active field of research since the 1970s. We prove that even very \"simple\" modal logics can be undecidable: We show that there is an undecidable modal logic that can be obtained by restricting the allowed models with a first-order formula in which only universal quantifiers appear.",
        "citations": 1
    },
    {
        "title": "Minimization for generalized boolean formulas",
        "id": "Z9W_SPAAAAAJ:hMod-77fHWUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:hMod-77fHWUC",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "arXiv preprint arXiv:1104.2312",
        "pub_date": "2011/4/12",
        "description": "The minimization problem for propositional formulas is an important optimization problem in the second level of the polynomial hierarchy. In general, the problem is Sigma-2-complete under Turing reductions, but restricted versions are tractable. We study the complexity of minimization for formulas in two established frameworks for restricted propositional logic: The Post framework allowing arbitrarily nested formulas over a set of Boolean connectors, and the constraint setting, allowing generalizations of CNF formulas. In the Post case, we obtain a dichotomy result: Minimization is solvable in polynomial time or coNP-hard. This result also applies to Boolean circuits. For CNF formulas, we obtain new minimization algorithms for a large class of formulas, and give strong evidence that we have covered all polynomial-time cases.",
        "citations": 35
    },
    {
        "title": "Multimode control attacks on elections",
        "id": "Z9W_SPAAAAAJ:_kc_bZDykSQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:_kc_bZDykSQC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Journal of Artificial Intelligence Research",
        "pub_date": "2011/1/30",
        "description": "In 1992, Bartholdi, Tovey, and Trick opened the study of control attacks on elections---attempts to improve the election outcome by such actions as adding/deleting candidates or voters. That work has led to many results on how algorithms can be used to find attacks on elections and how complexity-theoretic hardness results can be used as shields against attacks. However, all the work in this line has assumed that the attacker employs just a single type of attack. In this paper, we model and study the case in which the attacker launches a multipronged (ie, multimode) attack. We do so to more realistically capture the richness of real-life settings. For example, an attacker might simultaneously try to suppress some voters, attract new voters into the election, and introduce a spoiler candidate. Our model provides a unified framework for such varied attacks. By constructing polynomial-time multiprong attack algorithms we prove that for various election systems even such concerted, flexible attacks can be perfectly planned in deterministic polynomial time.",
        "citations": 150
    },
    {
        "title": "The magazine archive includes every article published in Communications of the ACM for over the past 50 years.",
        "id": "Z9W_SPAAAAAJ:KUbvn5osdkgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:KUbvn5osdkgC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Communications of the ACM",
        "pub_date": "2010/11",
        "description": "For thousands of years, people and more recently, electronic agents have been conducting elections. And surely for just as long, people or more recently, electronic agents have been trying to affect the outcomes of those elections. Such attempts take many forms. often and naturally, actors may seek to change the structure of the election, for example, by attracting new voters, suppressing turnout, recruiting candidates, or setting election district boundaries. Sometimes voters may even be bribed to vote a certain way. And a voter may try to manipulate an election by casting an insincere vote that may yield a more favorable outcome than would the voter's sincere vote: Not all people who preferred Ralph Nader in the 2004 US presidential election actually voted for him.One might hope that by choosing a particularly wonderful election system, one can perfectly block such attacks. However, classic work from economics and political science proves that every reasonable election system sometimes gives voters an incentive to vote insincerely (see Duggan 17 and the references therein). Reasonable election systems cannot make manipulation impossible. However, they can make manipulation computationally infeasible."
    },
    {
        "title": "Generalized modal satisfiability",
        "id": "Z9W_SPAAAAAJ:ZeXyd9-uunAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ZeXyd9-uunAC",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor",
            "Ilka Schnoor"
        ],
        "pub_source": "Journal of Computer and System Sciences",
        "pub_date": "2010/11/1",
        "description": "It is well known that modal satisfiability is PSPACE-complete (Ladner (1977) [21]). However, the complexity may decrease if we restrict the set of propositional operators used. Note that there exist an infinite number of propositional operators, since a propositional operator is simply a Boolean function. We completely classify the complexity of modal satisfiability for every finite set of propositional operators, i.e., in contrast to previous work, we classify an infinite number of problems. We show that, depending on the set of propositional operators, modal satisfiability is PSPACE-complete, coNP-complete, or in P. We obtain this trichotomy not only for modal formulas, but also for their more succinct representation using modal circuits. We consider both the uni-modal and the multi-modal cases, and study the dual problem of validity as well.",
        "citations": 32
    },
    {
        "title": "Using complexity to protect elections",
        "id": "Z9W_SPAAAAAJ:5nxA0vEk-isC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:5nxA0vEk-isC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Communications of the ACM",
        "pub_date": "2010/11/1",
        "description": "Computational complexity may truly be the shield against election manipulation.",
        "citations": 215
    },
    {
        "title": "Bypassing combinatorial protections: Polynomial-time algorithms for single-peaked electorates",
        "id": "Z9W_SPAAAAAJ:Wp0gIr-vW9MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:Wp0gIr-vW9MC",
        "authors": [
            "Felix Brandt",
            "Markus Brill",
            "Edith Hemaspaandra",
            "Lane Hemaspaandra"
        ],
        "pub_source": "Proceedings of the AAAI Conference on Artificial Intelligence",
        "pub_date": "2010/7/4",
        "description": "For many election systems, bribery (and related) attacks have been shown NP-hard using constructions on combinatorially rich structures such as partitions and covers. It is important to learn how robust these hardness protection results are, in order to find whether they can be relied on in practice. This paper shows that for voters who follow the most central political-science model of electorates—single-peaked preferences—those protections vanish. By using single-peaked preferences to simplify combinatorial covering challenges, we show that NP-hard bribery problems—including those for Kemeny and Llull elections-—fall to polynomial time. By using single-peaked preferences to simplify combinatorial partition challenges, we show that NP-hard partition-of-voters problems fall to polynomial time. We furthermore show that for single-peaked electorates, the winner problems for Dodgson and Kemeny elections, though Θ 2 p-complete in the general case, fall to polynomial time. And we completely classify the complexity of weighted coalition manipulation for scoring protocols in single-peaked electorates.",
        "citations": 75
    },
    {
        "title": "Manipulation of copeland elections.",
        "id": "Z9W_SPAAAAAJ:4DMP91E08xMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:4DMP91E08xMC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "AAMAS",
        "pub_date": "2010/5/10",
        "description": "We resolve an open problem regarding the complexity of unweighted coalitional manipulation, namely, the complexity of Copelandα-manipulation for α∈{0, 1}. Copelandα, 0≤ α≤ 1, is an election system where for each pair of candidates we check which one is preferred by more voters (ie, we conduct a head-to-head majority contest) and we give one point to this candidate and zero to the other. However, in case of a tie both candidates receive α points. In the end, candidates with most points win. It is known [13] that Copelandα-manipulation is NP-complete for all rational α’s in (0, 1)−{0.5}(ie, for all the reasonable cases except the three truly interesting ones). In this paper we show that the problem remains NP-complete for α∈{0, 1}. In addition, we resolve the complexity of Copelandα-manipulation for each rational α∈[0, 1] for the case of irrational voters.",
        "citations": 44
    },
    {
        "title": "Computational aspects of approval voting",
        "id": "Z9W_SPAAAAAJ:qxL8FJ1GzNcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:qxL8FJ1GzNcC",
        "authors": [
            "Dorothea Baumeister",
            "Gábor Erdélyi",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Handbook on approval voting",
        "pub_date": "2010/4/24",
        "description": "“Yes, we can!” – Barack Obama’s campaign slogan inspired enough of his supporters to go to the polls and give him their “yes” votes that he won the 2008 U.S. presidential election. And this happened notwithstanding the fact that many other voters said “no” when pollsters asked if they viewed Barack Obama as qualified for the office. “Yes” and “no” are perhaps the most basic ways for us, as voters, to express our preferences about candidates, and “yes” and “no” are what approval voting is all about.",
        "citations": 76
    },
    {
        "title": "On the complexity of kings",
        "id": "Z9W_SPAAAAAJ:qUcmZB5y_30C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:qUcmZB5y_30C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Till Tantau",
            "Osamu Watanabe"
        ],
        "pub_source": "Theoretical computer science",
        "pub_date": "2010/1/28",
        "description": "A king in a directed graph is a vertex from which each vertex in the graph can be reached through paths of length at most two. There is a broad literature on tournaments (completely oriented digraphs), and it has been known for more than half a century that all tournaments have at least one king. Recently, kings have proven useful in theoretical computer science, in particular in the study of the complexity of reachability problems and semifeasible sets. In this article, we study the complexity of recognizing kings. For each succinctly specified family of tournaments, the king problem is already known to belong to Π2p. We prove that the complexity of kingship problems is a rich enough vocabulary to pinpoint every nontrivial many-one degree in Π2p. That is, we show that every set in Π2p other than 0̸ and Σ∗ is equivalent to a king problem under ≤mp-reductions. Indeed, we show that the equivalence can even be …",
        "citations": 16
    },
    {
        "title": "Review Articles Computational complexity may truly be the shield against election manipulation.",
        "id": "Z9W_SPAAAAAJ:fEOibwPWpKIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:fEOibwPWpKIC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Communications of the ACM",
        "pub_date": "2010"
    },
    {
        "title": "Hybrid Elections Broaden Complexity‐Theoretic Resistance to Control",
        "id": "Z9W_SPAAAAAJ:W7OEmFMy1HYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:W7OEmFMy1HYC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Mathematical Logic Quarterly",
        "pub_date": "2009/8",
        "description": "Electoral control refers to attempts by an election's organizer (“the chair”) to influence the outcome by adding/deleting/partitioning voters or candidates. The important paper of Bartholdi, Tovey, and Trick [1] that introduces (constructive) control proposes computational complexity as a means of resisting control attempts: Look for election systems where the chair's task in seeking control is itself computationally infeasible. We introduce and study a method of combining two or more candidate‐anonymous election schemes in such a way that the combined scheme possesses all the resistances to control (i.e., all the NP‐hardnesses of control) possessed by any of its constituents: It combines their strengths. From this and new resistance constructions, we prove for the first time that there exists a neutral, anonymous election scheme (whose winner problem is computable in polynomial time) that is resistant to all twenty …",
        "citations": 112
    },
    {
        "title": "How hard is bribery in elections?",
        "id": "Z9W_SPAAAAAJ:zYLM7Y9cAGgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:zYLM7Y9cAGgC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Journal of artificial intelligence research",
        "pub_date": "2009/7/24",
        "description": "We study the complexity of influencing elections through bribery: How computationally complex is it for an external actor to determine whether by paying certain voters to change their preferences a specified candidate can be made the elections winner? We study this problem for election systems as varied as scoring protocols and Dodgson voting, and in a variety of settings regarding homogeneous-vs.-nonhomogeneous electorate bribability, bounded-size-vs.-arbitrary-sized candidate sets, weighted-vs.-unweighted voters, and succinct-vs.-nonsuccinct input specification. We obtain both polynomial-time bribery algorithms and proofs of the intractability of bribery, and indeed our results show that the complexity of bribery is extremely sensitive to the setting. For example, we find settings in which bribery is NP-complete but manipulation (by voters) is in P, and we find settings in which bribing weighted voters is NP-complete but bribing voters with individual bribe thresholds is in P. For the broad class of elections (including plurality, Borda, k-approval, and veto) known as scoring protocols, we prove a dichotomy result for bribery of weighted voters: We find a simple-to-evaluate condition that classifies every case as either NP-complete or in P.",
        "citations": 284
    },
    {
        "title": "The shield that never was: Societies with single-peaked preferences are more open to manipulation and control",
        "id": "Z9W_SPAAAAAJ:0EnyYjriUFMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:0EnyYjriUFMC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Proceedings of the 12th Conference on Theoretical Aspects of Rationality and Knowledge",
        "pub_date": "2009/7/6",
        "description": "Much work has been devoted, during the past twenty years, to using complexity to protect elections from manipulation and control. Many results have been obtained showing NP-hardness shields, and recently there has been much focus on whether such worst-case hardness protections can be bypassed by frequently correct heuristics or by approximations. This paper takes a very different approach: We argue that when electorates follow the canonical political science model of societal preferences the complexity shield never existed in the first place. In particular, we show that for electorates having single-peaked preferences, many existing NP-hardness results on manipulation and control evaporate.",
        "citations": 179
    },
    {
        "title": "Llull and Copeland voting computationally resist bribery and constructive control",
        "id": "Z9W_SPAAAAAJ:Y0pCki6q_DkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:Y0pCki6q_DkC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Journal of Artificial Intelligence Research",
        "pub_date": "2009/6/24",
        "description": "Control and bribery are settings in which an external agent seeks to influence the outcome of an election. Constructive control of elections refers to attempts by an agent to, via such actions as addition/deletion/partition of candidates or voters, ensure that a given candidate wins. Destructive control refers to attempts by an agent to, via the same actions, preclude a given candidate's victory. An election system in which an agent can sometimes affect the result and it can be determined in polynomial time on which inputs the agent can succeed is said to be vulnerable to the given type of control. An election system in which an agent can sometimes affect the result, yet in which it is NP-hard to recognize the inputs on which the agent can succeed, is said to be resistant to the given type of control.",
        "citations": 259
    },
    {
        "title": "A richer understanding of the complexity of election systems",
        "id": "Z9W_SPAAAAAJ:UeHWp8X0CEIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:UeHWp8X0CEIC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Fundamental problems in computing: Essays in honor of Professor Daniel J. Rosenkrantz",
        "pub_date": "2009/4/21",
        "description": "We provide an overview of some recent progress on the complexity of election systems. The issues studied include the complexity of the winner, manipulation, bribery, and control problems.",
        "citations": 135
    },
    {
        "title": "Master Project J2ME version of the Tuple Board Travis Thomas April 17 2009 committee: Professor Alan Kaminsky",
        "id": "Z9W_SPAAAAAJ:PELIpwtuRlgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:PELIpwtuRlgC",
        "authors": [
            "Minseok Kwon",
            "Edith Hemaspaandra"
        ],
        "pub_source": "",
        "pub_date": "2009/4/17",
        "description": "The tuple board library was originally developed by Professor Alan Kaminsky to create programs that can be used in an ad-hoc networking environment. The library consist of code that allows a developer to easily communicate with other devices that are on the ad–hoc network. However, it can only be run on devices that are capable of supporting Java 2 Standard Edition (J2SE). Currently, there is a growing number of devices that can run the Java 2 Micro Edition (J2ME). These devices have capabilities that will allow them to take part in an unstructured or ad hoc network. This project will create a J2ME version of the tuple board library. This project will focus on three areas:1. Whether or not the tuple board can be ported to Java 2 Micro Edition 2. How cards games could be developed to run using the tuple board library 3. How someone might be able to securely deal a deck of cards in an ad-hoc environment Card …"
    },
    {
        "title": "Isomorphic Implication",
        "id": "Z9W_SPAAAAAJ:vV6vV6tmYwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:vV6vV6tmYwMC",
        "authors": [
            "Michael Bauland",
            "Edith Hemaspaandra"
        ],
        "pub_source": "Theory of Computing Systems",
        "pub_date": "2009/1",
        "description": "We study the isomorphic implication problem for Boolean constraints. We show that this is a natural analog of the subgraph isomorphism problem. We prove that, depending on the set of constraints, this problem is in P, or is NP-complete, or is NP-hard, coNP-hard, and in P                   ‖ NP                 . We show how to extend the NP-hardness and coNP-hardness to P                   ‖ NP                 -hardness for some cases, and conjecture that this can be done in all cases."
    },
    {
        "title": "Llull and Copeland voting computationally resist bribery and control",
        "id": "Z9W_SPAAAAAJ:hFOr9nPyWt4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:hFOr9nPyWt4C",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "arXiv preprint arXiv:0809.4484",
        "pub_date": "2008/9/25",
        "description": "The only systems previously known to be resistant to all the standard control types were highly artificial election systems created by hybridization. We study a parameterized version of Copeland voting, denoted by Copeland^\\alpha, where the parameter \\alpha is a rational number between 0 and 1 that specifies how ties are valued in the pairwise comparisons of candidates. We prove that Copeland^{0.5}, the system commonly referred to as \"Copeland voting,\" provides full resistance to constructive control, and we prove the same for Copeland^\\alpha, for all rational \\alpha, 0 < \\alpha < 1. Copeland voting is the first natural election system proven to have full resistance to constructive control. We also prove that both Copeland^1 (Llull elections) and Copeland^0 are resistant to all standard types of constructive control other than one variant of addition of candidates. Moreover, we show that for each rational \\alpha, 0 \\leq \\alpha \\leq 1, Copeland^\\alpha voting is fully resistant to bribery attacks, and we establish fixed-parameter tractability of bounded-case control for Copeland^\\alpha. We also study Copeland^\\alpha elections under more flexible models such as microbribery and extended control and we integrate the potential irrationality of voter preferences into many of our results.",
        "citations": 18
    },
    {
        "title": "Approximability of Manipulating Elections.",
        "id": "Z9W_SPAAAAAJ:Zph67rFs4hoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:Zph67rFs4hoC",
        "authors": [
            "Eric Brelsford",
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Henning Schnoor",
            "Ilka Schnoor"
        ],
        "pub_source": "AAAI",
        "pub_date": "2008/7/13",
        "description": "In this paper, we set up a framework to study approximation of manipulation, control, and bribery in elections. We show existence of approximation algorithms (even fully polynomial time approximation schemes) as well as obtain inapproximability results.",
        "citations": 69
    },
    {
        "title": "Copeland voting: Ties matter",
        "id": "Z9W_SPAAAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "Proceedings of the 7th international joint conference on Autonomous agents and multiagent systems-Volume 2",
        "pub_date": "2008/5/12",
        "description": "We study the complexity of manipulation for a family of election systems derived from Copeland voting via introducing a parameter α that describes how ties in head-to-head contests are valued. We show that the thus obtained problem of manipulation for unweighted Copelandα elections is NP-complete even if the size of the manipulating coalition is limited to two. Our result holds for all rational values of α such that 0< α< 1 except for α= 1",
        "citations": 127
    },
    {
        "title": "On the complexity of elementary modal logics",
        "id": "Z9W_SPAAAAAJ:L8Ckcad2t8MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:L8Ckcad2t8MC",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor"
        ],
        "pub_source": "arXiv preprint arXiv:0802.1884",
        "pub_date": "2008/2/13",
        "description": "Modal logics are widely used in computer science. The complexity of modal satisfiability problems has been investigated since the 1970s, usually proving results on a case-by-case basis. We prove a very general classification for a wide class of relevant logics: Many important subclasses of modal logics can be obtained by restricting the allowed models with first-order Horn formulas. We show that the satisfiability problem for each of these logics is either NP-complete or PSPACE-hard, and exhibit a simple classification criterion. Further, we prove matching PSPACE upper bounds for many of the PSPACE-hard logics.",
        "citations": 21
    },
    {
        "title": "Copeland voting fully resists constructive control",
        "id": "Z9W_SPAAAAAJ:ULOm3_A8WrAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ULOm3_A8WrAC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Algorithmic Aspects in Information and Management: 4th International Conference, AAIM 2008, Shanghai, China, June 23-25, 2008. Proceedings 4",
        "pub_date": "2008",
        "description": "Control and bribery are settings in which an external agent seeks to influence the outcome of an election. Faliszewski et al. [9] proved that Llull voting (which is here denoted by Copeland1) and a variant (here denoted by Copeland0) of Copeland voting are computationally resistant to many, yet not all, types of constructive control and that they also provide broad resistance to bribery. We study a parameterized version of Copeland voting, denoted by Copeland α , where the parameter α is a rational number between 0 and 1 that specifies how ties are valued in the pairwise comparisons of candidates in Copeland elections. For each rational α, 0 < α< 1, and each previously studied control scenario, we either prove that Copeland α  is computationally vulnerable to control in that scenario (i.e., we give a P-time algorithm that determines whether control is possible, and if so …",
        "citations": 36
    },
    {
        "title": "On the complexity of kings",
        "id": "Z9W_SPAAAAAJ:j3f4tGmQtD8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:j3f4tGmQtD8C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Till Tantau",
            "Osamu Watanabe"
        ],
        "pub_source": "International Symposium on Fundamentals of Computation Theory",
        "pub_date": "2007/8/27",
        "description": "A k-king in a directed graph is a node from which each node in the graph can be reached via paths of length at most k. Recently, kings have proven useful in theoretical computer science, in particular in the study of the complexity of reachability problems and semifeasible sets. In this paper, we study the complexity of recognizing k-kings. For each succinctly specified family of tournaments (completely oriented digraphs), the k-king problem is easily seen to belong to . We prove that the complexity of kingship problems is a rich enough vocabulary to pinpoint every nontrivial many-one degree in . That is, we show that for every k ≥ 2 every set in  other than ∅ and Σ * is equivalent to a k-king problem under -reductions. The equivalence can be instantiated via a simple padding function. Our results can be used to show that the radius problem for arbitrary succinctly represented graphs is  …",
        "citations": 4
    },
    {
        "title": "Llull and Copeland voting broadly resist bribery and control",
        "id": "Z9W_SPAAAAAJ:YsMSGLbcyi4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:YsMSGLbcyi4C",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "AAAI",
        "pub_date": "2007/7/22",
        "description": "Control of elections refers to attempts by an agent to, via such actions as addition/deletion/partition of candidates or voters, ensure that a given candidate wins (Bartholdi, Tovey, & Trick 1992). An election system in which such an agent’s computational task is NP-hard is said to be resistant to the given type of control. Aside from election systems with an NP-hard winner problem, the only systems known to be resistant to all the standard control types are highly artificial election systems created by hybridization (Hemaspaandra, Hemaspaandra, & Rothe 2007b). In this paper, we prove that an election system developed by the 13th century mystic Ramon Llull and the well-studied Copeland election system are both resistant to all the standard types of (constructive) electoral control other than one variant of addition of candidates. This is the most comprehensive resistance to control yet achieved by any natural election system whose winner problem is in P. In addition, we show that Llull and Copeland voting are very broadly resistant to bribery attacks, and we integrate the potential irrationality of voter preferences into many of our results.",
        "citations": 63
    },
    {
        "title": "Christopher Jay Connett",
        "id": "Z9W_SPAAAAAJ:4OULZ7Gr8RgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:4OULZ7Gr8RgC",
        "authors": [
            "Edith Hemaspaandra",
            "Henning Schnoor",
            "Hans-Peter Bischoff"
        ],
        "pub_source": "",
        "pub_date": "2007/5/21",
        "description": "BackgroundSocial choice is a relatively young academic field. It is principally concerned with the ability of a population to combine the views of its individual members and determine a joint policy for its future. Clearly there is the obvious application to human politics, but recently researchers in artificial intelligence have become concerned with social choice as it applies to settings with multiple artificial intelligence agents.One of social choice’s earliest and most well-known results is Kenneth Arrow’s impossibility theorem, which colloquially states that there is no perfect voting rule [Arr51]. Specifically, Arrow’s impossibility theorem states that there is no monotonic, Pareto-optimal, non-dictatorial voting rule under which irrelevant candidates never alter the outcome of the vote for the more relevant candidates. Since Arrow’s result, social choice researchers have been analyzing voting rules on the basis of their …"
    },
    {
        "title": "Anyone but him: The complexity of precluding an alternative",
        "id": "Z9W_SPAAAAAJ:u-x6o8ySG0sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:u-x6o8ySG0sC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Artificial Intelligence",
        "pub_date": "2007/4/1",
        "description": "Preference aggregation in a multiagent setting is a central issue in both human and computer contexts. In this paper, we study in terms of complexity the vulnerability of preference aggregation to destructive control. In particular, we study the ability of an election's chair to, through such mechanisms as voter/candidate addition/suppression/partition, ensure that a particular candidate (equivalently, alternative) does not win. And we study the extent to which election systems can make it impossible, or computationally costly (NP-complete), for the chair to execute such control. Among the systems we study—plurality, Condorcet, and approval voting—we find cases where systems immune or computationally resistant to a chair choosing the winner nonetheless are vulnerable to the chair blocking a victory. Beyond that, we see that among our studied systems no one system offers the best protection against destructive …",
        "citations": 289
    },
    {
        "title": "Dichotomy for voting systems",
        "id": "Z9W_SPAAAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Journal of Computer and System Sciences",
        "pub_date": "2007/2/1",
        "description": "Scoring protocols are a broad class of voting systems. Each is defined by a vector (α1,α2,…,αm), α1⩾α2⩾⋯⩾αm, of integers such that each voter contributes α1 points to his/her first choice, α2 points to his/her second choice, and so on, and any candidate receiving the most points is a winner. What is it about scoring-protocol election systems that makes some have the desirable property of being NP-complete to manipulate, while others can be manipulated in polynomial time? We find the complete, dichotomizing answer: Diversity of dislike. Every scoring-protocol election system having two or more point values assigned to candidates other than the favorite—i.e., having ‖{αi|2⩽i⩽m}‖⩾2—is NP-complete to manipulate. Every other scoring-protocol election system can be manipulated in polynomial time. In effect, we show that—other than trivial systems (where all candidates alway tie), plurality voting, and plurality …",
        "citations": 159
    },
    {
        "title": "Complexity results in graph reconstruction",
        "id": "Z9W_SPAAAAAJ:7PzlFSSx8tAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:7PzlFSSx8tAC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Stanisław P Radziszowski",
            "Rahul Tripathi"
        ],
        "pub_source": "Discrete Applied Mathematics",
        "pub_date": "2007/1/15",
        "description": "We investigate the relative complexity of the graph isomorphism problem (GI) and problems related to the reconstruction of a graph from its vertex-deleted or edge-deleted subgraphs (in particular, deck checking (DC) and legitimate deck (LD) problems). We show that these problems are closely related for all amounts c⩾1 of deletion:For many of these results, even the c=1 case was not previously known. Similar to the definition of reconstruction numbers vrn∃(G) [F. Harary, M. Plantholt, The graph reconstruction number, J. Graph Theory 9 (1985) 451–454] and ern∃(G) (see [J. Lauri, R. Scapellato Topics in Graph Automorphism and Reconstruction, London Mathematical Society, Cambridge University Press, Cambridge, 2003, p. 120]), we introduce two new graph parameters, vrn∀(G) and ern∀(G), and give an example of a family {Gn}n⩾4 of graphs on n vertices for which vrn∃(Gn)<vrn∀(Gn). For every k⩾2 and n …",
        "citations": 18
    },
    {
        "title": "Llull and Copeland Voting Broadly Resist Bribery and Control",
        "id": "Z9W_SPAAAAAJ:OU6Ihb5iCvQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:OU6Ihb5iCvQC",
        "authors": [
            "Lane Hemaspaandra",
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "Control of elections refers to attempts by an agent to, via such actions as addition/deletion/partition of candidates or voters, ensure that a given candidate wins [BTT92]. An election system in which such an agent's computational task is NP-hard is said to be resistant to the given type of control. The only election systems known to be resistant to all the standard control types are highly artificial election systems created by hybridization [HHR07]. In this paper, we prove that an election system developed by the 13th century mystic Ramon Llull and the well-studied Copeland election system are both resistant to all the standard types of (constructive) electoral control other than one variant of addition of candidates. This is the most comprehensive resistance to control yet achieved by any natural election system. In addition, we show that Llull and Copeland voting are very broadly resistant to bribery attacks, and we integrate the potential irrationality of voter preferences into many of our results."
    },
    {
        "title": "Copeland Voting Fully Resists Constructive Control",
        "id": "Z9W_SPAAAAAJ:SP6oXDckpogC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:SP6oXDckpogC",
        "authors": [
            "Jörg Rothe",
            "Edith Hemaspaandra",
            "Lane Hemaspaandra",
            "Piotr Faliszewski"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "Control and bribery are settings in which an external agent seeks to influence the outcome of an election. Faliszewski et al.[FHHR07] proved that Llull voting (which is here denoted by Copeland^ 1) and a variant (here denoted by Copeland^ 0) of Copeland voting are computationally resistant to many, yet not all, types of constructive control and that they also provide broad resistance to bribery. We study a parameterized version of Copeland voting, denoted by Copeland^ alpha where the parameter alpha is a rational number between 0 and 1 that specifies how ties are valued in the pairwise comparisons of candidates in Copeland elections. We establish resistance or vulnerability results, in every previously studied control scenario, for Copeland^ alpha, for each rational alpha, 0< alpha< 1. In particular, we prove that Copeland^ 0.5, the system commonly referred to as``Copeland voting,''provides full resistance to constructive control. Among the systems with a polynomial-time winner problem, this is the first natural election system proven to have full resistance to constructive control. Results on bribery and fixed-parameter tractability of bounded-case control proven for Copeland^ 0 and Copeland^ 1 in [FHHR07] are extended to Copeland^ alpha for each rational alpha, 0< alpha< 1; we also give results in more flexible models such as microbribery and extended control."
    },
    {
        "title": "The complexity of bribery in elections",
        "id": "Z9W_SPAAAAAJ:Tyk-4Ss8FVUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:Tyk-4Ss8FVUC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "AAAI",
        "pub_date": "2006/7/16",
        "description": "We study the complexity of influencing elections through bribery: How computationally complex is it for an external actor to determine whether by a certain amount of bribing voters a specified candidate can be made the election’s winner? We study this problem for election systems as varied as scoring protocols and Dodgson voting, and in a variety of settings regarding homogeneous-vs.-nonhomogeneous electorate bribability, bounded-size-vs.-arbitrary-sized candidate sets, weighted-vs.-unweighted voters, and succinct-vs.-nonsuccinct input specification. We obtain both polynomialtime bribery algorithms and proofs of the intractability of bribery, and indeed our results show that the complexity of bribery is extremely sensitive to the setting. For example, we find settings in which bribery is NP-complete but manipulation (by voters) is in P, and we find settings in which bribing weighted voters is NP-complete but bribing voters with individual bribe thresholds is in P. For the broad class of elections (including plurality, Borda, k-approval, and veto) known as scoring protocols, we prove a dichotomy result for bribery of weighted voters: We find a simple-to-evaluate condition that classifies every case as either NP-complete or in P.",
        "citations": 97
    },
    {
        "title": "Modal logic in computer science",
        "id": "Z9W_SPAAAAAJ:WA5NYHcadZ8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:WA5NYHcadZ8C",
        "authors": [
            "Leigh Lambert"
        ],
        "pub_source": "",
        "pub_date": "2006",
        "description": "Modal logic is a widely applicable method of reasoning for many areas of computer science. These areas include artificial intelligence, database theory, distributed systems, program verification, and cryptography theory. Modal logic operators contain propositional logic operators, such as conjunction and negation, and operators that can have the following meanings:\" it is necessary that,\"\" after a program has terminated,\"\" an agent knows or believes that,\"\" it is always the case that,\" etc. Computer scientists have examined the difficulty of problems in modal logic, such as satisfiability. Satisfiability determines whether a formula in a given logic is satisfiable. The complexity of satisfiability in modal logic has a wide range. Depending on how a modal logic is restricted, the complexity can be anywhere from NP-complete to highly undecidable. This project gives an introduction to common variations of modal logic in computer science and their complexity results.",
        "citations": 4
    },
    {
        "title": "Recognizing when heuristics can approximate minimum vertex covers is complete for parallel access to NP",
        "id": "Z9W_SPAAAAAJ:QIV2ME_5wuYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:QIV2ME_5wuYC",
        "authors": [
            "Edith Hemaspaandra",
            "Jörg Rothe",
            "Holger Spakowski"
        ],
        "pub_source": "RAIRO-Theoretical Informatics and Applications",
        "pub_date": "2006/1",
        "description": "For both the edge deletion heuristic and the maximum-degree greedy heuristic, we study the problem of recognizing those graphs for which that heuristic can approximate the size of a minimum vertex cover within a constant factor of r, where r is a fixed rational number. Our main results are that these problems are complete for the class of problems solvable via parallel access to NP. To achieve these main results, we also show that the restriction of the vertex cover problem to those graphs for which either of these heuristics can find an optimal solution remains NP-hard.",
        "citations": 16
    },
    {
        "title": "Generalized modal satisfiability",
        "id": "Z9W_SPAAAAAJ:Se3iqnhoufwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:Se3iqnhoufwC",
        "authors": [
            "Michael Bauland",
            "Edith Hemaspaandra",
            "Henning Schnoor",
            "Ilka Schnoor"
        ],
        "pub_source": "STACS 2006: 23rd Annual Symposium on Theoretical Aspects of Computer Science, Marseille, France, February 23-25, 2006. Proceedings 23",
        "pub_date": "2006",
        "description": "It is well-known that modal satisfiability is PSPACE-complete [Lad77]. However, the complexity may decrease if we restrict the set of propositional operators used. Note that there exist an infinite number of propositional operators, since a propositional operator is simply a Boolean function. We completely classify the complexity of modal satisfiability for every finite set of propositional operators, i.e., in contrast to previous work, we classify an infinite number of problems. We show that, depending on the set of propositional operators, modal satisfiability is PSPACE-complete, coNP-complete, or in P. We obtain this trichotomy not only for modal formulas, but also for their more succinct representation using modal circuits.",
        "citations": 30
    },
    {
        "title": "The complexity of Kemeny elections",
        "id": "Z9W_SPAAAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Edith Hemaspaandra",
            "Holger Spakowski",
            "Jörg Vogel"
        ],
        "pub_source": "Theoretical Computer Science",
        "pub_date": "2005/12/16",
        "description": "Kemeny proposed a voting scheme which is distinguished by the fact that it is the unique voting scheme that is neutral, consistent, and Condorcet. Bartholdi, Tovey, and Trick showed that determining the winner in Kemeny's system is NP-hard. We provide a stronger lower bound and an upper bound matching the lower bound, namely, we show that determining the winner in Kemeny's system is complete for P||NP, the class of sets solvable via parallel access to NP.",
        "citations": 237
    },
    {
        "title": "All superlinear inverse schemes are coNP-hard",
        "id": "Z9W_SPAAAAAJ:r0BpntZqJG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:r0BpntZqJG4C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "Theoretical computer science",
        "pub_date": "2005/11/22",
        "description": "How hard is it to invert NP-problems? We show that all superlinearly certified inverses of NP problems are coNP-hard. To do so, we develop a novel proof technique that builds diagonalizations against certificates directly into a circuit.",
        "citations": 5
    },
    {
        "title": "Isomorphic implication",
        "id": "Z9W_SPAAAAAJ:hC7cP41nSMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:hC7cP41nSMkC",
        "authors": [
            "Michael Bauland",
            "Edith Hemaspaandra"
        ],
        "pub_source": "International Symposium on Mathematical Foundations of Computer Science",
        "pub_date": "2005/8/29",
        "description": "We study the isomorphic implication problem for Boolean constraints. We show that this is a natural analog of the subgraph isomorphism problem. We prove that, depending on the set of constraints, this problem is in P, NP-complete, or NP-hard, coNP-hard, and in . We show how to extend the NP-hardness and coNP-hardness to -hardness for some cases, and conjecture that this can be done in all cases.",
        "citations": 5
    },
    {
        "title": "Extending downward collapse from 1-versus-2 queries to m-versus-m+ 1 queries",
        "id": "Z9W_SPAAAAAJ:bEWYMUwI8FkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:bEWYMUwI8FkC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "SIAM Journal on Computing",
        "pub_date": "2005",
        "description": "The top part of Figure 1.1 shows some classes from the (truth-table) bounded-query and boolean hierarchies. It is well known that if either of these hierarchies collapses at a given level, then all higher levels of that hierarchy collapse to that same level. This is a standard \"upward translation of equality\" that has been known for over a decade. The issue of whether these hierarchies can translate equality downwards has proven vastly more challenging. In particular, with regard to Figure 1.1, consider the following claim: \\[ \\psigkmtt = \\psigkmponett \\implies \\diffmsigk = \\codiffmsigk = \\bh(\\sigmak). (*) \\] Until recently, it was not known whether (*) ever held, except for the degenerate cases m = 0 and k = 0. Then Hemaspaandra, Hemaspaandra, and Hempel [SIAM J. Comput., 28 (1999), pp. 383--393] proved that (*) holds for all m, for k > 2. Buhrman and Fortnow [J. Comput. System Sci., 59 (1999), pp. 182--199] then showed …",
        "citations": 2
    },
    {
        "title": "Complexity results in graph reconstruction",
        "id": "Z9W_SPAAAAAJ:dhFuZR0502QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:dhFuZR0502QC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Stanisław Radziszowski",
            "Rahul Tripathi"
        ],
        "pub_source": "International Symposium on Mathematical Foundations of Computer Science",
        "pub_date": "2004/8/22",
        "description": "We investigate the relative complexity of the graph isomorphism problem (GI) and problems related to the reconstruction of a graph from its vertex-deleted or edge-deleted subgraphs. We show that the problems are rather closely related for all amounts c of deletion:    For all c ≥ 1, GI VDC c , GI EDC c , GI LVD c , and GI LED c .   For all c ≥ 1 and k ≥ 2, ${\\rm GI} \\equiv^{p}_{iso} {k\\textnormal{-}\\rm VDC}_c$ and ${\\rm GI} \\equiv^{p}_{iso} {k\\textnormal{-}\\rm EDC}_c$.   For all c ≥ 1 and k ≥ 2, ${\\rm GI} \\leq^{l}_{m} {k\\textnormal{-}\\rm LVD}_c$. In particular, for all c ≥ 1, ${\\rm GI} \\equiv^{p}_{iso} {2\\textnormal{-}\\rm LVD}_c$.   For all c ≥ 1 and k ≥ 2, ${\\rm GI …",
        "citations": 12
    },
    {
        "title": "Dichotomy theorems for alternation-bounded quantified boolean formulas",
        "id": "Z9W_SPAAAAAJ:3fE2CSJIrl8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:3fE2CSJIrl8C",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "arXiv preprint cs/0406006",
        "pub_date": "2004/6/2",
        "description": "In 1978, Schaefer proved his famous dichotomy theorem for generalized satisfiability problems. He defined an infinite number of propositional satisfiability problems, showed that all these problems are either in P or NP-complete, and gave a simple criterion to determine which of the two cases holds. This result is surprising in light of Ladner's theorem, which implies that there are an infinite number of complexity classes between P and NP-complete (under the assumption that P is not equal to NP). Schaefer also stated a dichotomy theorem for quantified generalized Boolean formulas, but this theorem was only recently proven by Creignou, Khanna, and Sudan, and independently by Dalmau: Determining truth of quantified Boolean formulas is either PSPACE-complete or in P. This paper looks at alternation-bounded quantified generalized Boolean formulas. In their unrestricted forms, these problems are the canonical problems complete for the levels of the polynomial hierarchy. In this paper, we prove dichotomy theorems for alternation-bounded quantified generalized Boolean formulas, by showing that these problems are either -complete or in P, and we give a simple criterion to determine which of the two cases holds. This is the first result that obtains dichotomy for an infinite number of classes at once.",
        "citations": 10
    },
    {
        "title": "Complexity of cycle length modularity problems in graphs",
        "id": "Z9W_SPAAAAAJ:mB3voiENLucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:mB3voiENLucC",
        "authors": [
            "Edith Hemaspaandra",
            "Holger Spakowski",
            "Mayur Thakur"
        ],
        "pub_source": "Latin American Symposium on Theoretical Informatics",
        "pub_date": "2004/4/5",
        "description": "The even cycle problem for both undirected [Tho88] and directed [RST99] graphs has been the topic of intense research in the last decade. In this paper, we study the computational complexity of cycle length modularity problems. Roughly speaking, in a cycle length modularity problem, given an input (undirected or directed) graph, one has to determine whether the graph has a cycle C of a specific length (or one of several different lengths), modulo a fixed integer. We denote the two families (one for undirected graphs and one for directed graphs) of problems by (S,m)-UC and (S,m)-DC, where m ∈ ℕ and S ⊆ {0,1, ..., m − 1}. (S,m)-UC (respectively, (S,m)-DC) is defined as follows: Given an undirected (respectively, directed) graph G, is there a cycle in G whose length, modulo m, is a member of S? In this paper, we fully classify (i.e., as either polynomial-time solvable or as NP-complete) each problem …",
        "citations": 10
    },
    {
        "title": "The complexity of Boolean constraint isomorphism",
        "id": "Z9W_SPAAAAAJ:KlAtU1dfN6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:KlAtU1dfN6UC",
        "authors": [
            "Elmar Böhler",
            "Edith Hemaspaandra",
            "Steffen Reith",
            "Heribert Vollmer"
        ],
        "pub_source": "Annual Symposium on Theoretical Aspects of Computer Science",
        "pub_date": "2004/3/25",
        "description": "We consider the Boolean constraint isomorphism problem, that is, the problem of determining whether two sets of Boolean constraint applications can be made equivalent by renaming the variables. We show that depending on the set of allowed constraints, the problem is either coNP-hard and GI-hard, equivalent to graph isomorphism, or polynomial-time solvable. This establishes a complete classification of the complexity of the problem, and moreover, it identifies exactly all those cases in which Boolean constraint isomorphism is polynomial-time many-one equivalent to graph isomorphism, the best-known and best-examined isomorphism problem in theoretical computer science.",
        "citations": 23
    },
    {
        "title": "Graphs and Complexity-Complexity Results in Graph Reconstruction",
        "id": "Z9W_SPAAAAAJ:ipzZ9siozwsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ipzZ9siozwsC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Stanislaw Radziszowski",
            "Rahul Tripathi"
        ],
        "pub_source": "Lecture Notes in Computer Science",
        "pub_date": "2004",
        "description": "We investigate the relative complexity of the graph isomorphism problem (GI) and problems related to the reconstruction of a graph from its vertex-deleted or edge-deleted subgraphs. We show that the problems are rather closely related for all amounts c of deletion: 1. For all c≥ 1, GI iso VDCc, GI iso EDCc, GI≤ m LVDe, and GI= so LEDC. iso iso 2. For all c≥ 1 and k> 2, GI= s, k-VDC, and GI= k-EDCc. 3. For all c≥ 1 and k≥ 2, GI≤ m k-LVDc. In particular, for all c≥ 1, GI 2-LVDC."
    },
    {
        "title": "Complexity Results in Graph Reconstruction",
        "id": "Z9W_SPAAAAAJ:uWQEDVKXjbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:uWQEDVKXjbEC",
        "authors": [
            "Stanislaw Radziszowski",
            "Edith Hemaspaandra",
            "Lane Hemaspaandra",
            "Rahul Tripathi"
        ],
        "pub_source": "",
        "pub_date": "2004",
        "description": "We investigate the relative complexity of the graph isomorphism problem (GI) and problems related to the reconstruction of a graph from its vertex-deleted or edge-deleted subgraphs (in particular, deck checking (DC) and legitimate deck (LD) problems). We show that these problems are closely related for all amounts  of deletion: 1) , , , and . 2) For all ,  and . 3) For all , . 4) . 5) For all , . For many of these results, even the  case was not previously known. Similar to the definition of reconstruction numbers [HP85] and (see page 120 of [LS03]), we introduce two new graph parameters,  and , and give an example of a family  of graphs on  vertices for which . For every  and , we show that there exists a collection of  graphs on  vertices with 1-vertex-preimages, ie, one has families of graph collections whose number of 1-vertex-preimages is huge relative to the size of the graphs involved."
    },
    {
        "title": "Equivalence and isomorphism for Boolean constraint satisfaction",
        "id": "Z9W_SPAAAAAJ:ufrVoPGSRksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ufrVoPGSRksC",
        "authors": [
            "Elmar Böhler",
            "Edith Hemaspaandra",
            "Steffen Reith",
            "Heribert Vollmer"
        ],
        "pub_source": "International Workshop on Computer Science Logic",
        "pub_date": "2002/9/2",
        "description": "A Boolean constraint satisfaction instance is a set of constraint applications where the allowed constraints are drawn from a fixed set C of Boolean functions. We consider the problem of determining whether two given constraint satisfaction instances are equivalent and prove a dichotomy theorem by showing that for all finite sets C of constraints, this problem is either polynomial-time solvable or coNP-complete, and we give a simple criterion to determine which case holds. A more general problem addressed in this paper is the isomorphism problem, the problem of determining whether there exists a renaming of the variables that makes two given constraint satisfaction instances equivalent in the above sense. We prove that this problem is coNP-hard if the corresponding equivalence problem is coNP-hard, and polynomial-time many-one reducible to the graph isomorphism problem in all other cases.",
        "citations": 42
    },
    {
        "title": "Almost-everywhere superiority for quantum polynomial time",
        "id": "Z9W_SPAAAAAJ:mVmsd5A6BfQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:mVmsd5A6BfQC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Marius Zimand"
        ],
        "pub_source": "Information and Computation",
        "pub_date": "2002/6/15",
        "description": "Simon as extended by Brassard and Høyer shows that there are tasks on which polynomial-time quantum machines are exponentially faster than each classical machine infinitely often. The present paper shows that there are tasks on which polynomial-time quantum machines are exponentially faster than each classical machine almost everywhere.",
        "citations": 20
    },
    {
        "title": "Recognizing when heuristics can approximate minimum vertex covers is complete for parallel access to NP",
        "id": "Z9W_SPAAAAAJ:5ugPr518TE4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:5ugPr518TE4C",
        "authors": [
            "Edith Hemaspaandra",
            "Jörg Rothe",
            "Holger Spakowski2"
        ],
        "pub_source": "Graph-Theoretic Concepts in Computer Science: 28th International Workshop, WG 2002 Český Krumlov, Czech Republic, June 13–15, 2002 Revised Papers 28",
        "pub_date": "2002",
        "description": "For both the edge deletion heuristic and the maximum degree greedy heuristic, we study the problem of recognizing those graphs for which that heuristic can approximate the size of a minimum vertex cover within a constant factor of r, where r is a fixed rational number. Our main results are that these problems are complete for the class of problems solvable via parallel access to NP. To achieve these main results, we also show that the restriction of the vertex cover problem to those graphs for which either of these heuristics can find an optimal solution remains NP-hard.",
        "citations": 6
    },
    {
        "title": "Bruce, Kim B.",
        "id": "Z9W_SPAAAAAJ:XiSMed-E-HIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:XiSMed-E-HIC",
        "authors": [
            "Craig Chambers",
            "Giorgio Ghelli",
            "Manfred Göbel",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Hans Hüttel",
            "Atsushi Igarashi",
            "Josva Kleist",
            "Heinz Kredel",
            "Todd Millstein",
            "Uwe Nestmann",
            "Benjamin C Pierce",
            "Corrado Priami",
            "Sergei Vorobyov",
            "VV V’yugin",
            "Marius Zimand"
        ],
        "pub_source": "Information and Computation",
        "pub_date": "2002"
    },
    {
        "title": "Almost-everywhere superiority for quantum polynomial-time languages",
        "id": "Z9W_SPAAAAAJ:TFP_iSt0sucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:TFP_iSt0sucC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane Hemaspaandra",
            "Marius Zimand"
        ],
        "pub_source": "",
        "pub_date": "2002",
        "description": "We prove that, relative to some black box, there are languages for which polynomial-time quantum machines are exponentially faster than each classical machine almost everywhere.",
        "citations": 1
    },
    {
        "title": "The minimization problem for boolean formulas",
        "id": "Z9W_SPAAAAAJ:YOwf2qJgpHMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:YOwf2qJgpHMC",
        "authors": [
            "Edith Hemaspaandra",
            "Gerd Wechsung"
        ],
        "pub_source": "SIAM Journal on Computing",
        "pub_date": "2002",
        "description": "More than a quarter of a century ago, the question of the complexity of determining whether a given Boolean formula is minimal motivated Meyer and Stockmeyer to define the polynomial hierarchy. This problem (in the standard formalized version---that of Garey and Johnson) has been known for decades to be coNP-hard and in NPNP, and yet no one had even been able to establish (many-one) NP-hardness. In this paper, we show that and more: The problem in fact is (many-one) hard for parallel access to NP.",
        "citations": 27
    },
    {
        "title": "The complexity of poor man's logic",
        "id": "Z9W_SPAAAAAJ:roLk4NBRz8UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:roLk4NBRz8UC",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "Journal of Logic and Computation",
        "pub_date": "2001/8/1",
        "description": "Motivated by description logics, we investigate what happens to the complexity of modal satisfiability problems if we only allow formulas built from literals, ∧, ◊, and □. Previously, the only known result was that the complexity of the satisfiability problem for K drops from PSPACE‐complete to coNP‐complete. In this paper we show that not all modal logics behave like K. In particular, we show that the complexity of the satisfiability problem with respect to frames in which each world has at least one successor drops from PSPACE‐complete to P, but that in contrast the satisfiability problem with respect to the class of frames in which each world has at most two successors remains PSPACE‐complete. As a corollary of the latter result, we also solve the open problem from the complexity classification of description logics. In the last section, we classify the complexity of the satisfiability problem for K for all other restrictions on …",
        "citations": 43
    },
    {
        "title": "Using the no-search easy-hard technique for downward collapse",
        "id": "Z9W_SPAAAAAJ:iH-uZ7U-co4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:iH-uZ7U-co4C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "arXiv preprint cs/0106037",
        "pub_date": "2001/6/15",
        "description": "The top part of the preceding figure [figure appears in actual paper] shows some classes from the (truth-table) bounded-query and boolean hierarchies. It is well-known that if either of these hierarchies collapses at a given level, then all higher levels of that hierarchy collapse to that same level. This is a standard ``upward translation of equality'' that has been known for over a decade. The issue of whether these hierarchies can translate equality {\\em downwards\\/} has proven vastly more challenging. In particular, with regard to the figure above, consider the following claim: $$P_{m-tt}^{\\Sigma_k^p} = P_{m+1-tt}^{\\Sigma_k^p} \\implies DIFF_m(\\Sigma_k^p) coDIFF_m(\\Sigma_k^p) = BH(\\Sigma_k^p). (*) $$ This claim, if true, says that equality translates downwards between levels of the bounded-query hierarchy and the boolean hierarchy levels that (before the fact) are immediately below them. Until recently, it was not known whether (*) {\\em ever\\/} held, except for the degenerate cases  and . Then Hemaspaandra, Hemaspaandra, and Hempel \\cite{hem-hem-hem:j:downward-translation} proved that (*) holds for all , for . Buhrman and Fortnow~\\cite{buh-for:j:two-queries} then showed that, when , (*) holds for the case . In this paper, we prove that for the case , (*) holds for all values of . Since there is an oracle relative to which ``for , (*) holds for all '' fails \\cite{buh-for:j:two-queries}, our achievement of the  case cannot to be strengthened to  by any relativizable proof technique. The new downward translation we obtain also tightens the collapse in the polynomial hierarchy implied by a collapse in the …",
        "citations": 3
    },
    {
        "title": "Equivalence problems for Boolean constraint satisfaction",
        "id": "Z9W_SPAAAAAJ:TQgYirikUcIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:TQgYirikUcIC",
        "authors": [
            "Elmar Böhler",
            "Edith Hemaspaandra",
            "Steffen Reith",
            "Heribert Vollmer"
        ],
        "pub_source": "Preprint, Reihe Institut fur Informatik Universitat Wurzburg",
        "pub_date": "2001",
        "citations": 6
    },
    {
        "title": "Modal satisfiability is in deterministic linear space",
        "id": "Z9W_SPAAAAAJ:R3hNpaxXUhUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:R3hNpaxXUhUC",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "International Workshop on Computer Science Logic",
        "pub_date": "2000/8/21",
        "description": "In recent years, there has been a lot of interest in analyzing the space requirements for modal logics. In this paper, we prove that modal satisfiability is in deterministic linear space. This improves the best previously-known O(n log n) bound and it is the first linear space result in this area.",
        "citations": 5
    },
    {
        "title": "The complexity of poor man’s logic",
        "id": "Z9W_SPAAAAAJ:_Qo2XoVZTnwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:_Qo2XoVZTnwC",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "Annual Symposium on Theoretical Aspects of Computer Science",
        "pub_date": "2000/2/17",
        "description": "Motivated by description logics, we investigate what happens to the complexity of modal satisfiability problems if we only allow formulas built from literals, ^, ◊, and □. Previously, the only known result was that the complexity of the satisfiability problem for K dropped from PSPACE-complete to coNP-complete (Schmidt-Schauss and Smolka [8] and Donini et al. [3]). In this paper we show that not all modal logics behave like K. In particular, we show that the complexity of the satisfiability problem with respect to frames in which each world has at least one successor drops from PSPACE-complete to P, but that in contrast the satisfiability problem with respect to the class of frames in which each world has at most two successors remains PSPACE-complete. As a corollary of the latter result, we also solve the open problem from Donini et al.’s complexity classification of description logics [2]. In the last section, we …",
        "citations": 11
    },
    {
        "title": "Computational politics: Electoral systems",
        "id": "Z9W_SPAAAAAJ:hqOjcs7Dif8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:hqOjcs7Dif8C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Mathematical Foundations of Computer Science 2000: 25th International Symposium, MFCS 2000 Bratislava, Slovakia, August 28–September 1, 2000 Proceedings 25",
        "pub_date": "2000",
        "description": "This paper discusses three computation-related results in the study of electoral systems:                       1.                                             Determining the winner in Lewis Carroll’s 1876 electoral system is complete for parallel access to NP [22].                       2.                                             For any electoral system that is neutral, consistent, and Condorcet, determining the winner is complete for parallel access to NP [21].                       3.                                             For each census in US history, a simulated annealing algorithm yields provably fairer (in a mathematically rigorous sense) congressional apportionments than any of the classic algorithms—even the algorithm currently used in the United States [24].",
        "citations": 30
    },
    {
        "title": "Almost-everywhere superiority for quantum computing",
        "id": "Z9W_SPAAAAAJ:k_IJM867U9cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:k_IJM867U9cC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Marius Zimand"
        ],
        "pub_source": "arXiv preprint quant-ph/9910033",
        "pub_date": "1999/10/8",
        "description": "Simon as extended by Brassard and H{\\o}yer shows that there are tasks on which polynomial-time quantum machines are exponentially faster than each classical machine infinitely often. The present paper shows that there are tasks on which polynomial-time quantum machines are exponentially faster than each classical machine almost everywhere.",
        "citations": 2
    },
    {
        "title": "An introduction to query order",
        "id": "Z9W_SPAAAAAJ:M3ejUd6NZC8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:M3ejUd6NZC8C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "arXiv preprint cs/9910004",
        "pub_date": "1999/10/1",
        "description": "Hemaspaandra, Hempel, and Wechsung [cs.CC/9909020] raised the following questions: If one is allowed one question to each of two different information sources, does the order in which one asks the questions affect the class of problems that one can solve with the given access? If so, which order yields the greater computational power? The answers to these questions have been learned-inasfar as they can be learned without resolving whether or not the polynomial hierarchy collapses-for both the polynomial hierarchy and the boolean hierarchy. In the polynomial hierarchy, query order never matters. In the boolean hierarchy, query order sometimes does not matter and, unless the polynomial hierarchy collapses, sometimes does matter. Furthermore, the study of query order has yielded dividends in seemingly unrelated areas, such as bottleneck computations and downward translation of equality. In this article, we present some of the central results on query order. The article is written in such a way as to encourage the reader to try his or her own hand at proving some of these results. We also give literature pointers to the quickly growing set of related results and applications.",
        "citations": 20
    },
    {
        "title": "Translating equality downwards",
        "id": "Z9W_SPAAAAAJ:4TOpqqG69KYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:4TOpqqG69KYC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "arXiv preprint cs/9910008",
        "pub_date": "1999/10/1",
        "description": "Downward translation of equality refers to cases where a collapse of some pair of complexity classes would induce a collapse of some other pair of complexity classes that (a priori) one expects are smaller. Recently, the first downward translation of equality was obtained that applied to the polynomial hierarchy-in particular, to bounded access to its levels [cs.CC/9910007]. In this paper, we provide a much broader downward translation that extends not only that downward translation but also that translation's elegant enhancement by Buhrman and Fortnow. Our work also sheds light on previous research on the structure of refined polynomial hierarchies, and strengthens the connection between the collapse of bounded query hierarchies and the collapse of the polynomial hierarchy.",
        "citations": 17
    },
    {
        "title": "Query order and the polynomial hierarchy",
        "id": "Z9W_SPAAAAAJ:UebtZRa9Y70C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:UebtZRa9Y70C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "arXiv preprint cs/9910005",
        "pub_date": "1999/10/1",
        "description": "Hemaspaandra, Hempel, and Wechsung [cs.CC/9909020] initiated the field of query order, which studies the ways in which computational power is affected by the order in which information sources are accessed. The present paper studies, for the first time, query order as it applies to the levels of the polynomial hierarchy. We prove that the levels of the polynomial hierarchy are order-oblivious. Yet, we also show that these ordered query classes form new levels in the polynomial hierarchy unless the polynomial hierarchy collapses. We prove that all leaf language classes - and thus essentially all standard complexity classes - inherit all order-obliviousness results that hold for P.",
        "citations": 30
    },
    {
        "title": "Raising NP Lower Bounds to Parallel NP Lower Bounds",
        "id": "Z9W_SPAAAAAJ:lmc2jWPfTJgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:lmc2jWPfTJgC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Joerg Rothe"
        ],
        "pub_source": "arXiv preprint cs/9907039",
        "pub_date": "1999/7/25",
        "description": "A decade ago, a beautiful paper by Wagner developed a ``toolkit'' that in certain cases allows one to prove problems hard for parallel access to NP. However, the problems his toolkit applies to most directly are not overly natural. During the past year, problems that previously were known only to be NP-hard or coNP-hard have been shown to be hard even for the class of sets solvable via parallel access to NP. Many of these problems are longstanding and extremely natural, such as the Minimum Equivalent Expression problem (which was the original motivation for creating the polynomial hierarchy), the problem of determining the winner in the election system introduced by Lewis Carroll in 1876, and the problem of determining on which inputs heuristic algorithms perform well. In the present article, we survey this recent progress in raising lower bounds."
    },
    {
        "title": "On the power of positive Turing reductions",
        "id": "Z9W_SPAAAAAJ:JV2RwH3_ST0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:JV2RwH3_ST0C",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "arXiv preprint cs/9906028",
        "pub_date": "1999/6/26",
        "description": "In the early 1980s, Selman's seminal work on positive Turing reductions showed that positive Turing reduction to NP yields no greater computational power than NP itself. Thus, positive Turing and Turing reducibility to NP differ sharply unless the polynomial hierarchy collapses. We show that the situation is quite different for DP, the next level of the boolean hierarchy. In particular, positive Turing reduction to DP already yields all (and only) sets Turing reducibility to NP. Thus, positive Turing and Turing reducibility to DP yield the same class. Additionally, we show that an even weaker class, P(NP[1]), can be substituted for DP in this context.",
        "citations": 1
    },
    {
        "title": "Extending Downward Collapse from 1-versus-2 Queries to j-versus-j + 1 Queries",
        "id": "Z9W_SPAAAAAJ:e5wmG9Sq2KIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:e5wmG9Sq2KIC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "Annual Symposium on Theoretical Aspects of Computer Science",
        "pub_date": "1999/3/4",
        "description": "The above figure shows some classes from the boolean and (truth-table) bounded-query hierarchies. It is well-known that if either collapses at a given level, then all higher levels collapse to that same level. This is a standard “upward translation of equality” that has been known for over a decade. The issue of whether these hierarchies can translate equality downwards has proven vastly more challenging. In particular, with regard to the figure above, consider the following claim: $$ P_{m - tt}^{\\sum _k^p }  = P_{m + 1 - tt}^{\\sum _k^p }  \\Rightarrow DIFF_m (\\sum _k^p ) = coDIFF_m (\\sum _k^p ) = BH(\\sum _k^p ).(**) $$  This claim, if true, says that equality translates downwards between levels of the bounded-query hierarchy and the boolean hierarchy levels that (before the fact) are immediately below them. Until recently, it was not known whether (**) ever held, except in the trivial m = 0 case. Then …",
        "citations": 4
    },
    {
        "title": "What's up with downward collapse: Using the easy-hard technique to link boolean and polynomial hierarchy collapses",
        "id": "Z9W_SPAAAAAJ:LkGwnXOMwfcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:LkGwnXOMwfcC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "ACM SIGACT News 29 (3), 10-22",
        "pub_date": "1998/9/1",
        "description": "During the past decade, nine papers have obtained increasingly strong consequences from the assumption that boolean or bounded-query hierarchies collapse. The final four papers of this nine-paper progression actually achieve downward collapse---that is, they show that high-level collapses induce collapses at (what before-the-fact seemed to be) lower complexity levels. For example, for each k ≥ 2 it. is now known that if one query to σpk is as powerful as two queries to σpk (i.e., PΣ[1] = PΣ[2]), then PH = σpk. This article surveys the history, the results, and the method---the so-called easy-hard technique---of the just-mentioned nine-paper progression:1. J. Kadin. The polynomial time hierarchy collapses if the boolean hierarchy collapses. SIAM Journal on Computing, 17(6):1263--1282, 1988. Erratum appears in the same journal. 20(2):404.2. K. Wagner. Number-of-query hierarchies. Technical Report 158, Institut …",
        "citations": 30
    },
    {
        "title": "Recognizing when greed can approximate maximum independent sets is complete for parallel access to NP",
        "id": "Z9W_SPAAAAAJ:MXK_kJrjxJIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:MXK_kJrjxJIC",
        "authors": [
            "Edith Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Information Processing Letters",
        "pub_date": "1998/2/13",
        "description": "Bodlaender, Thilikos, and Yamazaki (1997) investigate the computational complexity of the problem of whether the Minimum Degree Greedy Algorithm can approximate a maximum independent set of a graph within a constant factor of r, for fixed rational r ⩾ 1. They denote this problem by Sr and prove that for each rational r ⩾ 1, Sr is coNP-hard. They also provide a PNP upper bound of Sr, leaving open the question of whether this gap between the upper and the lower bound of Sr can be closed. For the special case of r = 1, they show that S1 is even DP-hard, again leaving open the question of whether S1 can be shown to be complete for DP or some larger class such as PNP. In this note, we completely solve all the questions left open by Bodlaender et al. Our main result is that for each rational r ⩾ 1, Sr is complete for P∥NP, the class of sets solvable via parallel access to NP.",
        "citations": 32
    },
    {
        "title": "Downward collapse from a weaker hypothesis",
        "id": "Z9W_SPAAAAAJ:RHpTSmoSYBkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:RHpTSmoSYBkC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "Proceedings of the 6th Italian Conference on Theoretical Computer Science",
        "pub_date": "1998",
        "description": "Hemaspaandra et al.[1] proved that, for m> 0 and 0< i< k-1: if L: f aDIFF m (L: i) is closed under complementation, then DIFF m (L: D= coD IFF m (L: i). This sharply asymmetric result fails to apply to the case in which the hypothesis is weakened by allowing the L: f to be replaced by any class in its difference hierarchy. We so extend the result by proving that, for s, m> 0 and 0< i< k-1: if DIFF s (L: f) aDIFF m (L: i) is closed under complementation, then DIFFm (L: D= cODIFFm (L: i).",
        "citations": 5
    },
    {
        "title": "A downward collapse within the polynomial hierarchy",
        "id": "Z9W_SPAAAAAJ:eQOLeE2rZwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:eQOLeE2rZwMC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "SIAM Journal on Computing",
        "pub_date": "1998",
        "description": "Downward collapse (also known as upward separation) refers to cases where the equality of two larger classes implies the equality of two smaller classes. We provide an unqualified downward collapse result completely within the polynomial hierarchy. In particular, we prove that, for k > 2, if  then . We extend this to obtain a more general downward collapse result.",
        "citations": 39
    },
    {
        "title": "Exact analysis of Dodgson elections: Lewis Carroll's 1876 voting system is complete for parallel access to NP",
        "id": "Z9W_SPAAAAAJ:u5HHmVD_uO8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:u5HHmVD_uO8C",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "Journal of the ACM (JACM)",
        "pub_date": "1997/11/1",
        "description": "In 1876, Lewis Carroll proposed a voting system in which the winner is the candidate who with the fewest changes in voters' preferences becomes a Condorcet winner—a candidate who beats all other candidates in pairwise majority-rule elections. Bartholdi, Tovey, and Trick provided a lower bound—NP-hardness—on the computational complexity of determining the election winner in Carroll's system. We provide a stronger lower bound and an upper bound that matches our lower bound. In particular, determining the winner in Carroll's system is complete for parallel access to NP, that is, it is complete for Theta_2p for which it becomes the most natural complete problem known. It follows that determining the winner in      Carroll's elections is not NP-complete unless the polynomial hierarchy collapses.",
        "citations": 247
    },
    {
        "title": "The minimization problem for Boolean formulas",
        "id": "Z9W_SPAAAAAJ:WF5omc3nYNoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:WF5omc3nYNoC",
        "authors": [
            "Edith Hemaspaandra",
            "Gerd Wechsung"
        ],
        "pub_source": "Proceedings 38th Annual Symposium on Foundations of Computer Science",
        "pub_date": "1997/10/20",
        "description": "We investigate the computational complexity of the minimization problem for Boolean formulas. Depending on the definition, these problems are trivially in /spl Sigma//sub 2//sup P/ or II/sub 2//sup P/, and these are the best upper bounds known. The only previously known lower bounds are also trivial, and are coNP lower bounds at best, thus leaving quite a large gap between the upper and lower bounds. In this paper, we prove much better lower bounds: hardness for parallel access to NP for those cases in which coNP was the best previously known lower bound, and coNP-hardness for the case in which no lower bound was previously known.",
        "citations": 37
    },
    {
        "title": "Query order in the polynomial hierarchy",
        "id": "Z9W_SPAAAAAJ:-f6ydRqryjwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:-f6ydRqryjwC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "International Symposium on Fundamentals of Computation Theory",
        "pub_date": "1997/9/1",
        "description": "The study of query order was initiated by Hemaspaandra, Hempel, and Wechsung [HHW]. Their goal was to learn whether the order of access to information sources affects the class of problems that can be solved. They showed that in the boolean hierarchy over NP, order matters. In the present paper, we study the power of query order when accessing levels of the polynomial hierarchy, and we show that here order does not matter. In particular, let PC:D denote the class of languages computable by a polynomial-time machine that is allowed one query to C followed by one query to D [HHW]. We prove that the levels of the polynomial hierarchy are order-oblivious:   Yet, we also show that these ordered query classes form new levels in the polynomial hierarchy unless the polynomial hierarchy collapses. We prove that a wide range of other classes (UP, BPP, ⊕P, PP, etc.) inherit all order …",
        "citations": 7
    },
    {
        "title": "Raising NP lower bounds to parallel NP lower bounds",
        "id": "Z9W_SPAAAAAJ:kNdYIx-mwKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:kNdYIx-mwKoC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Jörg Rothe"
        ],
        "pub_source": "ACM SIGACT News 28 (2), 2-13",
        "pub_date": "1997/6/1",
        "description": "This issue's column surveys recent progress in raising NP-hardness lower bounds to parallel NP lower bounds. Complexity theorists will learn that Lewis Carroll (unbeknownst to himself) was a fellow complexity theorist. So that readers specializing in algorithms don't feel left out, let me mention that they are in even better company. Algorithms for apportioning the US House of Representatives were designed and debated by Adam, Hamilton, Jefferson, Webster, and other famous figures from American history, as recounted in a page-turner by Balinski and Young ([BY82]; see also [BY85] for a shorter take and [HRSZ96] for a more explicitly computational spin). Looking forward, the next issue's column will be a survey, by Mitsunori Ogihara, of DNA-based computing.",
        "citations": 41
    },
    {
        "title": "A downward translation in the polynomial hierarchy",
        "id": "Z9W_SPAAAAAJ:8k81kl-MbHgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:8k81kl-MbHgC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "Annual Symposium on Theoretical Aspects of Computer Science",
        "pub_date": "1997/2/27",
        "description": "Downward translation (a.k.a. upward separation) refers to cases where the equality of two larger classes implies the equality of two smaller classes. We provide the first unqualified downward translation result completely within the polynomial hierarchy. In particular, we prove that, for k>2,    where the “[1]” (respectively, “[2]”) denotes that at most one query is (respectively, two queries are) allowed. We also extend this to obtain a more general downward translation result.",
        "citations": 22
    },
    {
        "title": "NY 14627, USA.",
        "id": "Z9W_SPAAAAAJ:gsN89kCJA0AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:gsN89kCJA0AC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "Fundamentals of Computation Theory: Proceedings",
        "pub_date": "1997",
        "description": "The study of query order was initiated by Hemaspaandra, Hempel, and Wechsung [HHW]. Their goal was to learn whether the order of access to information sources affects the class of problems that can be solved. They showed that in the boolean hierarchy over NP, order matters. In the present paper, we study the power of query order when accessing levels of the polynomial hierarchy, and we show that here order does not matter. In particular, let PC: D denote the class of languages computable by a polynomial-time machine that is allowed one query to C followed by one query to D [HHW]. We prove that the levels of the polynomial hierarchy are order-oblivious: P²= p²Yet, we also show that these ordered query classes form new levels in the polynomial hierarchy unless the polynomial hierarchy collapses. We prove that a wide range of other classes (UP, BPP, OP, PP, etc.) inherit all order-obliviousness results that hold for deterministic polynomialtime transducers."
    },
    {
        "title": "Hierarchy",
        "id": "Z9W_SPAAAAAJ:j8SEvjWlNXcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:j8SEvjWlNXcC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "STACS 97: 14th Annual Symposium on Theoretical Aspects of Computer Science, Lübeck, Germany, February 27-March 1, 1997: Proceedings",
        "pub_date": "1997",
        "description": "Downward translation (aka upward separation) refers to cases where the equality of two larger classes implies the equality of two smaller classes. We provide the first unqualified downward translation result completely within the polynomial hierarchy. In particular, we prove that, for k> 2, where the\"[!]\"(respectively,\"[2]\") denotes that at most one query is (respectively, two queries are) allowed. We also extend this to obtain a more general downward translation result."
    },
    {
        "title": "R               1−tt   SN              (NP) distinguishes robust many-one and Turing completeness",
        "id": "Z9W_SPAAAAAJ:9ZlFYXVOiuMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:9ZlFYXVOiuMC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "Algorithms and Complexity: Third Italian Conference, CIAC'97 Rome, Italy, March 12–14, 1997 Proceedings 3",
        "pub_date": "1997",
        "description": "Do complexity classes have many-one complete sets if and only if they have Turing-complete sets? We prove that there is a relativized world in which a relatively natural complexity class—namely a downward closure of NP, R                 1−tt   SN                (NP)—has Turing-complete sets but has no many-one complete sets. In fact, we show that in the same relativized world this class has 2-truth-table complete sets but lacks 1-truth-table complete sets. As part of the groundwork for our result, we prove that R                 1−tt   SN                (NP) has many equivalent forms having to do with ordered and parallel access to NP and NP ∩ coNP.",
        "citations": 13
    },
    {
        "title": "P-selective sets and reducing search to decision vs self-reducibility",
        "id": "Z9W_SPAAAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:qjMakFHDy7sC",
        "authors": [
            "Edith Hemaspaandra",
            "Ashish V Naik",
            "Mitsunori Ogihara",
            "Alan L Selman"
        ],
        "pub_source": "Journal of Computer and System Sciences",
        "pub_date": "1996/10/1",
        "description": "We distinguish self-reducibility of a languageLwith the question of whether search reduces to decision forL. Results include: (i) If NE≠E, then there exists a setLin NP−P such that search reduces to decision forL, search doesnotnonadaptively reduce to decision forLandLis not self-reducible. (ii) If UE≠E, then there exists a languageL∈UP−P such that search nonadaptively reduces to decision for L, but L is not self-reducible. (iii) If UE∩co-UE≠E, then there is a disjunctive self-reducible languageL∈UP−P for which search doesnotnonadaptively reduce to decision. We prove that if NE⊈BPE, then there is a languageL∈NP−BPP such thatLis randomly self-reducible,notnonadaptively randomly self-reducible, andnotself-reducible. We obtain results concerning trade-offs in multiprover interactive proof systems and results that distinguish checkable languages from those that are nonadaptively checkable. Many of our …",
        "citations": 75
    },
    {
        "title": "The price of universality",
        "id": "Z9W_SPAAAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:9yKSN-GCB0IC",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "Notre Dame Journal of Formal Logic",
        "pub_date": "1996/4",
        "description": "We investigate the effect on the complexity of adding the universal modality and the reflexive transitive closure modality to modal logics. From the examples in the literature, one might conjecture that adding the reflexive transitive closure modality is at least as hard as adding the universal modality, and that adding either of these modalities to a multi-modal logic where the modalities do not interact can only increase the complexity to EXPTIME-complete. We show that the first conjecture holds under reasonable assumptions and that, except for a number of special cases which we fully characterize, the hardness part of the second conjecture is true. However, the upper bound part of the second conjecture fails miserably: we show that there exists a uni-modal, decidable, finitely axiomatizable, and canonical logic for which adding the universal modality causes undecidability and for which adding the reflexive transitive …",
        "citations": 100
    },
    {
        "title": "R^{SN} _ {1-tt}(NP) Distinguishes Robust Many-One and Turing Completeness",
        "id": "Z9W_SPAAAAAJ:vbGhcppDl1QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:vbGhcppDl1QC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "",
        "pub_date": "1996",
        "description": "Do complexity classes have many-one complete sets if and only if they have Turing-complete sets? We prove that there is a relativized world in which a relatively natural complexity class---namely a downward closure of NP, R^{SN} _ {1-tt}(NP)---has Turing-complete sets but has no many-one complete sets. In fact, we show that in the same relativized world this class has 2-truth-table complete sets but lacks 1-truth-table complete sets. As part of the groundwork for our result, we prove that R^{SN} _ {1-tt}(NP) has many equivalent forms having to do with ordered and parallel access to NP and NP\\cap coNP.",
        "citations": 1
    },
    {
        "title": "An upward separation in the polynomial hierarchy",
        "id": "Z9W_SPAAAAAJ:b0M2c_1WBrUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:b0M2c_1WBrUC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "Friedrich-Schiller-Univ.",
        "pub_date": "1996",
        "citations": 2
    },
    {
        "title": "Census techniques collapse space classes",
        "id": "Z9W_SPAAAAAJ:4JMBOYKVnBMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:4JMBOYKVnBMC",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "Information processing letters",
        "pub_date": "1994/7/26",
        "description": "Recent results have focused the attention of research in structural complexity theory to the development and applications of census techniques. In this paper we will develop several new techniques with which we can show the equality of SPACE(s)NTIME(t) classes in the sense of Ladner and Lynch (1976) to known classes.",
        "citations": 5
    },
    {
        "title": "Complexity transfer for modal logic",
        "id": "Z9W_SPAAAAAJ:_FxGoFyzp5QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:_FxGoFyzp5QC",
        "authors": [
            "Edith Hemaspaandra"
        ],
        "pub_source": "Proceedings Ninth Annual IEEE Symposium on Logic in Computer Science",
        "pub_date": "1994/7/4",
        "description": "We prove general theorems about the relationship between the complexity of multi-modal logics and the complexity of their uni-modal fragments. Halpern and Moses (1985) show that the complexity of a multi-modal logic without any interaction between the modalities may be higher than the complexity of the individual fragments. We show that under reasonable assumptions the complexity can increase only if the complexity of all the uni-modal fragments is below PSPACE. In addition, we completely characterize what happens if the complexity of all fragments is below PSPACE.< >",
        "citations": 27
    },
    {
        "title": "Quasi-injective reductions",
        "id": "Z9W_SPAAAAAJ:IWHjjKOFINEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:IWHjjKOFINEC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "Theoretical computer science",
        "pub_date": "1994/1/31",
        "description": "A reduction is said to be quasi-injective if no element of the range is mapped to by infinitely many elements. Via two natural families of quasi-injective reductions, we study the connection between degree of injectivity and strength of reduction. In particular, we completely determine the relative strengths of polynomial-time ƒ (n)-to-reductions, and of polynomial-time k-to-k′ reductions.",
        "citations": 8
    },
    {
        "title": "The relative power of logspace and polynomial time reductions",
        "id": "Z9W_SPAAAAAJ:HoB7MX3m0LUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:HoB7MX3m0LUC",
        "authors": [
            "Harry Buhrman",
            "Edith Spaan",
            "Leen Torenvliet"
        ],
        "pub_source": "Computational Complexity",
        "pub_date": "1993/9",
        "description": "There exist many different formalisms to model the notion of resource bounded ‘truth-table’ reduction. Most papers in which truthtable reductions appear refer to the seminal paper of Ladner, Lynch and Selman for a definition. The definition of truth-table reductions given there however, pertains to only one of the possible incarnations of the notion. For larger resource bounds, this definition often coincides with other-often implicitly used-definitions of the notion. In this paper we focus our attention on resource bounds for which the various definitions probably donot pertain to the same notion. In particular, we show that coincidence of different notions implies coincidence of complexity classes likeNC 1,LOG, andP, which are widely believed to be different.",
        "citations": 18
    },
    {
        "title": "A modal perspective on the computational complexity of attribute value grammar",
        "id": "Z9W_SPAAAAAJ:70eg2SAEIzsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:70eg2SAEIzsC",
        "authors": [
            "Patrick Blackburn",
            "Edith Spaan"
        ],
        "pub_source": "Journal of Logic, Language and Information",
        "pub_date": "1993/6",
        "description": "Many of the formalisms used in Attribute Value grammar are notational variants of languages of propositional modal logic, and testing whether two Attribute Value Structures unify amounts to testing for modal satisfiability. In this paper we put this observation to work. We study the complexity of the satisfiability problem for nine modal languages which mirror different aspects of AVS description formalisms, including the ability to express re-entrancy, the ability to express generalisations, and the ability to express recursive constraints. Two main techniques are used: either Kripke models with desirable properties are constructed, or modalities are used to simulate fragments of Propositional Dynamic Logic. Further possibilities for the application of modal logic in computational linguistics are noted.",
        "citations": 110
    },
    {
        "title": "SPARSE reduces conjunctively to TALLY",
        "id": "Z9W_SPAAAAAJ:ldfaerwXgEUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ldfaerwXgEUC",
        "authors": [
            "Harry Buhrman",
            "Luc Longpre",
            "Edith Spaan"
        ],
        "pub_source": "[1993] Proceedings of the Eigth Annual Structure in Complexity Theory Conference",
        "pub_date": "1993/5/18",
        "description": "Polynomials over finite fields are used to conjunctively reduce any sparse set to a tally set. This leads to the derivation of new results and to new simple proofs of known results about various classes that lie between P and P/poly.< >",
        "citations": 54
    },
    {
        "title": "Decidability and undecidability in stand-alone feature logics",
        "id": "Z9W_SPAAAAAJ:D03iK_w7-QYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:D03iK_w7-QYC",
        "authors": [
            "Patrick Blackburn",
            "Edith Spaan"
        ],
        "pub_source": "Sixth Conference of the European Chapter of the Association for Computational Linguistics",
        "pub_date": "1993/4",
        "description": "This paper investigates the complexity of the satisfiability problem for feature logics strong enough to code entire grammars unaided. We show that feature logics capable of both enforcing re-entrancy and stating linguistic generalisations will have undecidable satisfiability problems even when most Boolean expressivity has been discarded. We exhibit a decidable fragment, but the restrictions imposed to ensure decidability render it unfit for stand-alone use. The import of these results is discussed, and we conclude that there is a need for feature logics that are less homogeneous in their treatment of linguistic structure.",
        "citations": 7
    },
    {
        "title": "The complexity of propositional tense logics",
        "id": "Z9W_SPAAAAAJ:2P1L_qKh6hAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:2P1L_qKh6hAC",
        "authors": [
            "Edith Spaan"
        ],
        "pub_source": "SYNTHESE LIBRARY",
        "pub_date": "1993",
        "description": "In [4], Ladner investigated the complexity of the provability problems for modal logics. In particular, he showed that provability in all modal logics between K and 84 is PSPACE-hard, and he constructed polynomial space bounded algorithms for deciding provability in K, T, and 84, which implies that the provability problems for these logics are PSPACE-complete. In this paper, we investigate to what extent these results go through for tense logics. Note that any lower bound for provability in a modal logic 8 carries over to the corresponding tense logic 8t. In particular, it follows that for any modal logic 8 between K and 84, the provability problem for the tense logic 8t is PSPACE-hard. However, it is by no means obvious that the upper bounds for modal logics carryover to the corresponding tense logics. Given two logics that have provability problems in PSPACE, it is in general not the case that provability for a combination …",
        "citations": 44
    },
    {
        "title": "Complexity of modal logics",
        "id": "Z9W_SPAAAAAJ:35N4QoGY0k4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:35N4QoGY0k4C",
        "authors": [
            "Edith Spaan"
        ],
        "pub_source": "",
        "pub_date": "1993",
        "citations": 327
    },
    {
        "title": "On the Complexity of Attribute Value Logics",
        "id": "Z9W_SPAAAAAJ:_xSYboBqXhAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:_xSYboBqXhAC",
        "authors": [
            "P Blackburn",
            "E Spaan"
        ],
        "pub_source": "Proceedings of the Eighth Amsterdam Colloquium",
        "pub_date": "1991",
        "citations": 6
    },
    {
        "title": "Census Techniques on Relativized Space Classes",
        "id": "Z9W_SPAAAAAJ:rO6llkc54NcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:rO6llkc54NcC",
        "authors": [
            "Edith Spaan"
        ],
        "pub_source": "Institute for Language, Logic and Information, University of Amsterdam",
        "pub_date": "1991/1/1",
        "description": "Recent results ([2],[4],[3],[8], have focused the attention of research in struc-tural complexity theory to the development and applications of census techniques. In this paper we will develop several new techniques with which we can show the equality of SPACE (s) NTIME (t) classes in the sense of Ladner and Lynch [5] to known classes."
    },
    {
        "title": "Quasi-injective reductions",
        "id": "Z9W_SPAAAAAJ:3s1wT3WcHBgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:3s1wT3WcHBgC",
        "authors": [
            "Lane A Hemachandra",
            "Edith Spaan"
        ],
        "pub_source": "",
        "pub_date": "1991/1/1",
        "description": "QUASI-INJECTIVE REDUCTIONS Page 1 Institute for Language, Logic and Information \nQUASI-INJECTIVE REDUCTIONS Lane A. Hemachandra Edith Spaan ITLI Prepublication \nSeries for Computation and Complexity Theory CT-91-11 University of Amsterdam 33 | 23 33 \nPage 2 The ITLI Prepublication Series 1986 86-() 1 The Institute of Language, Logic and \nInformation 86-02 Peter van Emdc Boas A Semantical Model for Integration and Modularization \nof Rules 86-03 Johan van Benthcm Categorial Grammar and Lambda Calculus A Relational \nFormulation of the Theory of Types 86-05 Kenneth A. Bowen, Dick dc Jongh Some Complete \nLogics for Branchcd Time, Part I _Well-founded Time, 86-Q6 Johan van Benthem Logical \nSyntax Forward looking Operators 9 87-01 Jeroen Grocnendijk, Martin Stokhof Type shifting \nRules and the Semantics of Interrogatives 87-02 Renate Bartsch Frame Representations and …",
        "citations": 1
    },
    {
        "title": "Query optimization using rewrite rules",
        "id": "Z9W_SPAAAAAJ:SeFeTyx0c_EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:SeFeTyx0c_EC",
        "authors": [
            "Sieger van Denneheuvel",
            "Karen Kwast",
            "Gerard R Renardel de Lavalette",
            "Edith Spaan"
        ],
        "pub_source": "Rewriting Techniques and Applications: 4th International Conference, RTA-91 Como, Italy, April 10–12, 1991 Proceedings 4",
        "pub_date": "1991",
        "description": "In literature on query optimization the normal form for relational algebra expressions consisting of Projection, Selection and Join, is well known. In this paper we extend this normal form with Calculation and Union and define a corresponding language UPCSJL. In addition we show how the normal form can be used for query optimization.",
        "citations": 8
    },
    {
        "title": "Bounded reductions",
        "id": "Z9W_SPAAAAAJ:M05iB0D1s5AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:M05iB0D1s5AC",
        "authors": [
            "Harry Buhrman",
            "Edith Spaan",
            "Leen Torenvliet"
        ],
        "pub_source": "STACS 91: 8th Annual Symposium on Theoretical Aspects of Computer Science Hamburg, Germany, February 14–16, 1991 Proceedings 8",
        "pub_date": "1991",
        "description": "We study properties of resource— and otherwise bounded reductions and corresponding completeness notions on nondeterministic time classes which contain exponential time. As it turns out most of these reductions can be separated in the sense that their corresponding completeness notions are different. There is one notable exception. On nondeterministic exponential time 1-truth table and many-one completeness is the same notion.",
        "citations": 31
    },
    {
        "title": "Nexttime is not necessary",
        "id": "Z9W_SPAAAAAJ:g5m5HwL7SMYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:g5m5HwL7SMYC",
        "authors": [
            "Edith Spaan"
        ],
        "pub_source": "Proceedings of the 3rd Conference on Theoretical Aspects of Reasoning about Knowledge",
        "pub_date": "1990/3/4",
        "description": "We investigate the propositional modal logic of knowledge and time for distributed systems. Previous results by Halpern and Vardi [HV89] and Ladner and Reif [LR] illustrate that the validity problems for a number of these logics are highly intractable; in particular they prove a number of II~-completeness results. The logics considered by the above authors contain at least two out of the three temporal logic operators:~ sometimes, gnexttime, and auntil~. Although their proofs rely heavily on either the anexttime or the~ until operator, we show that the completeness results remain valid if we restrict the temporal operators to asometimes.",
        "citations": 18
    },
    {
        "title": "On adaptive resource bounded computations",
        "id": "Z9W_SPAAAAAJ:ZHo1McVdvXMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:ZHo1McVdvXMC",
        "authors": [
            "Harry Buhrman",
            "Edith Spaan",
            "Leen Torenvliet"
        ],
        "pub_source": "Universiteit van Amsterdam. Instituut voor Taal, Logica en Informatie [ITLI]",
        "pub_date": "1989/1/1",
        "description": "We investigate differences in computational power of logspace bounded adaptive and non-adaptive oracle machines. Our main results are that for any two sets A and B if A_< _TB via a logarithmic space bounded machine then A_< _ “B via a log2 space bounded machine. Under the very strong assumption that N C1 9E LOG/poly we demonstrate a difference between the two investigated reductions. We show that there exist recursive sets A and",
        "citations": 2
    },
    {
        "title": "Nondeterminism, fairness and a fundamental analogy",
        "id": "Z9W_SPAAAAAJ:pqnbT2bcN3wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:pqnbT2bcN3wC",
        "authors": [
            "Edith Spaan",
            "Leen Torenvliet",
            "Peter van Emde Boas"
        ],
        "pub_source": "",
        "pub_date": "1988/1/1",
        "description": "In this note we propose a model for unbounded nondeterministic computation which pro-vides a very natural basis for the structural analogy between recursive function theory and computational complexity theory: P: NP-REC: RE At the same time this model presents an alternative version of the halting problem which has been known for a decade to be highly intractable. also CWI-AP6, Amsterdam",
        "citations": 25
    },
    {
        "title": "Using Complexity to Protect Elections Computational complexity may truly be the shield against election manipulation.",
        "id": "Z9W_SPAAAAAJ:LI9QrySNdTsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:LI9QrySNdTsC",
        "authors": [
            "Piotr Faliszewski",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "For thousands of years, people—and more recently, electronic agents—have been conducting elections. And surely for just as long, people—or more recently, electronic agents—have been trying to affect the outcomes of those elections. Such attempts take many forms. often and naturally, actors may seek to change the structure of the election, for example, by attracting new voters, suppressing turnout, recruiting candidates, or setting election district boundaries. Sometimes voters may even be bribed to vote a certain way. And a voter may try to manipulate an election by casting an insincere vote that may yield a more favorable outcome than would the voter’s sincere vote: Not all people who preferred Ralph Nader in the 2004 US presidential election actually voted for him.One might hope that by choosing a particularly wonderful election system, one can perfectly block such attacks. However, classic work from economics and political science proves that every reasonable election system sometimes gives voters an incentive to vote insincerely (see Duggan 17 and the references therein). Reasonable election systems cannot make manipulation impossible. However, they can make manipulation computationally infeasible."
    },
    {
        "title": "Controlling Elections",
        "id": "Z9W_SPAAAAAJ:t6usbXjVLHcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:t6usbXjVLHcC",
        "authors": [
            "Zack Fitzsimmons",
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Presentación de PowerPoint Page 1 Control in the Presence of Manipulators: Cooperative and \nCompetitive Cases Zack Fitzsimmons,1 Edith Hemaspaandra,1 and Lane A. Hemaspaandra2 \n1Rochester Institute of Technology, USA. 2University of Rochester, USA. Motivation \nManipulation and control attacks on elections have, separately, been extensively studied. But in \nthe real world, both types of attacks may occur together, collaboratively or competitively. \nUpper-Bound Results Unweighted-Election Results Weighted-Election Results Controlling \nElections The “Chair” Doing the Control Action May • Collaborate with the Manipulators. • The \nelection chair and the manipulators have the same preferred (or despised) candidate. • Compete \nwith the Manipulators. We Study Two Cases: • CF: The election chair acts first. • MF: The \nmanipulators act first. Who goes first, the chair or the manipulators, can have an effect on the …"
    },
    {
        "title": "The Shield that Never Was",
        "id": "Z9W_SPAAAAAJ:XiVPGOgt02cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:XiVPGOgt02cC",
        "authors": [
            "Piotr Faliszewski",
            "Jörg Rothe",
            "Lane A Hemaspaandra",
            "Edith Hemaspaandra"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The Shield that Never Was: Societies with Single-Peaked Preferences are More Open to \nManipulation and Control Page 1 The Shield that Never Was: Societies with Single-Peaked \nPreferences are More Open to Manipulation and Control Piotr Faliszewski AGH University of \nScience and Technology Jörg Rothe Heinrich-Heine-Universität Düsseldorf Lane A. \nHemaspaandra University of Rochester Edith Hemaspaandra Rochester Institute of Technology \nUniversity of Rochester, February 16, 2015 Page 2 Outline □ Introduction ∎ Elections and \nSingle-Peaked Preferences. Thanks Toby! ∎ Control and Manipulation □ Overview of Results \n∎ Control: Single-Peakedness Removing NP-Hardness Shields ∎ Manipulation: Single-Peaked \nPreferences □ Removing NP-Hardness Shields □ Leaving them in Place □ Erecting them \n□ Giving a Dichotomy for 3-Candidate Scoring Protocols □ A Sample Proof Sketch ∎ Single-…"
    },
    {
        "title": "QUASI-INJECTIVE REDUCTIONS",
        "id": "Z9W_SPAAAAAJ:08ZZubdj9fEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:08ZZubdj9fEC",
        "authors": [
            "Edith Spaan"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "A many-one reduction may, in general, map inﬁnitely many domain elements to the same range element. A one-to-one reduction (often referred to as an injective reduction) maps at most one domain element to a given element of the co-domain. In some settings, these different degrees of injectivity coincide; a famous example is provided by the Myhill Isomorphism Theorem (see, eg,[S0a87]), which implies that all sets § ,,,-complete for the"
    },
    {
        "title": "SPARSE REDUCES CONJUNCTIVELY TO TALLY* HARRY BUHRMANt, EDITH HEMASPAANDRA1, AND LUC LONGPRÉ5",
        "id": "Z9W_SPAAAAAJ:NaGl4SEjCO4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:NaGl4SEjCO4C",
        "authors": [
            "HARRY BUHRMAN",
            "EDITH HEMASPAANDRA",
            "LUC LONGPRÉ"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Polynomials over finite fields are used to show that any sparse set can conjunctively reduce to a tally set. This leads to new results and to simple proofs of known results about various classes that lie between P and P/poly."
    },
    {
        "title": "The Computational Complexity Column",
        "id": "Z9W_SPAAAAAJ:YFjsv_pBGBYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=Z9W_SPAAAAAJ:YFjsv_pBGBYC",
        "authors": [
            "Edith Hemaspaandra",
            "Lane A Hemaspaandra",
            "Harald Hempel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Hemaspaandra, Hempel, and Wechsung HHW95] raised the following questions: If one is allowed one question to each of two di erent information sources, does the order in which one asks the questions a ect the class of problems that one can solve with the given access? If so, which order yields the greater computational power? The answers to these questions have been learned| inasfar as they can be learned without resolving whether or not the polynomial hierarchy"
    }
]