[
    {
        "title": "Achieving diversity in AI-focused graduate research traineeships",
        "id": "gTRDElAAAAAJ:0KyAp5RtaNEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:0KyAp5RtaNEC",
        "authors": [
            "Cecilia O Alm",
            "Esa Rantanen",
            "Kristen Shinohara",
            "Ferat Sahin",
            "Chelsea BaileyShea",
            "Reynold Bailey"
        ],
        "pub_source": "Proceedings of the 55th ACM Technical Symposium on Computer Science Education V. 2",
        "pub_date": "2024/3/14",
        "description": "Our AI-focused traineeships for graduate students integrate research and education components to contribute to diversifying the AI research workforce. We describe the program and introduce multiple strategies to achieve interdisciplinarity, diversity, equity, inclusion, and accessibility. Early evaluation results are included.",
        "citations": 1
    },
    {
        "title": "Measuring Temporal Awareness for Human-Aware AI",
        "id": "gTRDElAAAAAJ:z_wVstp3MssC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:z_wVstp3MssC",
        "authors": [
            "Margaret A Gray",
            "Zhuorui Yong",
            "Abhijan Wasti",
            "Esa M Rantanen",
            "Jamison R Heard"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2023/9",
        "description": "This research investigated human performance in response to task demands that may be used to convey information about the human to an artificial agent. We performed an experiment with a dynamic time-sharing task to investigate participants development of temporal awareness of the task event unfolding in time. Temporal awareness as an extension, or a special case, of situation awareness, may provide for useful measures of covert mental models applicable to numerous tasks and for input to human-aware AI agents. Temporal awareness measures may be used to classify human performance into the control modes in the contextual control model (COCOM): scrambled, opportunistic, tactical, and strategic. Twenty-one participants participated in a withinsubjects experiment with an abstract task of resetting four independent timers within their respective windows of opportunity. The results show that temporal …"
    },
    {
        "title": "Rapid development of a hospital checklist in a time of COVID-19",
        "id": "gTRDElAAAAAJ:hkOj_22Ku90C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:hkOj_22Ku90C",
        "authors": [
            "Gavan Lintern",
            "Al Motavalli",
            "Zarrin Chua",
            "Esa M Rantanen",
            "S Camille Peres",
            "Daniel Boorman"
        ],
        "pub_source": "Ergonomics in Design",
        "pub_date": "2022/10",
        "description": "The discipline of human factors and ergonomics is largely focused on principled development of generalizable solutions. The process is typically slow, spanning months, even years. A crisis such as the COVID-19 pandemic presents a different problem. How can human factors and ergonomics professionals react quickly, within hours or days, to provide viable solutions to unanticipated problems as they become apparent? Here we report on a small project in which we were able to respond rapidly to an emergent COVID-19 requirement. Given time constraints, we had no opportunity to follow a systematic analysis and design strategy. Our development and testing strategies reveal lessons that can be applied more generally to development of human factors and ergonomics interventions within emerging crises.",
        "citations": 1
    },
    {
        "title": "Cognitive Engineering Modeling of Phishing",
        "id": "gTRDElAAAAAJ:fEOibwPWpKIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:fEOibwPWpKIC",
        "authors": [
            "Tiffani Bragg",
            "Esa M Rantanen",
            "Justin M Pelletier",
            "Ehsan Rashedi"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2022/9",
        "description": "Using signal detection theory (SDT) and fuzzy SDT, the influence of familiarity with phishing and having a background in cybersecurity on phishing behavior was examined. The results from SDT analysis indicated that familiarity with phishing only accounted for 11% of the variance in sensitivity and 5% in bias. When examining the same using Fuzzy SDT, familiarity with phishing accounted for 6% of the variance in bias. Background in cybersecurity had a statistically significant effect on sensitivity and bias in classical SDT but only on bias in fuzzy SDT. A confusion matrix revealed that the percentage of successfully transmitted information from the stimuli to the judgements made by participants was only 26%. Participants most frequently identified requests for personal information in stimulus emails as phishing cues. Future research should continue to explore application of the different cognitive engineering models to …"
    },
    {
        "title": "Machine Learning in Healthcare: Two Case Studies",
        "id": "gTRDElAAAAAJ:-_dYPAW6P2MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:-_dYPAW6P2MC",
        "authors": [
            "Rachael Kang",
            "Esa M Rantanen",
            "Eric A Youngstrom"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2022/9",
        "description": "Machine learning (ML) is making significant inroads into the field of medicine. It can be used as a preventative measure by predicting a patient’s diagnosis and introducing early treatment to prevent adverse outcomes or lessen their impact. However, despite many demonstrated advantages of machine learning tools in health-care, their performance assessment remains partial at best. In particular, human interactions with machine learning tools in clinical settings remain poorly researched. This review examined machine learning tools in two important areas, sepsis diagnosis and suicide prediction. However, our exploration into the use of machine learning in sepsis and suicide prediction turned up no thorough human factors analyses of provider interactions with their machine learning tools, suggesting a critical research gap waiting to be filled.",
        "citations": 1
    },
    {
        "title": "Attention control in a demanding dynamic time-sharing environment: An eye-tracking study",
        "id": "gTRDElAAAAAJ:_Ybze24A_UAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:_Ybze24A_UAC",
        "authors": [
            "Jaakko Kulomäki",
            "Lauri Oksama",
            "Esa Rantanen",
            "Jukka Hyönä"
        ],
        "pub_source": "Attention, Perception, & Psychophysics",
        "pub_date": "2022/2/1",
        "description": "In this study, we examined different models of cognitive control in dynamic time-sharing situations. We investigated attentional allocation by registering participants’ eye movements while they performed a new time-sharing task that forced them to solve resource conflicts between subtasks through prioritization. Participants were monitoring four subtasks each requiring different amounts of visual attention and response frequencies. Participants’ attention allocation was operationalized in terms of the time spent dwelling on subtasks, the rate they visually sampled the tasks, and the duration of dwells. Additionally, the accuracy of responses and efficiency of time-sharing were estimated. In Experiment 1, we studied adaptation to a time-sharing environment in which priority order of the subtasks was kept constant from trial to trial. We found that the participants sampled the most important subtasks more frequently …",
        "citations": 7
    },
    {
        "title": "1442 December 2022-Human Factors",
        "id": "gTRDElAAAAAJ:uc_IGeMz5qoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:uc_IGeMz5qoC",
        "authors": [
            "Husam Muslim",
            "Eric Muth",
            "Jeff Muttart",
            "Eva Naddoz",
            "Kai Nestler",
            "David O’Hare",
            "Elizabeth O’Neill",
            "Tal Oron-Gilad",
            "Fred Oswald",
            "Mati Paasuke",
            "Karanvir Panesar",
            "Jangwoon Park",
            "Woojin Park",
            "Avi Parush",
            "Emily Patterson",
            "Tabitha Peck",
            "Jami Pekkanen",
            "Olivier Pennacchio",
            "Francesca Peressotti",
            "Elizabeth Phillips",
            "Brandon Pitts",
            "Robert Proctor",
            "Prashanth Rajivan",
            "Esa Rantanen",
            "Michael Regan",
            "Adam Reiner",
            "Khalaeb Richardson",
            "Sara Riggs",
            "Shannon Roberts",
            "Yuichi Saito",
            "Andrea Salas",
            "Dario Salvucci",
            "Siby Samuel",
            "Penelope Sanderson",
            "Kelly Satterfield",
            "Juergen Sauer",
            "Mark Schall",
            "Frank Schieber",
            "Wolfgang Schoppek",
            "Bobbie Seppelt",
            "Missie Smith",
            "Tianqi Smith",
            "Stephen Snow",
            "Carolyn Sommerich",
            "Dustin Souders",
            "Anna-Maria Sourelli",
            "Divya Srinivasan",
            "Robert St Amant",
            "Mark St John",
            "Matthew Stainer",
            "Jork Stapel",
            "Ronald Stevens",
            "Leia Stirling",
            "Thomas Stoffregen",
            "Nancy Stone",
            "Thomas Strybel",
            "Ike Stutts",
            "James Szalma",
            "Nathan Tenhundfeld",
            "Eric Teoh",
            "J Gregory Trafton",
            "Pamela Tsang",
            "Oshin Tyagi",
            "Rick Tyrrell",
            "Amalia Vanacore",
            "Holland Vasquez",
            "Rakesh Veerabhadrappa",
            "Vindhya Venkatraman",
            "Kim-Phuong Vu",
            "Manhua Wang",
            "Xueke Wang",
            "Nathan Ward",
            "Bradley Weaver",
            "Séamas Weech",
            "David Weed",
            "Steffen Werner",
            "Christopher Wickens",
            "Douglas Wiegmann",
            "Neal Wiggermann",
            "Michael Wiklund",
            "Jessica Wildman",
            "Glenn Wilson",
            "Michael David Wilson",
            "Benjamin Wolfe",
            "Abigail Wooldridge",
            "Yan Xiao",
            "Kun Xie",
            "Aiping Xiong",
            "Xu Xu",
            "Sarah Yahoodik",
            "Shiyan Yang",
            "X Jessie Yang",
            "Xiao Yang",
            "Wei Yin",
            "Kristie Young",
            "Denny Yu",
            "Yiqi Zhang",
            "Yuchan Zhang"
        ],
        "pub_source": "Human Factors",
        "pub_date": "2022",
        "description": "Abstract The Human Factors and Ergonomics Society is grateful to the following individuals, who performed I Human Factors i manuscript reviews to date.[Extracted from the article]Copyright of Human Factors is the property of Sage Publications Inc. and its content may not be copied or emailed to multiple sites or posted to a listserv without the copyright holder's express written permission. However, users may print, download, or email articles for individual use. This abstract may be abridged. No warranty is given about the accuracy of the copy. Users should refer to the original published version of the material for the full abstract. Copyright applies to all Abstracts."
    },
    {
        "title": "Practitioner-Educator Model for Human Factors/Ergonomics Education",
        "id": "gTRDElAAAAAJ:kzcrU_BdoSEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:kzcrU_BdoSEC",
        "authors": [
            "Keith S Karn",
            "Esa M Rantanen",
            "Russell J Branaghan",
            "Michael F Rayo",
            "Christopher A Sanchez",
            "Heather C Lum"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2021/9",
        "description": "Human factors/ergonomics is an applied discipline. As such, we question whether students are adequately prepared if they are not learning, at least in part, from instructors who have real-world experience applying human factors/ergonomics knowledge to practical design problems. A wide variety of other disciplines such as medicine, the building trades, clinical psychology, military strategy, aviation, and the visual and performing arts have all faced this question and come up with educational approaches that typically include educators who are highly skilled in the practice of the discipline. Terms such as practitioner-scholar and scientist-practitioner, and the apprentice models all reflect this notion of students learning from highly skilled, knowledgeable, and practiced professionals in their disciplines. Is it time for human factors/ergonomics education to adopt such a model?"
    },
    {
        "title": "Student Perspectives on Changing Requirements for Human Factors Engineering Education",
        "id": "gTRDElAAAAAJ:Fu2w8maKXqMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Fu2w8maKXqMC",
        "authors": [
            "Bella Yigong Zhang",
            "Esa M Rantanen",
            "Mark Chignell"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2021/9",
        "description": "In today’s digital economy, the Internet of Things (IoT) has connected devices, humans, and everyday objects to each other in ways that were unimaginable before. Vast amounts of data are collected everywhere and disrupting how we design systems and products. Data science and emerging technologies offer challenges and opportunities for early-career human factors professionals who are looking to grow their careers and their human factors practice. In this paper, we report on a survey to assess the perspectives of students currently studying human factors. The survey items examined shortfalls in current human factors education with re-spect to relevance to industry trends. The survey results show that students see a need to include more relevant subjects in data science, as well as opportunities to learn trending industry problems, hands-on experience with real-life projects, prior to graduation."
    },
    {
        "title": "Ethics Education of Human Factors Engineers for Responsible AI Development",
        "id": "gTRDElAAAAAJ:W5xh706n7nkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:W5xh706n7nkC",
        "authors": [
            "Esa M Rantanen",
            "John D Lee",
            "Katherine Darveau",
            "Dave B Miller",
            "James Intriligator",
            "Ben D Sawyer"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2021/9",
        "description": "This panel discussion is third in a series examining the educational challenges facing future human factors and ergonomics professionals. The past two panels have focused on training of technical skills in data science, machine learning, and artificial intelligence to human factors students. This panel discussion expands on these topics and argues for a need of new and broader training curricula that include ethics for responsible development of AI-based systems that will touch lives of everybody and have widespread societal impacts.",
        "citations": 1
    },
    {
        "title": "Organizational Safety in Airline Operations",
        "id": "gTRDElAAAAAJ:uLbwQdceFCQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:uLbwQdceFCQC",
        "authors": [
            "Esa Rantanen",
            "Erik-Jan Hujibrechts"
        ],
        "pub_source": "80th International Symposium on Aviation Psychology",
        "pub_date": "2021",
        "description": "Organizational accidents is a category of accidents caused by organizational factors. They are rare but have widespread consequences, many defenses and multiple causes, they are associated with judging and deciding, and have a long “history”. Organizational accidents are also associated with highly regulated industries, such as aviation. There are several other constructs related to organizational factors undermining safety. Aviation is unfortunately closely associated with the traditional “Safety I” thinking, where adverse outcomes can be found at the end of causal chain and treating, and preferably eliminating, the causes will increase safety by preventing future accidents. An alternative view is “Safety II”, where the focus is on what goes right rather than on what goes wrong. Safety II is thus defined as the ability to succeed under expected and unexpected conditions alike. Yet another viewpoint is Work-As-Imagined vs. Work-As-Done. In the former case, the focus is on accident and incident investigation and elimination of noncompliance errors (“name, blame, train”). In contrast, the latter perspective does away with both well-defined functions and malfunctions and accepts that performance is variable as a matter of fact and that the same variability can result in both success and failure. Because performance variability allows for adjustment to changing situations, it is the reason why everyday work is safe and effective.",
        "citations": 1
    },
    {
        "title": "The education of the human factors engineer in the age of data science",
        "id": "gTRDElAAAAAJ:UHK10RUVsp4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:UHK10RUVsp4C",
        "authors": [
            "Daniel Hannon",
            "Esa Rantanen",
            "Ben Sawyer",
            "Ashley Hughes",
            "Katherine Darveau",
            "Robert O’Donnell",
            "James Intriligator",
            "John D Lee"
        ],
        "pub_source": "Proceedings of the human factors and ergonomics society annual meeting",
        "pub_date": "2020/12",
        "description": "The continued advances in artificial intelligence and automation through machine learning applications, under the heading of data science, gives reason for pause within the educator community as we consider how to position future human factors engineers to contribute meaningfully in these projects. Do the lessons we learned and now teach regarding automation based on previous generations of technology still apply? What level of DS and ML expertise is needed for a human factors engineer to have a relevant role in the design of future automation? How do we integrate these topics into a field that often has not emphasized quantitative skills? This panel discussion brings together human factors engineers and educators at different stages of their careers to consider how curricula are being adapted to include data science and machine learning, and what the future of human factors education may look like in …",
        "citations": 9
    },
    {
        "title": "Interdisciplinary Human Factors Curricula for Individualized, Independent Study",
        "id": "gTRDElAAAAAJ:dQ2og3OwTAUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:dQ2og3OwTAUC",
        "authors": [
            "Esa M Rantanen",
            "Hamza Khammash",
            "James C Hall"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2020/12",
        "description": "Education and career development of new generations of human factors professionals has rightly been a central concern the Human Factors and Ergonomics Society for many decades. There have been periodic surveys to track the changing employer expectations for new professionals, and there have been several panel discussion at the HFES Annual Meetings to address various issues in education of future professionals. There have been significant changes in academia, where many traditional disciplinary programs are declining and new interdisciplinary programs are emerging. These trends may present novel opportunities for education of the future human factors workforce. In this project we surveyed all courses in a university course catalog to identify courses that offer training, to varying degrees, in the Core Competencies as defined by the Board of Certification in Professional Ergonomics. These courses …",
        "citations": 1
    },
    {
        "title": "Provost’s Learning Innovation Grant (PLIG) for 2019",
        "id": "gTRDElAAAAAJ:nrtMV_XWKgEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:nrtMV_XWKgEC",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "",
        "pub_date": "2020/8/31",
        "description": "This grant allowed for a redesign of the PSYC 714 “Graduate Engineering Psychology” course, offered by the Department of Psychology about every two years since 2013, for online delivery. The grant was awarded on March 29, 2019. Full Project Plan report was submitted on Aug. 16, 2019. The majority of the course redesign work was completed during the fall semester 2019 (2191), including creation of several software programs to support the lab exercises designed for the course. The Preliminary Findings report was submitted on Jan. 10, 2020, and the PSYC 714 course was offered online in the spring semester of 2020 (2195) as a “pilot” of the redesign. The course ran successfully through the semester, and being online, was not impacted by the COVID-19 pandemic that resulted in closing of RIT’s campus and moving of all classes online after the extended spring break on March 23, 2020. Other events …"
    },
    {
        "title": "Tracking the identity of moving words: Stimulus complexity and familiarity affects tracking accuracy",
        "id": "gTRDElAAAAAJ:ye4kPcJQO24C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ye4kPcJQO24C",
        "authors": [
            "Jukka Hyönä",
            "Lauri Oksama",
            "Esa Rantanen"
        ],
        "pub_source": "Applied Cognitive Psychology",
        "pub_date": "2020/1",
        "description": "In two experiments, participants tracked the identity and location of moving words. The task bears resemblance to one performed by air traffic controllers who track multiple moving aircraft, where they are identified with relatively complex alphanumeric call signs. In Experiment 1, stimulus familiarity was manipulated by comparing the tracking of familiar words and pseudowords. In Experiment 2, also stimulus complexity was varied by having the participants track short and long words. Stimulus complexity affected tracking: Short words were easier to track than long words. Moreover, familiarity of identity affected tracking of short words (short familiar words were easier to track than short pseudo‐words) but not of long words. The results are interpreted within the framework of the model of multiple identity tracking model. Mathematical simulations suggest that observers may not have enough time for full identification of …",
        "citations": 6
    },
    {
        "title": "A human factors engineering education perspective on data science, machine learning and automation",
        "id": "gTRDElAAAAAJ:VL0QpB8kHFEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:VL0QpB8kHFEC",
        "authors": [
            "Daniel Hannon",
            "Esa Rantanen",
            "Ben Sawyer",
            "Raymond Ptucha",
            "Ashley Hughes",
            "Katherine Darveau",
            "John D Lee"
        ],
        "pub_source": "Proceedings of the human factors and ergonomics society annual meeting",
        "pub_date": "2019/11",
        "description": "The explosion of data science (DS) in all areas of technology coupled with the rapid growth of machine learning (ML) techniques in the last decade create novel applications in automation. Many working with DS techniques rely on the concept of “black boxes” to explain how ML works, noting that algorithms find patterns in the data that humans might not. While the mathematics are still being developed, the implications for the application of ML, specifically to questions of automation, also are being studied, but still remain poorly understood. The decisions made by ML practitioners with respect to data selection, model training and testing, data visualization, and model applications remain relatively unconstrained and have the potential to yield unexpected results at the systems level. Unfortunately, human factors engineers concerned with automation often have limited training and awareness of DS and ML …",
        "citations": 18
    },
    {
        "title": "Decluttering Geographic Data View Displays",
        "id": "gTRDElAAAAAJ:SdhP9T11ey4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:SdhP9T11ey4C",
        "authors": [
            "Esa M Rantanen",
            "Limor Hochberg",
            "Mingyang Di",
            "Diego Klabjan"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2018/9",
        "description": "To reduce clutter on wide-area geographic data view displays of electric power systems, substations in geographically compact areas should be spread out and line overlaps and intersections minimized. Such patterns optimized with respect to given constraints can be modeled as a multicommodity flow problem. Due to the size of the developed model, we developed two clustering-based iterative algorithms to decompose the global network into smaller regions and then iteratively solve the subproblem in each region by read-justing some values. Three solutions were selected for experimental evaluation. The experimental results were somewhat inconclusive, due to naïve participants, simple task, and limitations of the eye tracker. Nevertheless, two of the decluttered maps appeared to have distinct advantage over the baseline map, where substations were simply connected by straight lines, in terms of performance …"
    },
    {
        "title": "Cross-training in design and human factors",
        "id": "gTRDElAAAAAJ:9vf0nzSNQJEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:9vf0nzSNQJEC",
        "authors": [
            "Esa Rantanen",
            "Alisa Rantanen",
            "Michael Lau"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2018/9",
        "description": "The education of future human factors professionals is a critically important topic and a concern for the professional associations of human factors/ergonomics professionals. The Human Factors and Ergonomics Society (HFES) has a long history of involvement in the career development of its members and the Education Technical Group has encouraged presentations and panels on ca-reer development topics at the Society’s annual meetings. This panel will continue this tradition and is intended to stimulate and sustain a discourse between the human factors and design com-munities both in the industry and academia, as well as serve as an exemplar of industry-academia interaction.",
        "citations": 2
    },
    {
        "title": "Improving Operator Situation Awareness by Phasor Measurement Unit (PMU) Data Visualization",
        "id": "gTRDElAAAAAJ:9Nmd_mFXekcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:9Nmd_mFXekcC",
        "authors": [
            "Esa M Rantanen",
            "Ernest Fokoue",
            "Jacob Haut",
            "Chandini Ramesh",
            "Kathleen Gegner",
            "Thomas Overbye",
            "Komal Shetye"
        ],
        "pub_source": "",
        "pub_date": "2018",
        "description": "The application of phasor measurement unit (PMU) data in the power industry is currently an area of intense interest. The key driver for PMU technology is to use the precise time sources provided by Global Positioning System (GPS) satellites to accurately measure the relative voltage and current phase angles at buses across an interconnect at a very high sampling rate. Presenting PMU data to power system operators in a format that is truly useful for them and that affords improved situation awareness (SA) and fast and accurate decision making is a particular challenge to display design. This report describes development of prototype displays of PMU data where the design criteria were derived from characteristics of the data as well as the situation awareness requirements of power system dispatchers. A prototype display that meets all these design criteria is described."
    },
    {
        "title": "Jointly Offered Online Course Between Malmö University and Rochester Institute of Technology on Industrial and Organizational Psychology",
        "id": "gTRDElAAAAAJ:yB1At4FlUx8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:yB1At4FlUx8C",
        "authors": [
            "Esa M Rantanen",
            "Rebecca Johnson",
            "Jonas Lundsten",
            "Jean-Charles Languilaire",
            "Andreas Sjöstedt"
        ],
        "pub_source": "",
        "pub_date": "2017/9/28",
        "description": "The idea of a jointly offered online course between Rochester Institute of Technology (RIT) and Malmö University (MU) on Industrial and Organizational (I/O) Psychology was first conceived at the 2nd Annual MU-RIT Symposium on Oct 1-3, 2014, in discussions between faculty members of RIT and MU. The symposium, held in Sweden at MU, provided an opportunity for faculty and administrators from RIT and MU to identify potential collaborative research and teaching partnerships between faculty from the two universities.Two principal collaborators from each university began to develop a jointly offered course shortly after the symposium, based on an existing online course offered at RIT (PSYC 234 in RIT’s designation). Course development for joint offering between RIT and MU was substantially aided by the Guided Online Learning Development (GOLD) professional development program offered at RIT in the …"
    },
    {
        "title": "Data properties underlying human monitoring performance",
        "id": "gTRDElAAAAAJ:D_sINldO8mEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:D_sINldO8mEC",
        "authors": [
            "Esa M Rantanen",
            "Ernest Fokoué",
            "Kathleen Gegner",
            "Jacob Haut",
            "Thomas J Overbye"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2017/9",
        "description": "The application of phasor measurement unit (PMU) data in the power industry is currently an area of intense interest. The key driver for PMU technology is to use the precise time sources provided by Global Positioning System (GPS) satellites to accurately measure the relative voltage and current phase angles at buses across an interconnect at a very high sampling rate. Presenting PMU data to power system operators in a format that is truly useful for them and that affords improved situation awareness (SA) and fast and accurate decision making is a particular challenge to display design. This paper described development of prototype displays of PMU data where the design criteria were derived from characteristics of the data as well as the situation awareness requirements of power system dispatchers. A prototype display that meets all these design criteria is described.",
        "citations": 1
    },
    {
        "title": "A Software Tool for Cognitive Work Analysis",
        "id": "gTRDElAAAAAJ:eJXPG6dFmWUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:eJXPG6dFmWUC",
        "authors": [
            "Dharmendra Praving Hingu",
            "Somasundaram Muthukrishnan",
            "Esa M Rantanen",
            "Gavan Lintern"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2017/9",
        "description": "Cognitive Work Analysis (CWA) is a conceptual framework that allows for analysis of all factors that affect human-system interactions. The products of this system of analyses can then be directly transformed into design requirements for information systems. Doing CWA by hand is quite tedious, however, and larger projects where data are collected from multiple individuals doing the same task differently, or when multiple different tasks are included in a larger-scale CWA, pose special challenges. It is apparent that streamlined documentation and support tool for CWA is needed. Even at a cost of some lost flexibility, the benefits of a software tool to support data collection are apparent. The tool should also support the analyses of large amounts of data from multiple operators within a large system, where individual differences in ways of doing things are expected. This paper describes the development of such a tool …",
        "citations": 2
    },
    {
        "title": "Practitioner operational challenges and priorities",
        "id": "gTRDElAAAAAJ:5Ul4iDaHHb8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:5Ul4iDaHHb8C",
        "authors": [
            "Esa M Rantanen",
            "Karl E Fennell",
            "Jason Russi",
            "John R Dougherty"
        ],
        "pub_source": "Advances in Aviation Psychology, Volume 2",
        "pub_date": "2017/5/18",
        "description": "This chapter is based on the Practitioner Plenary Panel held at the International Symposium on Aviation Psychology (ISAP) in May 2015. The charge to the panel was for aviation practitioners to present their thoughts regarding the current and future human factor challenges in their various domains. This Plenary Panel was followed the next day by a Researcher Plenary Panel that would present research and development (R&D) approaches and strategies that address the challenges confronted by the practitioners (see Chapter 3, this volume). The overarching goal of these two plenary sessions was to foster dialogues between operational personnel and researchers in order to promote more efficient R&D efforts and a safer aviation industry."
    },
    {
        "title": "Workload in nursing",
        "id": "gTRDElAAAAAJ:WbkHhVStYXYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:WbkHhVStYXYC",
        "authors": [
            "Jonathan Umansky",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2016/9",
        "description": "Nursing is a high workload profession, and excessive workload has been shown to have an adverse effect on patient care. Prior research has focused on patient-staff ratios and skill mix to analyze the relationship of workload and degradation of care. This study used a comprehensive, multi-dimensional approach for analyzing nurses’ workload in a large general hospital. Workload drivers were introduced as unique factors that contributed to the totality of nursing workload. Cognitive Work Analysis (CWA) framework was used to map out the work domain of nurses and identify sources of workload within it. The output was a collection of diagrams, tables, and interviews that illustrated areas in nursing that produced the most workload. A detailed integration of the material supported an estimation of workload experienced by nurses.",
        "citations": 56
    },
    {
        "title": "Trends in knowledge and skill expectations for new human factors professionals",
        "id": "gTRDElAAAAAJ:rO6llkc54NcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:rO6llkc54NcC",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2016/9",
        "description": "This study was a replicate of two prior studies on the knowledge and skill expectations for new human factors/ergonomics professionals in the current labor market. Five and four years have passed since new HF/E professionals and their employers were last surveyed. In the rapidly changing work domains it is important to track the changing expectations to detect trends and to continually revise academic curricula to better provide future HF/E professionals education that meets them. Both new professionals and their employers were surveyed for this study. The results are compared with the past surveys. In addition, the relevance of the new core competencies of the Board of Certification for Professional Ergonomics were examined against the workplace expectations.",
        "citations": 6
    },
    {
        "title": "Education of future human factors professionals",
        "id": "gTRDElAAAAAJ:HoB7MX3m0LUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:HoB7MX3m0LUC",
        "authors": [
            "Esa Rantanen",
            "Deborah Boehm-Davis",
            "Linda Ng Boyle",
            "Daniel Hannon",
            "John D Lee"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2016/9",
        "description": "The labor market as a whole and specifically those areas where human factors/ergonomics (HF/E) professionals are employed are in constant flux. Academic institutions, on the other hand, tend to be more stable with changes in programs happening much more slowly. There is some evidence that the education of new HF/E professionals falls short of meeting the knowledge and skills that human factors professionals face when they enter the workplace. This panel is convened to discuss and debate two questions: (1) What would the “ideal” education look like for the future HF/E professional, and (2) what would be the best way to deliver this ideal education. Moreover, we hope that this panel will bring together educators and employers of future HF/E professionals and foster a lively and productive exchange of ideas on how to best supply the future workforce with the evolving industry needs. It should be noted …",
        "citations": 3
    },
    {
        "title": "Usability of incident reporting systems: preliminary results of a case study",
        "id": "gTRDElAAAAAJ:3s1wT3WcHBgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:3s1wT3WcHBgC",
        "authors": [
            "Paul Wiele",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of the International Symposium on Human Factors and Ergonomics in Health Care",
        "pub_date": "2015/6",
        "description": "Although low participation in incident-reporting systems contributes to the problem of poor error prevention, little research has focused on improving participation. The present study is a case study of a hospital's incident reporting practices, seeking to increase both the number and quality of their incident reports by examining the usability of the reporting system itself as well as organizational factors impacting attitudes towards reporting. A snowball sample of hospital staff was recruited to identify organizational and software usability factors that both impede and promote frequent and useful incident reporting. Preliminary results suggest that time pressure is a key impediment to reporting, and that hospital staff in certain units are already attempting innovative shortcuts to cut time demands without reducing their reporting rates.",
        "citations": 2
    },
    {
        "title": "Improving Operator Situational Awareness with Wide Area Geographic Data View Displays of the Electric Power Grid",
        "id": "gTRDElAAAAAJ:t7zJ5fGR-2UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:t7zJ5fGR-2UC",
        "authors": [
            "Esa M Rantanen",
            "Limor Hochberg",
            "Diego Klabjan",
            "Mingyang Di"
        ],
        "pub_source": "",
        "pub_date": "2015",
        "description": "To reduce clutter on wide-area geographic data view displays of electric power systems, substations in geographically compact areas should be spread out and line overlaps and intersections minimized. Such pat-terns optimized with respect to given constraints can be modeled as a multicommodity flow problem. Due to the size of the developed model, we developed two clustering-based iterative algorithms to decompose the global network into smaller regions and then iteratively solve the subproblem in each region by readjusting some values. Three solutions were selected for experimental evaluation. The experimental results were somewhat inconclusive, due to naïve participants, simple task, and limitations of the eye tracker. Nevertheless, two of the decluttered maps appeared to have distinct advantage over the baseline map, where substations were simply connected by straight lines, in terms of performance time and workload."
    },
    {
        "title": "The colleagues listed below reviewed the incoming manuscripts very conscientiously and provided constructive suggestions to many of our authors. Furthermore, in most cases they …",
        "id": "gTRDElAAAAAJ:geHnlv5EZngC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:geHnlv5EZngC",
        "authors": [
            "Cristina Albuquerque",
            "Ciprian Baciu",
            "Stephan Bauer",
            "Peter Beer",
            "Sonja Biede",
            "Reinhard Braunstingl",
            "Lori Brown",
            "Barbara Burian",
            "Bert Busscher",
            "James Christensen",
            "Tim Coombs",
            "Samuel Cromie",
            "Robert J de Boer",
            "Katia Defrancq",
            "Doris Dehn",
            "Key Dismukes",
            "André Droog",
            "Hinnerk Eißfeldt",
            "Carina Eriksen",
            "Solveig Eschen",
            "Karl Fennell",
            "Kazuo Furuta",
            "Kerstin Gaisbachgrabner",
            "Valerie Gawron",
            "Gudela Grote",
            "Gerhard Gruber",
            "Don Harris",
            "Brian Hilburn",
            "David Hunter",
            "Peter Jorna",
            "Nektarios Karanikas",
            "Raymond E King",
            "Uwe Klingauf",
            "Harald Kolrep",
            "Kara A Latorella",
            "Wen-Chin Li",
            "Steve K Lilley",
            "Shem Malmquist",
            "Lena Martensson",
            "Monica Martinussen",
            "Norman Maxim",
            "Preven Naidoo",
            "Jan Noyes",
            "Esa Rantanen",
            "Stefan Rentsch",
            "Jan Joris Roessingh",
            "Wolfgang Roth",
            "Christoph Santel",
            "Jeffery Schroeder",
            "Marian Schuver-van Blanken",
            "Michaela Schwarz",
            "Steve Shorrock",
            "Gideon Singer",
            "Anthony J Smoker",
            "Matthew Thomas",
            "Melanie Todd",
            "Pamela Tsang",
            "Michael A Vidulich",
            "Mark Wiggins",
            "Lu Yanyu",
            "Alf Zimmer",
            "Wolf-Dietrich Zuzan"
        ],
        "pub_source": "",
        "pub_date": "2015",
        "description": "Reviewers 2016 Page 1 Volume Information Reviewers 2016 The colleagues listed below \nreviewed the incoming manuscripts very conscientiously and provided constructive \nsuggestions to many of our authors. Furthermore, in most cases they reviewed quickly, \nwhich is a fundamental prerequisite for a rapid manuscript management. The editors of \nAviation Psychology and Applied Human Factors are greatly indebted to all of them. Cristina \nAlbuquerque Laura Barron Peter Beer Sonja Biede Reinhard Braunstingl Lori Brown \nBarbara Burian Thomas Carretta Samuel Cromie Kris de Bolle Katia Defrancq Key \nDismukes André Droog Hinnerk Eißfeldt Gerhard Fahnenbruck Andrea Georgiou Brian \nHilburn David Hunter Peter Jorna Nektarios Karanikas Terrence Kelly Doris Keye-Ehing \nRaymond E. King Harald Kolrep Kara A. Latorella Wen-Chin Li Shem Malmquist Carol \nManning Lena Martensson Monica Martinussen …"
    },
    {
        "title": "Learning of location-identity bindings: Development of Level 1 situation awareness in an air traffic control-like task",
        "id": "gTRDElAAAAAJ:RGFaLdJalmkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:RGFaLdJalmkC",
        "authors": [
            "Alexander Nalbandian",
            "Esa Rantanen"
        ],
        "pub_source": "18th International Symposium on Aviation Psychology",
        "pub_date": "2015",
        "description": "Knowing “what is where” is essential to human perception and performance. This knowledge corresponds to the concept of Situation Awareness (SA), specifically Level 1 SA. The underlying research paradigm concerns tracking of identical objects moving on a screen (Multiple Object Tracking, MOT). This method has been useful to investigate the fundamentals of visual tracking, but it lacks a connection to real-world scenarios. In another paradigm, objects tracked have unique identities (Multiple Identity Tracking, MIT) requiring a combination of peripheral and focal perception in tracking. This model has been used to examine air traffic controllers’ SA. This paper will report results from an experiment where objects with identities similar to typical air traffic control (ATC) call signs were displayed on a plan-view display. The 4-and 8-object conditions replicated previous research and a 12-object condition simulated the density of typical ATC displays. The displays were static to examine the time required to create identity-location bindings (Level 1 SA). The displays were periodically blanked and participants queried about locations of target objects. Location errors and response times were recorded. The object array size of 4 had the highest accuracy and shortest time to acquire good SA. As the object set size increased from 4 objects to 12 objects, location errors increased dramatically. In sum, participants could reliably retain locations and identities of only about three objects. This finding has implications to the capacity of controllers to maintain adequate SA in future ATC systems.",
        "citations": 2
    },
    {
        "title": "Power grid visualization by means of optimization",
        "id": "gTRDElAAAAAJ:XD-gHx7UXLsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:XD-gHx7UXLsC",
        "authors": [
            "Mingyang Di",
            "Diego Klabjan",
            "Esa Rantanen"
        ],
        "pub_source": "INFORMS Annual Meeting",
        "pub_date": "2014/11",
        "description": "The operations in electric power control centers play a crucial role in ensuring the integrity of the nation’s electric grid and present formidable challenges to human operators. One of the primary challenges of information display for a power transmission control room application is the clutter from displaying too much information in too small of a display space. Thus, the task to optimize the layout of visual elements consisting of substations and transmission lines on the display interface is of vital importance. To this end, algorithms using several optimization techniques including Lagrangian relaxation and progressive hedging are proposed in this paper to make the interface less cluttered subject to human perceptual and cognitive capabilities. We conduct extensive computational studies to evaluate and compare the developed algorithms, and report our findings based on a real-world power grid in the US",
        "citations": 1
    },
    {
        "title": "Usability of human factors standards",
        "id": "gTRDElAAAAAJ:tS2w5q8j5-wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:tS2w5q8j5-wC",
        "authors": [
            "Abhishek Swaminathan",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2014/9",
        "description": "Adherence to human factors/ergonomics standards is critical to a good design project. No other resource can provide a designer with specifications based on sound science than a good standards book or info-guide. However, designers usually come up with ideas to solve problems and leave the manufacturing and technical specifications to the engineers. Although they may be aware of the basic user needs, designers rarely look at standards to justify their design thinking and validate their design processes. The two studies reported in this paper investigated the awareness of, accessibility, and usability of human factors/ergonomics standards among college students and their professors in design-oriented programs, as well as among practicing designers. The results are drawn from data obtained through an online survey and a focus group study. Although the participants’ awareness of relevant standards was …",
        "citations": 3
    },
    {
        "title": "Linguistic Analysis of Archival Human Factors Jobs Data",
        "id": "gTRDElAAAAAJ:1sJd4Hv_s6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:1sJd4Hv_s6UC",
        "authors": [
            "Limor Hochberg",
            "Ravdeep Johar",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2014/9",
        "description": "To continually track changing skills and knowledge requirements for human factors professionals in the labor market, an archival human factors jobs database was created. The database contains relevant information from human factors job announcements, including required degree and field of education, required and preferred experience, and information from the job descriptions. The primary purpose of the database is to facilitate longitudinal analyses of employers’ expectations. Results from these analyses should be used in the design of academic human factors programs and curricula to better prepare future human factors professionals meet such expectations upon their graduation. In this paper we describe a natural language processing approach to analysis of human factors jobs data. Several trends emerged from our analyses. Although we defer drawing conclusions from these trends until later, until the …",
        "citations": 1
    },
    {
        "title": "Usability of Human Factors Research in Design: Advice from Users of Science to Producers of Science",
        "id": "gTRDElAAAAAJ:ZHo1McVdvXMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ZHo1McVdvXMC",
        "authors": [
            "Esa Rantanen",
            "Keith Karn",
            "Neal Wiggermann",
            "Christopher Koch",
            "Michael Lau",
            "Alisa Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2014/9",
        "description": "There exists a disconnect between users of the science of human factors, that is, designers and practitioners, and producers of the science, that is, human factors researchers. Research results are primarily disseminated by articles published in scientific, peer reviewed journals, that are often targeted to other scientists, not designers or practitioners. Human factors standards and guidelines are intended for designers and human factors practitioners, but finding and accessing standards relevant to specific design problems is difficult as well. We convened this panel in order to focus on designers’ needs for human factors data, standards, and guidelines, and to seek solutions to what appears to be a communication problem between human factors researchers and the users of their results.",
        "citations": 1
    },
    {
        "title": "Towards automatic annotation of clinical decision-making style",
        "id": "gTRDElAAAAAJ:J_g5lzvAfSwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:J_g5lzvAfSwC",
        "authors": [
            "Limor Hochberg",
            "Cecilia Ovesdotter Alm",
            "Esa M Rantanen",
            "Qi Yu",
            "Caroline M DeLong",
            "Anne Haake"
        ],
        "pub_source": "Proceedings of LAW VIII-The 8th Linguistic Annotation Workshop",
        "pub_date": "2014/8",
        "description": "Clinical decision-making has high-stakes outcomes for both physicians and patients, yet little research has attempted to model and automatically annotate such decision-making. The dual process model (Evans, 2008) posits two types of decision-making, which may be ordered on a continuum from intuitive to analytical (Hammond, 1981). Training clinicians to recognize decision-making style and select the most appropriate mode of reasoning for a particular context may help reduce diagnostic error (Norman, 2009). This study makes preliminary steps towards detection of decision style, based on an annotated dataset of image-based clinical reasoning in which speech data were collected from physicians as they inspected images of dermatological cases and moved towards diagnosis (Hochberg et al., 2014). A classifier was developed based on lexical, speech, disfluency, physician demographic, cognitive, and diagnostic difficulty features. Using random forests for binary classification of intuitive vs. analytical decision style in physicians’ diagnostic descriptions, the model improved on the baseline by over 30%. The introduced computational model provides construct validity for decision styles, as well as insights into the linguistic expression of decision-making. Eventually, such modeling may be incorporated into instructional systems that teach clinicians to become more effective decision makers.",
        "citations": 11
    },
    {
        "title": "Linguistic analysis of clinical communications: A novel method for study of diagnostic errors",
        "id": "gTRDElAAAAAJ:GnPB-g6toBAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:GnPB-g6toBAC",
        "authors": [
            "Esa Rantanen",
            "Cecilia Ovesdotter Alm",
            "Tracy Worrell",
            "Nancy Valentage",
            "Nick Iuliucci"
        ],
        "pub_source": "Proceedings of the International Symposium on Human Factors and Ergonomics in Health Care",
        "pub_date": "2014/6",
        "description": "This project took a unique perspective on the investigation of decision making in healthcare by examining clinician-patient consultation using methods from linguistics and communication. Our goal was to identify cognitive and behavioral patterns in interactions of clinicians-in-trainings with patients that correspond to decision making processes in time constrained situations. Objective measures of clinician-patient communications in both naturalistic and simulated settings is a promising way to examine clinician decision making under uncertainty and time pressure, and to identify specific errors in decision making that may lead to misdiagnoses. We sought to detect distinguishable patterns of communication adopted by clinicians-in-training in clinical consultation settings under time pressure. A pilot study reported in this paper provides objective measurement tools to study miscommunication within clinician-patient …",
        "citations": 3
    },
    {
        "title": "Decision style in a clinical reasoning corpus",
        "id": "gTRDElAAAAAJ:mVmsd5A6BfQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:mVmsd5A6BfQC",
        "authors": [
            "Limor Hochberg",
            "Cecilia Ovesdotter Alm",
            "Esa M Rantanen",
            "Caroline M DeLong",
            "Anne Haake"
        ],
        "pub_source": "Proceedings of BioNLP 2014",
        "pub_date": "2014/6",
        "description": "The dual process model (Evans, 2008) posits two types of decision-making, which may be ordered on a continuum from intuitive to analytical (Hammond, 1981). This work uses a dataset of narrated image-based clinical reasoning, collected from physicians as they diagnosed dermatological cases presented as images. Two annotators with training in cognitive psychology assigned each narrative a rating on a four-point decision scale, from intuitive to analytical. This work discusses the annotation study, and makes contributions for resource creation methodology and analysis in the clinical domain.",
        "citations": 13
    },
    {
        "title": "Practicing relevant skills in the classroom: Advice from experts in the industry to professors",
        "id": "gTRDElAAAAAJ:p2g8aNsByqUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:p2g8aNsByqUC",
        "authors": [
            "Esa M Rantanen",
            "Daniel J Colombo",
            "Sarah M Miller",
            "Amy L Alexander",
            "Frank C Lacson",
            "Anthony D Andre"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2013/9",
        "description": "A particular challenge to professors of human factors/ergonomics courses in academia is to make their syllabi and course contents relevant to the demands placed on graduates from human factors programs as they enter the labor market. Recent surveys suggest that academic curricula indeed fall short of expectations in several critical areas. To respond to these challenges and the demonstrated deficiencies, a panel of human factors professionals from various areas in the industry suggested ways to incorporate relevant skills exercises in academic curricula. This panel is part of an ongoing dialog between employers of human factors/ergonomics professionals in the industry and the professors of human factors students in academia.",
        "citations": 7
    },
    {
        "title": "Archival human factors jobs database as a tool for tracking trends in skills and knowledge expectations in the labor market",
        "id": "gTRDElAAAAAJ:_Qo2XoVZTnwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:_Qo2XoVZTnwC",
        "authors": [
            "Esa Rantanen",
            "Christopher Claeys",
            "Daniel Roder",
            "William Moroney"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2013/9",
        "description": "To educate the future human factors/ergonomics workforce and meet the demand for new professionals in the field, academic institutions must pay close attention to the ever-changing skills and knowledge expectations in the labor market. These trends are not easy to track, however. Surveys of new professionals about their experiences in their first jobs or surveys of employers about their experiences with new hires suffer from low response rates, nonresponse bias, and the one-time nature of survey research. A better way to track labor market trends is to continually analyze human factors job postings for education and experience requirements specified in them. This paper describes development of a database for that purpose. We also discuss ways of analyzing unstructured text data in the database. The results of analyses of these data include summary statistics of frequencies and their correlations, clusters of …",
        "citations": 5
    },
    {
        "title": "Development of a Jobs Database for Tracking Knowledge and Skills Expectations in the Workplace",
        "id": "gTRDElAAAAAJ:ns9cj8rnVeAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ns9cj8rnVeAC",
        "authors": [
            "Esa M Rantanen",
            "Christopher Claeys",
            "Daniel Roder"
        ],
        "pub_source": "Development",
        "pub_date": "2013/8/15",
        "description": "The primary objective of college education in applied disciplines is that it is relevant to the expectations for new professionals entering the labor market. Academic institutions should therefore pay close attention to the ever-changing skills and knowledge expectations in the labor market. These trends are not easy to track, however. Surveys of new professionals about their experiences in their first jobs or surveys of employers about their experiences with new hires suffer from low response rates, nonresponse bias, and the one-time nature of survey research. A better way to track labor market trends is to continually analyze human factors job postings for education and experience requirements specified in them. This report describes development of a database for that purpose. We also discuss ways of analyzing unstructured text data in the database. The results of analyses of these data include summary statistics of …",
        "citations": 1
    },
    {
        "title": "Stress in medical residency: cognitive work analysis and a literature review",
        "id": "gTRDElAAAAAJ:RYcK_YlVTxYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:RYcK_YlVTxYC",
        "authors": [
            "Daniel T Nystrom",
            "Esa M Rantanen",
            "Gavan Lintern"
        ],
        "pub_source": "Proceedings of the International Symposium on Human Factors and Ergonomics …",
        "pub_date": "2013/6",
        "description": "Resident physicians endure substantial amounts of stress to acquire the necessary skills and knowledge to become competent, certified physicians. Multiple factors that contribute to high levels of stress in different areas of the healthcare domain have been identified, but stress continues to be a major problem despite this knowledge and efforts to reduce it. This study employed the framework of Cognitive Work Analysis to systematically review and organize relevant research literature to gain a holistic understanding of resident stress. The result of our work is a representation of resident physicians’ work domain with relevant literature investigating resident stress associated to each area of the representation. The representation provides an organizational structure to examine sources of stress that have been heavily investigated in the resident physicians work domain and identifies areas that lack systematic research.",
        "citations": 1
    },
    {
        "title": "Eye contact and video-mediated communication: A review",
        "id": "gTRDElAAAAAJ:0EnyYjriUFMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:0EnyYjriUFMC",
        "authors": [
            "Leanne S Bohannon",
            "Andrew M Herbert",
            "Jeff B Pelz",
            "Esa M Rantanen"
        ],
        "pub_source": "Displays 34 (2), 177-185",
        "pub_date": "2013/4/1",
        "description": "A relatively new form of human communication, video-conferencing has become more popular as video technology improves and with increasing demands for real-time communication across greater distances. The full effects of video-conferencing on human communication are still being explored. Video-conferencing is presumed to be a somewhat richer form of communication than email and telephone, but not quite as informative as face-to-face communication. This review explores research into the influence of eye contact on communication and how video-conferencing mediates both verbal and non-verbal interactions. Facilitation of eye contact is a challenge that must be addressed so that video-conferencing can approach the rich interactions of face-to-face communication.",
        "citations": 172
    },
    {
        "title": "Ergonomics Society Annual Meeting",
        "id": "gTRDElAAAAAJ:5awf1xo2G04C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:5awf1xo2G04C",
        "authors": [
            "Esa M Rantanen",
            "Daniel J Colombo",
            "Sarah M Miller",
            "Amy L Alexander",
            "Frank C Lacson",
            "Anthony D Andre"
        ],
        "pub_source": "",
        "pub_date": "2013",
        "description": "A particular challenge to professors of human factors/ergonomics courses in academia is to make their syllabi and course contents relevant to the demands placed on graduates from human factors programs as they enter the labor market. Recent surveys suggest that academic curricula indeed fall short of expectations in several critical areas. To respond to these challenges and the demonstrated deficiencies, a panel of human factors professionals from various areas in the industry suggested ways to incorporate relevant skills exercises in academic curricula. This panel is part of an ongoing dialog between employers of human factors/ergonomics professionals in the industry and the professors of human factors students in academia."
    },
    {
        "title": "Communication Sequences in Controller Pilot Communications",
        "id": "gTRDElAAAAAJ:olpn-zPbct0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:olpn-zPbct0C",
        "authors": [
            "Jonathan Histon",
            "Esa Rantanen",
            "Cecilia Ovesdotter Alm"
        ],
        "pub_source": "17th International Symposium on Aviation Psychology",
        "pub_date": "2013",
        "description": "Temporal patterns in the content of controller-pilot communications can reflect strategies and techniques used by controllers. Introducing data-based communication systems may profoundly impact these strategies and techniques. To establish a baseline of existing patterns in controllerpilot voice communications, analysis is presented of the content of air-ground communications between pilots and controllers from North American operations. Results are presented of the relative frequency of common sequences of communication events and how these vary in response to changes in weather conditions. Methodological challenges in sequence analysis as well as implications of the results for understanding effect of changes in communication technology on controller training and complexity management in future ATC environments are presented."
    },
    {
        "title": "Student perceptions of their educational and skill needs in the workplace",
        "id": "gTRDElAAAAAJ:hFOr9nPyWt4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:hFOr9nPyWt4C",
        "authors": [
            "William F Moroney",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2012/9",
        "description": "The Human Factors and Ergonomics Society’s Education and Training Committee and the Early Career Committee identified the need to evaluate the effectiveness of graduate education in the field of human factors/ergonomics and identify areas requiring improvement. Consequently, a survey to determine the expectations of current students was developed. Fifty-eight students, from a variety of colleges and universities, completed the survey. The findings of this survey were contrasted with finding of an earlier survey, which focused on new professionals (individuals with less than five years experience in the field). Considerable overlap between the groups was noted. Of particular interest was the reliance of both groups on material obtained through the Internet and through social networks. Both groups indicated a need for applied research methods and statistics, application of knowledge learned, and various …",
        "citations": 4
    },
    {
        "title": "Employers’ expectations for education and skills of new human factors/ergonomics professionals",
        "id": "gTRDElAAAAAJ:YOwf2qJgpHMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:YOwf2qJgpHMC",
        "authors": [
            "Esa M Rantanen",
            "William F Moroney"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2012/9",
        "description": "This paper reports the results from a survey administered to individuals in several companies whose responsibilities included either hiring or supervision of new human factors/ergonomics professionals. The survey asked about the knowledge and skills expected from new professionals entering the workplace. It was based on the survey previously administered to new professionals about their experiences in their first human factors jobs. The results both replicate and complement the findings of the previous survey. Many critical skills, such as communication skills, are not specific to the discipline. However, in over half of the Ergonomist Formation Model subdomains the respondents rated new professionals’ preparedness as only adequate. The open-ended questions allowed for a review of specific challenges and the responses echoed those of the new professionals’ responses last year. Application of the …",
        "citations": 15
    },
    {
        "title": "Human Factors Validation of NextGen Technologies and Procedures",
        "id": "gTRDElAAAAAJ:D03iK_w7-QYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:D03iK_w7-QYC",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "Advances in Human Aspects of Aviation",
        "pub_date": "2012/7/11",
        "description": "Validation has received remarkably little attention in the systems development literature. In particular, there has almost been no progress in the area of human factors validation of complex system in the 20 years since the publication of Wise, Hopkin, and Stager’s (1993) seminal volume on the topic. Yet, large-scale modernization efforts of air transportation infrastructure in the US (NextGen) and elsewhere should by all reason have proved to be a boon to research on validation and verification methods. Alas, this appears not to be the case. This session in the 4th International Conference on Applied Human Factors and Ergonomics and the 1st International Conference on Human Factors in Transportation was put together to refocus the attention on verification and validation of NextGen technologies and procedures. The five papers in the session address diverse questions about validation of different components of …"
    },
    {
        "title": "Air Traffic Control Voice Data Analysis to Validate NextGen Procedures",
        "id": "gTRDElAAAAAJ:35N4QoGY0k4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:35N4QoGY0k4C",
        "authors": [
            "Jonathan Histon",
            "Esa Rantanen",
            "Cecilia Ovesdotter Alm"
        ],
        "pub_source": "Advances in Human Aspects of Aviation, 129",
        "pub_date": "2012/7/11",
        "description": "The NextGen ATC modernization effort is introducing new technologies and procedures affecting communication between pilots and controllers. This is creating opportunities for fundamentally new ways of providing air traffic control (ATC) services. In order to take the fullest advantage of these changes it is important to understand the communication needs of pilots and controllers in both current and future environments. This paper reviews previous taxonomies of the content of airground communications between pilots and controllers and the most recent findings on the type, frequency, and function of existing communication technologies. Methods of analysis and metrics of relevant variables derived from ATC voice data are presented in order to illustrate the rich and complex communication strategies controllers currently employ. Examples of these analyses and metrics using voice data from multiple sectors at the …"
    },
    {
        "title": "Conflict resolution maneuvers in air traffic control: Investigation of operational data",
        "id": "gTRDElAAAAAJ:4DMP91E08xMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:4DMP91E08xMC",
        "authors": [
            "Esa M Rantanen",
            "Christopher D Wickens"
        ],
        "pub_source": "The International Journal of Aviation Psychology",
        "pub_date": "2012/7/1",
        "description": "Little is known about air traffic controllers' preferred maneuvers to resolve conflicts between pairs of aircraft, despite the topic's importance of to the planned NextGen system. We analyzed 256 cases of conflict resolution maneuvering from radar track data from 5 U.S. air traffic control centers. Our results show the influences of conflict geometries on controllers' maneuver choices.",
        "citations": 26
    },
    {
        "title": "Human factors evaluation of pharmacy operations",
        "id": "gTRDElAAAAAJ:_xSYboBqXhAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:_xSYboBqXhAC",
        "authors": [
            "Esa Rantanen",
            "Joe Deeter",
            "Sean Burke",
            "Yao Wang"
        ],
        "pub_source": "2012 symposium on human factors and ergonomics in health care: Bridging the gap. Santa Monica: HFES",
        "pub_date": "2012/3/12",
        "description": "We performed a human reliability analysis of chemotherapy medication preparation for a comprehensive assessment of risks to both the pharmacy personnel and patients in a medium-sized hospital’s oncology department. We employed techniques such as hierarchical task analysis, concept maps, Reason’s (1990) Generic Error Modeling System (GEMS), and both qualitative and quantitative prospective Cognitive Reliability and Error Analysis Method (CREAM; Hollnagel, 1998).",
        "citations": 4
    },
    {
        "title": "Human reliability analysis in healthcare",
        "id": "gTRDElAAAAAJ:9ZlFYXVOiuMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:9ZlFYXVOiuMC",
        "authors": [
            "Joe Deeter",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of symposium on human factors and ergonomics in health care",
        "pub_date": "2012/3/12",
        "description": "The problem of medical error in healthcare is well documented. It is estimated that tens of thousands of people die annually from preventable medical error. For over ten years, a traditional Human Reliability Analysis (HRA) technique, the Root Cause Analysis (RCA) has been used in hospitals nationwide in an attempt to explain why these errors occur and what can be done to prevent them. Still, patient safety has not improved significantly. Traditional HRA techniques are limited as analysis tools. They do not consider the context in which workers operate. They are also not based on valid psychological models that can explain human cognitive function. The Cognitive Reliability and Analysis Method (CREAM) is a HRA technique that allows analysts to examine worker actions through the context of performance-shaping factors and is based on a model of human cognition. We reviewed 87 archived RCA reports conducted by a hospital in New York State and re-analyzed 58 cases using CREAM. Despite data limitations, we discovered a possible gap between the hospital’s RCAs and the results of the CREAM analyses. The gap suggests that the CREAM identified organizational and leadership factors contributing to the cause of medical error which the RCA process either minimized or ignored.",
        "citations": 22
    },
    {
        "title": "Analysis of hospital oncology department pharmacy operations",
        "id": "gTRDElAAAAAJ:ldfaerwXgEUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ldfaerwXgEUC",
        "authors": [
            "Esa Rantanen",
            "Joe Deeter",
            "Sean Burke",
            "Yao Wang"
        ],
        "pub_source": "Proceedings of Symposium on Human Factors and Ergonomics in Health Care",
        "pub_date": "2012",
        "description": "We performed a human reliability analysis of chemotherapy medication preparation for a comprehensive assessment of risks to both the pharmacy personnel and patients in a medium-sized hospital’s oncology department. We employed techniques such as hierarchical task analysis, concept maps, Reason’s (1990) Generic Error Modeling System (GEMS), and both qualitative and quantitative prospective Cognitive Reliability and Error Analysis Method (CREAM). Our results indicated that the pharmacist predominantly worked in tactical control mode, resulting in generally high performance reliability. We nevertheless identified several issues for risk mitigation and made recommendations for further improvement of safety of the pharmacy operation. This project highlights the benefits of systematic analyses of apparently routine operations. It also allowed us to evaluate both relative and combined merits of the methods used and test the feasibility of a novel technique, CREAM, in a healthcare application.",
        "citations": 2
    },
    {
        "title": "28 The Effect of Crowding on the Workload and the Perception of Workload in a Community Emergency Department",
        "id": "gTRDElAAAAAJ:pqnbT2bcN3wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:pqnbT2bcN3wC",
        "authors": [
            "SM Schneider",
            "K Coles",
            "E Rantanen",
            "RJ Fairbanks"
        ],
        "pub_source": "Annals of Emergency Medicine",
        "pub_date": "2011/10/1",
        "description": "Study ObjectivesCrowding of emergency departments (EDs) adversely affects patient safety, staff turnover and patient satisfaction. Our objective was to measure the changes in workload and perception of workload during ED crowding.MethodsDesign-The time on task, task type, interruptions, and the number of tasks performed by physicians (MDs) and midlevel providers (MLPs) were recorded during this observational study. Subjective workload was measured using the validated NASA-TLX score after each hour of observation. ED operational data were obtained from the EDIS system. Pearson correlation was used to analyze the results. IRB approval was obtained. Setting-The study was conducted in a community hospital with occasional resident or medical student coverage during a convenience sample of 42 hours between the hours of 8am and 1 am May 1 to August 31, 2009. This ED has a yearly volume of …",
        "citations": 1
    },
    {
        "title": "Individual differences in the effect of vertical separation on conflict detection in air traffic control",
        "id": "gTRDElAAAAAJ:O3NaXMp0MMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:O3NaXMp0MMsC",
        "authors": [
            "Stéphanie Stankovic",
            "Shayne Loft",
            "Esa Rantanen",
            "Nicolas Ponomarenko"
        ],
        "pub_source": "The International Journal of Aviation Psychology",
        "pub_date": "2011/10/1",
        "description": "This research examined individual differences in judgments of the risk of aircraft separation violation. Fourteen controllers were asked to judge the risk of conflict for aircraft pairs varying in geometry and vertical separation. A cluster analysis revealed individual differences in how judgments of conflict risk changed with increased vertical separation. There were no individual differences in conflict risk judgments when vertical separation was 0 ft. However, as vertical separation increased to 2,000 ft and 4,000 ft, some controllers made progressively lower judgments of conflict risk than others. These findings have implications for the design of automation tools and for training.",
        "citations": 7
    },
    {
        "title": "User experience with cybercollaboration technologies",
        "id": "gTRDElAAAAAJ:isC4tDSrTZIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:isC4tDSrTZIC",
        "authors": [
            "Esa M Rantanen",
            "Jessica L Smagner"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2011/9",
        "description": "A usability survey of various cybercollaboration techologies with 32 questions was created and administered through the Rochester Institute of Technology’s (RIT) Clipboard online survey tool. A total of 73 responses were received and analyzed. There was no participant consensus on what tools to include in “ideal” cybercollaborative environments. The inclusion or exclusion of specific tools and functionality are not critical to team success provided that basic affordances for document and data sharing are provided. Traditional usability issues were not widely cited as the main reason for a virtual team to be unsuccessful. The most critical aspects to ensure virtual team success were general communication and achieving consensus on the hypothesis. Therefore, “usability” in the broad sense of affording the effectiveness of collaboration through virtual environments can be best achieved through providing specific …",
        "citations": 4
    },
    {
        "title": "Educational and skill needs of new human factors/ergonomics professionals",
        "id": "gTRDElAAAAAJ:hqOjcs7Dif8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:hqOjcs7Dif8C",
        "authors": [
            "Esa M Rantanen",
            "William F Moroney"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2011/9",
        "description": "The Human Factors and Ergonomics Society’s Education and Training Committee and the Early Career Committee identified the need to evaluate the effectiveness of graduate education in the field of human factors/ergonomics and identify areas requiring improvement. Consequently, a survey was constructed for this purpose. Fifty-two new professionals responded to the survey. While most of these individuals come from the traditional fields of psychology and engineering, many represented multiple disciplines including architecture, safety, IT, and kinesiology. New professionals made heavy use of online non-refereed sources as well as professional websites. While no particular topic in their college experience was deemed superfluous, they indicated a need for design experiences, exposure to the processes used in the “hard “ engineering disciplines, how to communicate as a member of an interdisciplinary team …",
        "citations": 25
    },
    {
        "title": "Data Mining Techniques to Derive Human and System Performance Measures of Air Traffic Control from Operational Data",
        "id": "gTRDElAAAAAJ:WA5NYHcadZ8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:WA5NYHcadZ8C",
        "authors": [
            "Esa Rantanen",
            "Ernest Fokoue"
        ],
        "pub_source": "16th International Symposium on Aviation Psychology",
        "pub_date": "2011",
        "description": "The capabilities of the envisioned performance management services of the NextGen may offer means for testing of measures of human performance derived from operational data and allow for longitudinal studies on the effects of operational NextGen on human operators. Time-based metrics offer an attractive solution to measurement challenges of the NextGen, given the dynamic nature of the system, its dependence on severe time constraints, and the role of time in critical aspects of human performance, mainly workload and situation awareness. Due to potentially very high number of variables and complexity of the underlying data structure that render standard statistical techniques inadequate, novel techniques that perform nonlinear regression and pattern recognition along with feature selection and variable selection are potential candidates for such analyses. Promising statistical techniques to handle the many problems associated with these kinds of data include Generalized Linear and Generalized Linear Mixed Models, and Support Vector Machines."
    },
    {
        "title": "Conflict Detection in Air Traffic Conrol: Distuinguishing Between Judgments of Conflict Risk and Intervention Decisions",
        "id": "gTRDElAAAAAJ:t6usbXjVLHcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:t6usbXjVLHcC",
        "authors": [
            "Stéphanie Stankovic",
            "Esa Rantanen",
            "Nicolas Ponomarenko"
        ],
        "pub_source": "16th International Symposium on Aviation Psychology",
        "pub_date": "2011",
        "description": "This paper seeks to make a distinction between cognitive processes involved in conflict risk judgment and those involved in conflict avoidance decisions (controllers’ interventions for separation assurance). First, we conducted a systematic review of the conflict detection literature to identify studies that focused on conflict risk assessments and studies that focused on conflict avoidance (intervention). We then report empirical data pertaining to controller intervention judgments. Studies on conflict avoidance have rarely described the intervention decision making process and its interaction with the conflict risk assessment process, whereas our data indicated differences in terms of information processing between judgments of conflict risk and intervention judgments. We provide recommendation for future studies on conflict detection and conflict avoidance. These findings also have implications for the development of automated conflict detection tools."
    },
    {
        "title": "Human Reliability Analysis in Healthcare",
        "id": "gTRDElAAAAAJ:Tiz5es2fbqcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Tiz5es2fbqcC",
        "authors": [
            "Esa M Rantanen",
            "Joe Deeter"
        ],
        "pub_source": "",
        "pub_date": "2011",
        "description": "The problem of human error in healthcare is well documented. Other domains (such as transportation and energy) have used techniques and methods from the engineering disciplines to analyze and ultimately reduce instances of error. In New York State (NYS), the Department of Health (DOH) requires the use of one such method, Root Cause Analysis (RCA), in investigating and reporting the occurrence of and response to sentinel events by hospitals. Despite the use of the RCA technique in an attempt to identify and mitigate the root causes of error, the problem of human error contributing to sentinel events persists. Experts in Human Reliability Analysis (HRA) contend that human performance is too complex to be represented by models used in engineering systems reliability. A method to analyze human erroneous actions was created that considers operator context and control based on a model of human cognition. The technique, called the Cognitive Reliability and Error Analysis Method (CREAM), was used to reanalyze 58 sentinel event cases Rochester General Hospital previously analyzed using RCA. Despite serious data limitations, our results reveal an apparent gap between RCA and CREAM analyses. We suggest that the gap highlights incomplete RCA that minimizes or does not appreciate the role that organizational factors play in contributing to the sentinel events. Due to data limitations, we cannot identify specific interventions to mitigate risk for sentinel events. However, we make several recommendations for improving the RCA process at Rochester General Hospital in an effort to improve the validity of the analyses data for further …"
    },
    {
        "title": "Are There Standard Conflict Resolution Maneuvers in Air Traffic Control?",
        "id": "gTRDElAAAAAJ:NaGl4SEjCO4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:NaGl4SEjCO4C",
        "authors": [
            "Esa M Rantanen",
            "Christopher D Wickens"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2010/9",
        "description": "We analyzed samples of aircraft track data involving conflict alerts and subsequent resolution maneuvers from five U.S. air route traffic control centers. Vertical conflict resolution maneuvers were used in the majority of the cases examined. Within the vertical dimension, reductions of current vertical change (climb or descent) were collectively the most frequent resolution maneuver type, but descents were about three times as frequent as climbs. Three contingency analyses were performed to test for independence between conflict geometries and subsequent resolution maneuvers. The results show that conflict resolution maneuvers do not seem to be independent from conflict geometries. Additional analyses on conflict angles and vertical speed differences between aircraft as continuous variables revealed disproportionately fewer turns on crossing courses than on opposite or same courses. These results provide …",
        "citations": 1
    },
    {
        "title": "Multiple identity tracking and entropy in an ATC-like task",
        "id": "gTRDElAAAAAJ:j3f4tGmQtD8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:j3f4tGmQtD8C",
        "authors": [
            "Ryan M Hope",
            "Esa M Rantanen",
            "Lauri Oksama"
        ],
        "pub_source": "Proceedings of the human factors and ergonomics society annual meeting",
        "pub_date": "2010/9",
        "description": "This research investigated an observer's ability to track and maintain multiple uniquely identified objects in a dynamic environment similar to ATC. The experimental task consisted of tracking a set of moving objects for twenty seconds. The objects were 6-character strings; three letters followed by three numbers. After tracking the objects for twenty seconds, the participants were instructed to locate a target-object. The time required to find the target object was recorded. The number of objects and the magnitude of direction changes (entropy) were manipulated. We found (1) a highly significant effect of increasing response times as a function of number of objects, (2) a marginally significant effect of entropy, decreasing response times as a function of entropy, and (3) a significant effect of displacement, increasing response times as a function of objects' displacement.",
        "citations": 8
    },
    {
        "title": "Gestural interaction with in-vehicle audio and climate controls",
        "id": "gTRDElAAAAAJ:qUcmZB5y_30C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:qUcmZB5y_30C",
        "authors": [
            "Chongyoon Chung",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2010/9",
        "description": "Among the most distractive in-vehicle interactions are audio and climate controls. If these interactions were as easy and spontaneous as natural language, driving could be much safer. Through this research it was found that drivers preferred gestural language to voice language when the control was simple and repetitive; subsequently, gestural interactions with secondary in-vehicle tasks were investigated. Following the principle of “eyes on the road and hands on the wheel”, a steering wheel design with two touch pads on the wheel to recognize gestures was conceived. The physical design of the steering wheel incorporated good ergonomics and anthropometric data, while gesture stereotypes assigned to a number of in-vehicle controls were determined empirically by two experiments. The new steering wheel design does not have any buttons, which may contribute to driver distraction, yet it incorporates 19 …",
        "citations": 7
    },
    {
        "title": "The impact of time efficacy on air traffic controller situation awareness and mental workload",
        "id": "gTRDElAAAAAJ:3fE2CSJIrl8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:3fE2CSJIrl8C",
        "authors": [
            "Jiazhong Yang",
            "Esa M Rantanen",
            "Kan Zhang"
        ],
        "pub_source": "The International Journal of Aviation Psychology",
        "pub_date": "2009/12/30",
        "description": "Time efficacy reflects people's perception of control time and evaluation of time management behaviors, and potentially influences situation awareness (SA) and mental workload experienced by air traffic controllers. In this study, a total of 31 air traffic controller trainees, assigned to a high or low time efficacy group, completed 2 scenarios with few or many aircraft simultaneously in the sector. The results showed that the high time efficacy group maintained better SA and experienced lower mental workload. The findings have implications for the selection, training, and work shift arrangements of air traffic controllers.",
        "citations": 28
    },
    {
        "title": "Creativity and design: Creativity's new definition and its relationship to design",
        "id": "gTRDElAAAAAJ:JV2RwH3_ST0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:JV2RwH3_ST0C",
        "authors": [
            "Samuel J Brougher",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2009/10",
        "description": "Creativity is often defined in ways that are neither useful nor operationalizable. We proposed a new definition for creativity that incorporates the Skills-Rules-Knowledge model of Rasmussen (1983). We then examine the tests of creativity and real world design problems alongside each other with this new definition in mind. Participants completed six different creativity tests, including the design problems. The tests were scored on the basis of five domains of creativity. Answers to questions an individual had seen previously were not included in data analysis. We expect to find that all measures of creativity correlate weakly with each other, and spatial, nonentrenchment, and original types of creativity correlate more highly with design than other types, providing further evidence for the importance of creativity for designers and engineers.",
        "citations": 9
    },
    {
        "title": "Do velocity vectors support multiple object tracking?",
        "id": "gTRDElAAAAAJ:TFP_iSt0sucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:TFP_iSt0sucC",
        "authors": [
            "Krista Oinonen",
            "Lauri Oksama",
            "Esa Rantanen",
            "Jukka Hyönä"
        ],
        "pub_source": "Proceedings of the human factors and ergonomics society annual meeting",
        "pub_date": "2009/10",
        "description": "We examined the effect of velocity vectors on human ability to extrapolate movement of multiple moving objects. This was achieved using an identity tracking task, in which objects (line-drawings of familiar objects) first move for 5 s, after which they temporarily disappear from view. In order to examine different aspects of vector information, we compared 4 velocity vector conditions: (1) no vectors were displayed; (2) only a history trail was displayed; (3) a condition where the end of the velocity vector pointed to exactly where the objects would reappear after the masking; (4) a constant heading length was displayed. Based on recent studies on Keane and Pylyshyn (2006) and Oinonen et al. (2009), we hypothesized that the condition, where exact location information is presented, would improve performance compared to baseline. The results supported this hypothesis by indicating that history trail or directional vector …",
        "citations": 3
    },
    {
        "title": "Measurement of temporal awareness in air traffic control",
        "id": "gTRDElAAAAAJ:r0BpntZqJG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:r0BpntZqJG4C",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2009/10",
        "description": "Temporal awareness, or level 3 situation awareness, is critical to successful control of air traffic, yet the construct remains ill-defined and difficult to measure. This research sought evidence for air traffic controllers' awareness of temporal characteristics of their tasks in data from a high-fidelity system evaluation simulation. Five teams of controllers worked on four scenarios with different traffic load. Several temporal parameters were defined for each task controllers performed during a simulation run and their actions on the tasks were timed relative to them. Controllers showed a strong tendency to prioritize tasks according to a first come, first served principle. This trend persisted as task load increased. Also evident was awareness of the urgency of tasks, as tasks with impending closing of a window of opportunity were performed before tasks that had longer time available before closing of the window.",
        "citations": 5
    },
    {
        "title": "Test of risk judgment models of conflict detection in air traffic control",
        "id": "gTRDElAAAAAJ:WqliGbK-hY8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:WqliGbK-hY8C",
        "authors": [
            "S Stankovic",
            "EM Rantanen",
            "S Loft"
        ],
        "pub_source": "",
        "pub_date": "2009/1/1"
    },
    {
        "title": "Maneuver Stereotypes in Airborne Conflict Resolutions",
        "id": "gTRDElAAAAAJ:HE397vMXCloC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:HE397vMXCloC",
        "authors": [
            "Esa M Rantanen",
            "Christopher D Wickens",
            "David Keller"
        ],
        "pub_source": "2009 International Symposium on Aviation Psychology",
        "pub_date": "2009",
        "description": "The roles and responsibilities of air traffic controllers and pilots are shifting in the advent of the NextGen air traffic management infrastructure, which also involves high levels of automation. It is important to understand just how large departures from the current ingrained practices the NextGen procedures represent, particularly in extremely safetycritical tasks such as airborne conflict resolutions. Pilots’ conflict resolution maneuver preferences have received some attention, but corresponding research on air traffic controllers’ practices is almost nonexistent. We analyzed 87 samples of aircraft track data involving conflict alerts and subsequent resolution maneuvers from Atlanta center. Vertical conflict resolution maneuvers were used in the majority of the cases examined. Within the vertical dimension, reductions of current vertical change (climb or descent) were collectively the most frequent resolution maneuver type, but descents were twice as frequent as climbs. Conflict resolution maneuvers furthermore do not seem to be independent from conflict geometries."
    },
    {
        "title": "Determinants of Conflict Risk Judgments in Air Traffic Control",
        "id": "gTRDElAAAAAJ:tOudhMTPpwUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:tOudhMTPpwUC",
        "authors": [
            "Stéphanie Stankovic",
            "Esa Rantanen",
            "Nicolas Ponomarenko",
            "Shayne Loft"
        ],
        "pub_source": "2009 International Symposium on Aviation Psychology",
        "pub_date": "2009",
        "description": "The aim of the study was to identify the determinants of conflict risk judgments in air traffic control. Fourteen expert controllers made conflict risk judgments about air traffic situations in which three variables (conflict geometry, time of closest point of approach or TCPA, and vertical separation between aircraft) were manipulated. The results indicate that conflict geometry, TCPA, and the vertical separation between aircraft significantly influenced judgments of conflict risk. In addition, there was a significant interaction between these three variables. Risk perception was largest under conditions where aircraft were on the same headings, with short TCPA, and no minimum vertical separation. The study was successful in determining what factors of air traffic scenarios increased subjective risk judgments in air traffic control."
    },
    {
        "title": "Cognitive task analysis of electric power system control center operations",
        "id": "gTRDElAAAAAJ:NMxIlDl6LWMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:NMxIlDl6LWMC",
        "authors": [
            "Esa M Rantanen",
            "Jonathan A Winkle",
            "Thomas J Overbye"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 52 …",
        "pub_date": "2008/9",
        "description": "A cognitive task analysis of reliability coordinators in an electric power system control center was performed in conjunction with evaluation of three novel display solutions for line overload detection and correction. Eight experienced regional operations center operators participated in the study. The operators were shown two different geographic data view displays and a tabular, text-based tool, and interviewed as they solved three different transmission line overload problems using the different displays and tools. The operators were asked to think aloud as they performed the tasks. Their comments were recorded and transcribed, and used as a basis for the cognitive task analysis. The results indicated that although the operators liked the system data visualization approaches, they also placed high value on tabular presentation of text-based and numerical data. Visualization solutions should therefore be used to …",
        "citations": 4
    },
    {
        "title": "Designing external aids that support older pilots' communication",
        "id": "gTRDElAAAAAJ:dhFuZR0502QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:dhFuZR0502QC",
        "authors": [
            "Daniel Morrow",
            "Christopher Wickens",
            "Esa Rantanen",
            "Dervon Chang",
            "Jamie Marcus"
        ],
        "pub_source": "The International Journal of Aviation Psychology",
        "pub_date": "2008/3/19",
        "description": "Voice communication with air traffic control (ATC) taxes pilots' cognitive abilities, contributing to errors that reduce safety. External aids such as note-taking help pilots manage communication demands, and may especially benefit older pilots. Emerging technologies provide new opportunities for external aids that are integrated with other systems. We compared an electronic notepad (epad) positioned next to the instrument panel of a flight simulator to conventional note-taking (kneepad) on a read-back task. In Experiment 1, 6 older and 6 younger instrument-rated pilots listened to and read back ATC messages while using the epad, kneepad, or no aid. Epad use in this communication-only condition was compared to a condition in which pilots used the epad to support communication while flying the simulator. Read-back accuracy was higher when pilots used either aid compared to no aid, and the pattern of results …",
        "citations": 12
    },
    {
        "title": "Development of air traffic control measures database",
        "id": "gTRDElAAAAAJ:iH-uZ7U-co4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:iH-uZ7U-co4C",
        "authors": [
            "Esa M Rantanen",
            "Peter M Vlach"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 51 …",
        "pub_date": "2007/10",
        "description": "Availability of measures that would predict controller success in his or her task and the impact of changing procedures and advancing technology on the system as a whole is imperative to the success of modernization of air traffic control (ATC) systems worldwide. This paper describes a database that is populated by the results of previous reviews of ATC research literature, organized according to a novel ATC measures taxonomy, and made accessible via the World Wide Web and a purpose-built web interface. The database will also facilitate continual updates, allowing for growth and relevance of its contents into the foreseeable future.",
        "citations": 5
    },
    {
        "title": "Evaluation of a software implementation of the cognitive reliability and error analysis method (CREAM)",
        "id": "gTRDElAAAAAJ:kNdYIx-mwKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:kNdYIx-mwKoC",
        "authors": [
            "Roger D Serwy",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the human factors and ergonomics society annual meeting 51 …",
        "pub_date": "2007/10",
        "description": "The Cognitive Reliability and Error Analysis Method (CREAM) represents a second-generation approach to human reliability analysis (HRA). The method, however, is very tedious to apply manually and not yet in widespread use and therefore largely untested. To allow for rapid and systematic evaluation of the CREAM method, a software tool for its application was developed. Results from several analyses undertaken to evaluate the method and the tool are also presented. The simplicity of our CREAM software allowed novices to analyze events in much detail but also revealed some critical shortcomings in both the method and the software tool. Several conclusions could be drawn from this allow for drafting of specific design guidelines for future upgrades of the CREAM software. These conclusions and recommendations can be further generalized to all software applications of HRA methods",
        "citations": 23
    },
    {
        "title": "Electric power control center visualization using geographic data views",
        "id": "gTRDElAAAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Thomas J Overbye",
            "Esa M Rantanen",
            "Steve Judd"
        ],
        "pub_source": "2007 iREP Symposium-Bulk Power System Dynamics and Control-VII. Revitalizing Operational Reliability",
        "pub_date": "2007/8/19",
        "description": "The paper introduces a new technique for power system visualization known as geographic data views, or GDVs. The impetus behind the development of GDVs is to use dynamically created visualization in order to show a wider range of power system information than is possible using the existing geographically based wide-area visualizations that are becoming common in electric power control centers. With the GDV approach power system visualizations can be dynamically created by operators or engineers using power system information along with geographic information imbedded in the power system model. The paper demonstrates the approach for several sample data sets.",
        "citations": 78
    },
    {
        "title": "Effects of air traffic geometry on pilots' conflict detection with cockpit display of traffic information",
        "id": "gTRDElAAAAAJ:zYLM7Y9cAGgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:zYLM7Y9cAGgC",
        "authors": [
            "Xidong Xu",
            "Esa M Rantanen"
        ],
        "pub_source": "Human factors",
        "pub_date": "2007/6",
        "description": "Objective This experiment attempted to identify the features of air traffic geometry that would influence the difficulty and biases of pilots' conflict detection using a cockpit display of traffic information (CDTI). Background There was previously no systematic study on effects of such features on conflict detection using the CDTI. Method Twenty-four pilots viewed dynamic encounters between their own aircraft and an intruder aircraft on a simulated CDTI; difficulty was varied by the intruder aircraft's distance and time to closest point of approach (CPA), relative speed, miss distance at CPA, approach side, and conflict angle. Participants estimated the intruder's location at, and its time to, CPA. Effects on three estimation error measures were explored: intruder's miss distance at CPA, orientation at CPA, and time to CPA. Results (a) Estimation errors increased with slower speeds, longer times to CPA, and longer distances to …",
        "citations": 36
    },
    {
        "title": "Those Who Shield Others Are Users Too! Experience from User Studies of Security SysAdmins",
        "id": "gTRDElAAAAAJ:BqipwSGYUEgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:BqipwSGYUEgC",
        "authors": [
            "William Yurcik",
            "R Thompson",
            "Esa Rantanen"
        ],
        "pub_source": "CHI Work. Secur. User Stud",
        "pub_date": "2007/5",
        "description": "System administrators are users too and there have been few user studies of them in the security domain. This paper describes the challenges we faced in designing and performing studies of security system administrators using visualization tools as well as our experiences in addressing these challenges.",
        "citations": 1
    },
    {
        "title": "Command line or pretty lines? Comparing textual and visual interfaces for intrusion detection",
        "id": "gTRDElAAAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:qjMakFHDy7sC",
        "authors": [
            "Ramona Su Thompson",
            "Esa M Rantanen",
            "William Yurcik",
            "Brian P Bailey"
        ],
        "pub_source": "Proceedings of the SIGCHI conference on Human factors in computing systems",
        "pub_date": "2007/4/29",
        "description": "Intrusion detection (ID) is one of network security engineers' most important tasks. Textual (command-line) and visual interfaces are two common modalities used to support engineers in ID. We conducted a controlled experiment comparing a representative textual and visual interface for ID to develop a deeper understanding about the relative strengths and weaknesses of each. We found that the textual interface allows users to better control the analysis of details of the data through the use of rich, powerful, and flexible commands while the visual interface allows better discovery of new attacks by offering an overview of the current state of the network. With this understanding, we recommend designing a hybrid interface that combines the strengths of textual and visual interfaces for the next generation of tools used for intrusion detection.",
        "citations": 50
    },
    {
        "title": "Effects of conflict alerting system reliability and task difficulty on pilots' conflict detection with cockpit display of traffic information",
        "id": "gTRDElAAAAAJ:UeHWp8X0CEIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:UeHWp8X0CEIC",
        "authors": [
            "Xidong Xu",
            "Christopher D Wickens",
            "Esa M Rantanen"
        ],
        "pub_source": "Ergonomics",
        "pub_date": "2007/1/15",
        "description": "A total of 24 pilots viewed dynamic encounters between their own aircraft and an intruder aircraft on a 2-D cockpit display of traffic information (CDTI) and estimated the point and time of closest approach. A three-level alerting system provided a correct categorical estimate of the projected miss distance on 83% of the trials. The remaining 17% of alerts were equally divided between misses and false alarms, of large and small magnitude. Roughly half the pilots depended on automation to improve estimation of miss distance relative to the baseline pilots, who viewed identical trials without the aid of automated alerts. Moreover, they did so more on the more difficult traffic trials resulting in improved performance on the 83% correct automation trials without causing harm on the 17% automation-error trials, compared to the baseline group. The automated alerts appeared to lead pilots to inspect the raw data more closely …",
        "citations": 47
    },
    {
        "title": "Relative Importance of Conflict Geometry Variables in Influencing Pilots’ Conflict Detection Using a Cockpit Display of Traffic Information",
        "id": "gTRDElAAAAAJ:XiVPGOgt02cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:XiVPGOgt02cC",
        "authors": [
            "Xidong Xu",
            "Esa M Rantanen",
            "Yan Huo"
        ],
        "pub_source": "2007 International Symposium on Aviation Psychology",
        "pub_date": "2007",
        "description": "When independent variables are inter-correlated with each other, ANOVAs or traditional multiple regression methods do a poor job for analyzing their relative importance in accounting for the variance in a dependent variable. This paper describes a method called Dominance Analysis (Budescu, 1993; Azen & Budescu, 2003) as a better approach than the traditional methods in determining the relative importance of several inter-correlated independent variables in accounting for the variances in pilots’ performance measures in a conflict detection task with a cockpit display of traffic information (Xu, Rantanen, & Wickens, 2004). The three variables in question were an intruder aircraft’s distance to closest point of approach (CPA) between the pilot’s ownship and the intruder aircraft, the intruder aircraft’s time to CPA, and relative speed between the two aircraft. Results indicate (1) for absolute miss distance estimate error, distance to CPA was the most important variable than the other two variables;(2) for signed miss distance estimate error, time to CPA and distance to CPA were more important than relative speed;(3) for both absolute and signed time to CPA estimate errors, time to CPA was the most important compared to the other two variables; and (4) for absolute orientation at CPA estimate error, relative speed was the least important variable compared to distance to CPA and time to CPA. Interpretations of the dominance analysis results are offered.",
        "citations": 1
    },
    {
        "title": "Evaluation of the SEEV model of visual attention allocation in ATC applications",
        "id": "gTRDElAAAAAJ:bnK-pcrLprsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:bnK-pcrLprsC",
        "authors": [
            "Angela Schriver",
            "Esa Rantanen"
        ],
        "pub_source": "2007 International symposium on aviation psychology",
        "pub_date": "2007",
        "description": "Visual attention allocation and scanning strategies of pilots have enjoyed sustained research effort for decades, resulting in many useful models and better understanding of the relationship between pilots’ eye movements and underlying cognitive mechanisms. However, much less research has been done on modeling air traffic controllers’ attentional processes and visual performance. Yet, such efforts are becoming increasingly critical in the light of changing tasks and task environments of controllers and increasing amounts of traffic under their responsibility. This paper will consider the SEEV (Salience, Effort, Expectancy, Value) model of visual attention allocation by Wickens and collaborators, which is an extension of Senders’ and Carbonell’s original model, as it is applied to air traffic control (ATC). The SEEV model integrates a comprehensive set of features influencing visual attention allocation and is thus an attractive candidate for modeling also air traffic controllers’ behavior and performance. We discuss many unique characteristics of ATC and focus on three particular challenges to applying the SEEV model to ATC tasks presented in the literature: uncertainty, time pressure and workload.",
        "citations": 4
    },
    {
        "title": "Temporal awareness in ATC: Literature review and a proposed model",
        "id": "gTRDElAAAAAJ:5ugPr518TE4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:5ugPr518TE4C",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "2007 International Symposium on Aviation Psychology, 570",
        "pub_date": "2007",
        "description": "Air traffic control (ATC) offers a paradigmatic example of a dynamic multi-task environment, placing both considerable and unique demands on the human controllers’ cognitive faculties. In particular, the notion of temporal awareness, which is argued here to be fundamental to both controller workload management and task performance, brings together many of the most central components of human information processing system. The temporal dimension of ATC offers thus both a rich task environment for the study of temporal awareness and the associated cognitive processes as well as affords their quantitative measurement for modeling purposes. This paper makes a case for focused research of temporal awareness in ATC and presents a framework for development of time-based controller performance metrics and testing of cognitive models of temporal awareness.",
        "citations": 1
    },
    {
        "title": "Aviation Technologies and Human Error: a Research Literature Database and Analysis",
        "id": "gTRDElAAAAAJ:wbdj-CoPYUoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:wbdj-CoPYUoC",
        "authors": [
            "Christopher M Johnson",
            "Esa M Rantanen",
            "Stuart L Moment"
        ],
        "pub_source": "2007 International Symposium on Aviation Psychology",
        "pub_date": "2007",
        "description": "Technological interventions are commonly introduced in aviation to prevent or mitigate human errors. Such interventions, however, may also create new opportunities for error and even result in new error types. To examine the relationship between human errors and technological ‘fixes’, a research literature database was created that links them together within a three-dimensional matrix, with axes for the human operator, the task, and the environment. Each of these axes, as well as the errors and technologies included in the database, are furthermore organized according to specific taxonomies. To allow for universal access to the database as well as to facilitate widely distributed contributions to its content, the database was published on the World Wide Web via a specifically designed interface. In this paper we describe the development of the web interface and evaluate the usability of the database, including both data entry and query functions."
    },
    {
        "title": "Effectiveness of a Personal Computer Aviation Training Device, a Flight Training Device, and an Airplane in Conducting Instrument Proficiency Checks. Volume 1. Subjective Pilot …",
        "id": "gTRDElAAAAAJ:l7t_Zn2s7bgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:l7t_Zn2s7bgC",
        "authors": [
            "TW EMANUEL",
            "EM RANTANEN",
            "DA TALLEUR",
            "HL TAYLOR"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "This study was prompted by the FAA Advisory Circular (AC) No. 61-126 (1997), which authorized the use of a Personal Computer Aviation Training Device (PCATD) to be used for 10 of the 15 hours authorized for an approved ground training device. The advisory circular, however, did not authorize the use of PCATDs for Instrument Proficiency Checks (IPCs). The study was supported under Federal Aviation Administration (FAA) cooperative agreement DFTA2001-G-037 with the Institute of Aviation, University of Illinois at Urbana-Champaign, during September 2001-November 2004. The study was sponsored by FAA Headquarters Flight Standards Service, General Aviation and Commercial Division. Dennis B. Beringer, Civil Aerospace Medical Institute (CAMI), served as the contracting officers technical representative for FAA-CAMI. This report is Volume 1 of a two volume final report and is in the process of review …"
    },
    {
        "title": "Effectiveness of a Personal Computer Aviation Training Device, a Flight Training Device, and an Airplane in Conducting Instrument Proficiency Checks. Volume 2. Objective Pilot …",
        "id": "gTRDElAAAAAJ:bFI3QPDXJZMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:bFI3QPDXJZMC",
        "authors": [
            "NR JOHNSON",
            "E RANTANEN",
            "DA TALLEUR"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "This research was prompted by the FAA Advisory Circular (AC) No. 61-126 (1997), which authorized the use of a Personal Computer Aviation Training Device (PCATD) to be used for 10 of the 15 hours authorized for an approved ground training device, but not for Instrument Proficiency Checks (IPCs). The research was supported under Federal Aviation Administration (FAA) cooperative agreement DFTA2001-G-037 with the Institute of Aviation, University of Illinois at Urbana-Champaign, during September 2001-November 2004. The study was sponsored by FAA Headquarters Flight Standards Service, General Aviation and Commercial Division. Dennis B. Beringer, Civil Aerospace Medical Institute (CAMI), served as the contracting officers technical representative. This report is Volume 2 of a two-volume final report. It is in the process of review and approval and is not at present an official FAA document. Consequently, the views expressed herein do not necessarily represent official FAA positions. Volume 1 covered results obtained from subjective pilot performance measures by certified flight instructors, instrument (CFII), who conducted the IPC flights for the study participants. This volume (Vol. 2) will describe objective pilot performance measures developed for the project and the results that they yielded. Published reports and presentations of the work on development of objective pilot performance measures are listed in this document."
    },
    {
        "title": "Effect of Audio Throughput Delay of the NEXCOM System on Air Traffic Controller Performance and Workload.",
        "id": "gTRDElAAAAAJ:pyW8ca7W8N0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:pyW8ca7W8N0C",
        "authors": [
            "J MCCARLEY",
            "E RANTANEN",
            "X XU",
            "S YEAKEL"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "Two experiments were conducted to investigate the impact of an additional audio delay (AD) in the pilot controller communication loop brought about by the NEXCOM technology on air traffic controllers. performance, workload, and subjective acceptability. The experiments modeled two scenarios where AD would have dire effect on controller performance and system safety, a final sequencing task in Experiment 1 and a conflict resolution task in Experiment 2. The independent variables were same in both experiments: Four levels of AD were employed, a 150 ms delay, representing the present analog system, 250 ms, 350 ms, and 1,000 ms delay. The last condition represented the maximum delay associated with the system. Two levels of random pilot delay(PD) were also employed, zero delay and realistic delay. The zero delay condition allowed investigation of the impact of the different AD levels in isolation, while the random PD condition represented a realistic communication environment. Eight experienced controllers participated in both experiments."
    },
    {
        "title": "Effectiveness of Flight Training Devices Used for Instrument Training.",
        "id": "gTRDElAAAAAJ:yD5IFk8b50cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:yD5IFk8b50cC",
        "authors": [
            "TW EMANUEL",
            "E RANTANEN",
            "DA TALLEUR",
            "HL TAYLOR"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "The effectiveness of ground-based flight training devices in teaching flying skills is measured by transfer of training, quantifiable by a transfer effective ratio (TER). The incremental transfer effectiveness ratio (ITER) determines the transfer effectiveness of successive increments of training in the ground trainer. Previous research on a personal computer based aviation training device (PCATD) has shown that this device is effective for teaching instrument tasks (Taylor et al., 1996; 1999). In a later study as predicted by the incremental transfer of training theory of Roscoe (1971)., the greatest transfer of training effect was found for the group that received five hours compared to 10 and 15 hours of prior PCATD training in an airplane (Taylor et al., 2002b). In some cases the results indicate a complex pattern supporting the notion that more training in a PCATD is not necessarily better. The research reported here sought to …"
    },
    {
        "title": "Estimation of Conflict Risk Using Cockpit Displays of Traffic Information.",
        "id": "gTRDElAAAAAJ:2P1L_qKh6hAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:2P1L_qKh6hAC",
        "authors": [
            "E RANTANEN",
            "CD WICKENS",
            "X XU"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "This report describes an experiment that evaluated pilots' ability to understand and detect air traffic conflicts on a cockpit display of traffic information (CDTI), without the aid of an automated conflict alerting system. This ability was manifested in estimation accuracy of three continuous variables: miss distance at closest point of approach, time to closest point of approach, and orientation at closest point of approach. Twenty-four licensed pilots viewed a series of dynamic encounters on a 2-D CDTI. The scenarios varied widely in their difficulty, influenced by horizontal conflict geometry (conflict angle, speed, miss distance at closest approach of approach, and distance and time till closest point of approach). Pilots were asked to estimate the point and time of closest approach at varying times before that point was reached. The results indicated that (1) decreased estimation accuracy was associated with conflicts that occurred with slower speeds, a longer time into the future, and a longer distance into the future; (2) a tendency for pilots' judgments often to be conservative, judging that conflicts were both more risky and would occur sooner than was actually the case; and (3) a 'distance-overspeed' bias, such that two aircraft viewed farther apart and converging rapidly were perceived as less risky than two aircraft that were closer and converging slower, even though the time till a conflict occurred was identical. Finally, the cognitive mechanisms that underlie the biases observed in this study are discussed."
    },
    {
        "title": "If you can't beat'em, join'em: combining text and visual interfaces for security-system administration",
        "id": "gTRDElAAAAAJ:hC7cP41nSMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:hC7cP41nSMkC",
        "authors": [
            "William Yurcik",
            "Ramona Su Thompson",
            "Michael B Twidale",
            "Esa M Rantanen"
        ],
        "pub_source": "interactions",
        "pub_date": "2007/1/1",
        "description": "NUTS+ BOLTS interactions/ january+ february 2 0 0 7 der previous ones obsolete, so there is continuous relearning. We believe we have developed a visual tool that will make a difference—but acceptance has been slow. VisFlowConnect-IP was developed during 2003-2004 based on requirements gathered from security-system administrators [7]. The tool design was successful as a research activity, generating several peer-reviewed papers, it has been packaged for point-and-click installation, results from pilot studies with targeted users are very encouraging, and we are spreading the word at conferences and via mailing lists. VisFlowConnect-IP answers the basic question: Who is connecting to whom on my network—information which is highly relevant for most security events. The tool is free and downloadable from the Internet. So why aren’t more system administrators using our tool?",
        "citations": 6
    },
    {
        "title": "Stockastic hybrid models with applications to air traffic management",
        "id": "gTRDElAAAAAJ:IWHjjKOFINEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:IWHjjKOFINEC",
        "authors": [
            "Asal Naseri",
            "Natasha Neogi",
            "Esa Rantanen"
        ],
        "pub_source": "AIAA Guidance, Navigation and Control Conference and Exhibit",
        "pub_date": "2007",
        "description": "The ability to model, analyze, simulate and verify realistic air traffic management conflict detection scenarios in a scalable, composable, multi-aircraft fashion is an extremely difficult endeavor. Verifiably accurate techniques for aircraft mode detection are critical in order to enable the accurate projection of aircraft conflicts, and for the enactment of altitude separation resolution strategies. The introduction of a hybrid formalism encompassing hidden Markov modeling enables us to tune the discrete and continuous parameters of a stochastic hybrid hidden Markov model (HHMM) in order to perform mode detection upon actual flight track data. Two different formats of air traffic data are used to tune the models, allowing for the refinement of the differential equations governing the HHMM, thereby leading to an increased resolution capability, and resulting in a decreased latency for mode detection. The HHMM is evaluated …",
        "citations": 10
    },
    {
        "title": "Evaluation of airspace complexity and dynamic density metrics derived from operational data",
        "id": "gTRDElAAAAAJ:M3ejUd6NZC8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:M3ejUd6NZC8C",
        "authors": [
            "Esa M Rantanen",
            "Asal Naseri",
            "Natasha Neogi"
        ],
        "pub_source": "Air Traffic Control Quarterly",
        "pub_date": "2007/1",
        "description": "Mental workload experienced by air traffic controllers cannot be measured directly but may be inferred from observable performance or task load imposed on them by volume and complexity of traffic. This research evaluated several measures used to quantify the aforementioned variables. Data were obtained from Indianapolis (ZID) and Kansas City (ZKC) centers and processed by a modified objective activity and task load assessment program, POWER. We compared sectors with different characteristics to measures of pilot-controller communications and to sector complexity metrics, derived from the POWER output. Results from ZKC data were evaluated against subjective workload ratings. The ZID results were consistent with the different characteristics of the selected sectors. Dynamic density correlated with subjective workload estimates and controller transmission durations, known to be a workload indicator …",
        "citations": 11
    },
    {
        "title": "Development and Validation of Objective Performance and Workload Measures in Air Traffic Control.",
        "id": "gTRDElAAAAAJ:Se3iqnhoufwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Se3iqnhoufwC",
        "authors": [
            "Esa Rantanen"
        ],
        "pub_source": "",
        "pub_date": "2007",
        "description": "The current POWER suite of air traffic control (ATC) metrics includes such measures as traffic count, control duration, and variability in aircraft headings, altitudes, and speeds, as well as latencies of handoff initiation and acceptance, as well as records of a number of different controller activities. While these measures yield a reasonably detailed picture of events in a sector during the recording period, there is a substantial gap between them and measures of real interest, for example, measures of sector complexity and controller workload, situation awareness, and performance. Hence, although vast amounts of objective data are potentially available from operational ATC system, derivation of valid, reliable, and meaningful measures from them remains a problem. This problem is particularly pronounced when variables of interest are not directly measurable, such as controller workload and performance. This project represents an emphatically systematic and comprehensive approach to the measurement problem in ATC. The project involved many subtasks. The body of literature on ATC research was organized into taxonomy of ATC measures. Development of criteria for POWER measures was approached in the larger context of establishing and validating theoretical links between direct and indirect measures, facilitated by the measures taxonomy. Evaluation and validation of POWER measures was performed by analysis of data from three sectors at Indianapolis center (ZID). Development and validation of new measures involved an experiment using a part-task ATC simulation and POWER output from data from Kansas City center (ZKC …",
        "citations": 22
    },
    {
        "title": "A Framework for Evaluation of University Human Factors Curricula",
        "id": "gTRDElAAAAAJ:738O_yMBCRsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:738O_yMBCRsC",
        "authors": [
            "Esa M Rantanen",
            "Peter M Vlach"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2006/10",
        "description": "Curriculum reviews are performed to provide grounds for adjustments necessary due to changes in student enrollment, teaching faculty, and goals and objectives of programs that have a substantial human factors component. This task is arguably quite difficult due to the very broad spectrum of the human factors discipline and lack of widely accepted standards or criteria for education in human factors. This paper describes a framework for review of undergraduate human factors curricula using the program at the University of Illinois as an example. The framework was implemented as a hierarchical relational database with a web interface. Populated with either existing curriculum or desired courses to be developed it allows for rapid analysis of overlap between individual courses, missing important human factors topics, and determination prerequisite knowledge for these, and a rigorous and formal way of keeping …"
    },
    {
        "title": "Development of Air Traffic Control Measurement Database",
        "id": "gTRDElAAAAAJ:abG-DnoFyZgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:abG-DnoFyZgC",
        "authors": [
            "Esa Markus Rantanen"
        ],
        "pub_source": "Human Factors Division, Institute of Aviation, University of Illinois at …",
        "pub_date": "2006/10",
        "description": "Under an Federal Aviation Administration Cooperative Agreement No. 02-G-019 (May 6, 2002—Sep. 31, 2004) Dr. Esa Rantanen (PI) developed a classiﬁcation system for measures and metrics used in air trafﬁc control (ATC) research, focusing on measures of the human component of the ATC system, that is, the air trafﬁc controller. In addition to taxonomy development, this project included an exhaustive review of ATC research literature. This work represented an emphatically systematic and comprehensive approach to the measurement problem in ATC (Rantanen, 2004). Such approach serves a dual purpose: On one hand, it is essential to perform a thorough review of past and current research efforts and to organize the ﬁndings in a manner that facilitates the use of existing knowledge for a basis of future evolvement of ATC measurement. On the other hand, it is prudent to proceed cautiously on an issue as …"
    },
    {
        "title": "Developing criteria for recognizing excellence in undergraduate human factors education",
        "id": "gTRDElAAAAAJ:M3NEmzRMIkIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:M3NEmzRMIkIC",
        "authors": [
            "Lawrence G Shattuck",
            "Ann M Bisantz",
            "Richard D Gilson",
            "William F Moroney",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50 (6 …",
        "pub_date": "2006/10",
        "description": "The purpose of this panel is report on the work of the Undergraduate Program Recognition Committee and to encourage discussion among attendees on the proposed criteria developed by the committee. The paper and the panel discussion will provide an overview of the graduate program accreditation process, report on the work of the Special Task Force on Undergraduate Program, and propose criteria that can be used to recognize the various types of human factors programs that currently exist.",
        "citations": 2
    },
    {
        "title": "Comparison of pilots' and controllers' conflict resolution maneuver preferences",
        "id": "gTRDElAAAAAJ:4TOpqqG69KYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:4TOpqqG69KYC",
        "authors": [
            "Esa M Rantanen",
            "Jiazhong Yang",
            "Shanqing Yin"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2006/10",
        "description": "The role of the air traffic controller in future air traffic management systems is that of a passive monitor, who intervenes in potential conflict situations only if pilots, aided by onboard traffic displays, fail to implement safe and timely conflict resolutions. Yet, such scenarios are entirely plausible and even likely, particularly in busy airspaces. However, it is also likely that an a controller will seek to implement a resolution that is different from what the pilots had planned, resulting in confusion, delays, and safety risks. This paper examines pilots' and controllers' maneuver preferences and potential sources for dissonance in conflict resolution situations. Data on pilots' maneuver tendencies were gathered from an extensive review of past literature; controllers' preferences were obtained from an experiment that systematically manipulated simulated ATC scenario difficulty and conflict geometries. Results indicate largely similar …",
        "citations": 18
    },
    {
        "title": "Network intrusion detection cognitive task analysis: Textual and visual tool usage and recommendations",
        "id": "gTRDElAAAAAJ:ufrVoPGSRksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ufrVoPGSRksC",
        "authors": [
            "Ramona Su Thompson",
            "Esa M Rantanen",
            "William Yurcik"
        ],
        "pub_source": "Proceedings of the human factors and ergonomics society annual meeting 50 (5 …",
        "pub_date": "2006/10",
        "description": "A task analysis is conducted for the complex task of network security engineers, intrusion detection (ID) of computer networks. ID helps engineers protect network from harmful attacks and can be broken down into the following phases: pre-processing information, monitoring the network, analyzing attacks, and responding to attacks. Different cognitive loads are placed on the engineer at each phase. Engineers also need to integrate information from a variety of tools and resources, which adds additional cognitive workload. Visualization tools have been developed to alleviate these workloads but they have had limited success. To address this problem, we make two recommendations: (1) these tools should be designed for use across the phases of ID; this reduces the number of resources used therefore reducing the workload of integrating information across sources, and (2) visualization tools should allow …",
        "citations": 24
    },
    {
        "title": "Human factors issues in implementation of advanced aviation technologies: A case of false alerts and cockpit displays of traffic information",
        "id": "gTRDElAAAAAJ:Y0pCki6q_DkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Y0pCki6q_DkC",
        "authors": [
            "Lisa C Thomas",
            "Esa M Rantanen"
        ],
        "pub_source": "Theoretical Issues in Ergonomics Science",
        "pub_date": "2006/9/1",
        "description": "This paper provides a framework for identifying and evaluating the human performance implications of new avionics technology such as the cockpit display of traffic information (CDTI). Several important human factors issues in developing and implementing the CDTI are discussed in terms of their effects on the two primary flight tasks associated with the CDTI: conflict detection and conflict resolution. One issue is the development of alerting algorithms, which are defined by how uncertainty, false alarms and look-ahead times are dealt with. Another issue concerns understanding how time pressure, display dimensionality and conflict geometry affect pilot preferences for certain avoidance maneouvres over others. A third issue is the proposed shift in responsibility of flight safety away from air traffic control to the pilot after CDTIs make it possible for pilots to perform tasks related to self-separation. These issues and the …",
        "citations": 42
    },
    {
        "title": "Five‐dimensional taxonomy to relate human errors and technological interventions in a human factors literature database",
        "id": "gTRDElAAAAAJ:4JMBOYKVnBMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:4JMBOYKVnBMC",
        "authors": [
            "Esa M Rantanen",
            "Brent O Palmer",
            "Douglas A Wiegmann",
            "Kevin M Musiorski"
        ],
        "pub_source": "Journal of the American Society for Information Science and Technology",
        "pub_date": "2006/7",
        "description": "One of the main factors in all aviation accidents is human error. Therefore, the National Aeronautics and Space Administration (NASA) Aviation Safety Program (AvSP) has identified several human factors safety technologies to address this problem. Some technologies directly address human error either by attempting to reduce the occurrence of errors or by mitigating the negative consequences of errors. However, new technologies and system changes may also introduce new error opportunities or even induce different types of errors. Consequently, a thorough understanding of the relationship between error classes and technology “fixes” is crucial for the evaluation of intervention strategies outlined in the AvSP so that resources can be effectively directed to maximize the benefit to flight safety. This article summarizes efforts to map intervention technologies onto error categories and describes creation of a …",
        "citations": 15
    },
    {
        "title": "HFD",
        "id": "gTRDElAAAAAJ:vV6vV6tmYwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:vV6vV6tmYwMC",
        "authors": [
            "Xidong Xu",
            "Esa M Rantanen",
            "Yan Huo"
        ],
        "pub_source": "",
        "pub_date": "2006/2",
        "description": "When independent variables are inter-correlated with each other, ANOVAs cannot determine their relative importance in influencing a dependent measure. Similarly, when predictor variables are intercorrelated, there are inherent problems with traditional multiple regression methods for analyzing the relative importance of the prediction variables in accounting for the variance in a criterion variable. This report describes a method called Dominance Analysis (DA)(Budescu, 1993; Azen & Budescu, 2003) as a better approach than the traditional methods in determining the relative importance of several independent variables in accounting for the variances in dependent variables observed in a pilot conflict detection task with the cockpit display of traffic information (CDTI; Xu, Rantanen, Wickens, 2004). The three intercorrelated variables in question were an intruder aircraft’s distance to, and time to, the closest point of …"
    },
    {
        "title": "Visualization of Power Systems and Components (S-18)",
        "id": "gTRDElAAAAAJ:1yQoGdGgb4wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:1yQoGdGgb4wC",
        "authors": [
            "Tom Overbye",
            "Sakis Meliopoulos",
            "Doug Wiegmann",
            "Esa Rantanen"
        ],
        "pub_source": "",
        "pub_date": "2006",
        "description": "Visualization PSERC Tele-Seminar, Jan. 24, 2006 Page 1 PSERC Visualization of Power \nSystems and Components (S-18) Tom Overbye Sakis Meliopoulos Doug Wiegmann Esa \nRantanen PSERC Tele-Seminar, January 24, 2006 © 2006 Tom Overbye. All rights reserved. \nPage 2 2 PSERC Project Overview • Project goal was the development of enhanced visualization \ntechniques for power systems and their components • Project also included an explicit human \nfactor consideration of these techniques • Industrial team members included AEP, Areva, ATC, \nEntergy, Exelon, ISO NE, PJM, PowerWorld, Southern, TVA, WAPA Page 3 3 PSERC Key \nResults • Improved 2D large-scale visualizations • Selective information highlighting, gauges \nfor reactive power visualization, improved contouring algorithms, power injection contours, \nintegrated weather/power system displays, • Improved 3D large-scale visualizations • …",
        "citations": 1
    },
    {
        "title": "En Route Controller Task Prioritization Research to Support CE-6 Human Performance Modeling: Analysis of High-fidelity Simulation Data. Phase II",
        "id": "gTRDElAAAAAJ:CHSYGLWDkRkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:CHSYGLWDkRkC",
        "authors": [
            "Esa Markus Rantanen",
            "Sharon J Yeakel",
            "Kelly S Steelman"
        ],
        "pub_source": "University of Illinois at Urbana-Champaign, Human Factors Division",
        "pub_date": "2006",
        "citations": 2
    },
    {
        "title": "Hierarchical conflict detection in air traffic control",
        "id": "gTRDElAAAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:9yKSN-GCB0IC",
        "authors": [
            "Esa M Rantanen",
            "Ashley Nunes"
        ],
        "pub_source": "The International Journal of Aviation Psychology",
        "pub_date": "2005/10/1",
        "description": "Experienced air traffic controllers and  college students participated in 2 experiments we conducted to test a hypothesis that controllers evaluate potential conflicts between aircraft in a hierarchical manner, comparing altitudes first for vertical separation, then extrapolating aircraft trajectories for lateral separation, and finally performing speed-distance computations for longitudinal separation. The results clearly support the hypothesis and imply that controller workload in terms of time pressure could be determined by momentary conflict geometries between aircraft pairs in a sector. Similarity of results between the groups has implications on both our understanding of controller expertise and on experimental research on air traffic control-related issues.",
        "citations": 133
    },
    {
        "title": "Designing external aids that support older pilot performance",
        "id": "gTRDElAAAAAJ:YFjsv_pBGBYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:YFjsv_pBGBYC",
        "authors": [
            "Daniel Morrow",
            "Dervon Chang",
            "Christopher Wickens",
            "Esa Rantanen",
            "Liza Raquel"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 49 (2 …",
        "pub_date": "2005/9",
        "description": "Communication taxes pilots' cognitive resources. External aids such as note-taking help pilots manage these demands. Morrow et al. (2003) found that note-taking eliminated age differences among pilots on a readback task compared to a no-aid condition. However, we investigated communication-only rather than multi-task environments typical of piloting. The present study compared note-taking (kneepad) with an electronic notepad positioned next to the instrument panel in a flight simulator (epad). The epad may be easier to coordinate with concurrent tasks because it is more integrated with flight instruments. Six older and six younger pilots used these aids to respond to ATC messages in a flight simulator. Readback accuracy was higher when pilots used either aid compared to a no-aid condition. The pattern of results suggested a smaller age difference in the aid than in the no-aid conditions. The results …",
        "citations": 2
    },
    {
        "title": "Time-based modeling of human performance",
        "id": "gTRDElAAAAAJ:MXK_kJrjxJIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:MXK_kJrjxJIC",
        "authors": [
            "Esa M Rantanen",
            "Brian R Levinthal"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 49 …",
        "pub_date": "2005/9",
        "description": "This paper presents a probabilistic approach to modeling human performance. Instead of focusing on mean performance, the effects of taskload on the distributions of performance variables are examined. From such data, probabilities of given levels of performance can be derived and methods of measurement that expand the analyses beyond those of the mean developed. Results from two experiments, one abstract, the other realistic, are presented in terms of timely performance on required tasks. As taskload increased, the participants were less likely to act on the experimental tasks at an earliest opportunity than under low taskload, resulting in increase of “too late” errors. Measurement of taskload and performance in temporal terms also allowed for bracketing and making inferences about mental workload, which is not directly measurable.",
        "citations": 25
    },
    {
        "title": "Incremental transfer and cost effectiveness of groundbased flight trainers in university aviation programs",
        "id": "gTRDElAAAAAJ:W7OEmFMy1HYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:W7OEmFMy1HYC",
        "authors": [
            "Esa M Rantanen",
            "Donald A Talleur"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 49 (7 …",
        "pub_date": "2005/9",
        "description": "Use of ground-based flight training devices in flight training is attractive for several reasons. In addition to undeniable safety aspects and immunity to weather, ground trainers also offer benefits in terms of training effectiveness, typically measured by the time or number of trials saved over training exclusively in an airplane. A review of 19 studies from the past 56 years that have investigated transfer of training effectiveness from ground trainers to airplane revealed, however, that unambiguous conclusions about the best use of these devices are difficult to discern. The reason for the lack of valid data and widely varied results are the large number of intervening variables present in flight training as well as the difficulty of conducting sound research on this topic.",
        "citations": 48
    },
    {
        "title": "AHFD",
        "id": "gTRDElAAAAAJ:P5F9QuxV20EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:P5F9QuxV20EC",
        "authors": [
            "Henry L Taylor",
            "Donald A Talleur",
            "Tom W Emanuel Jr",
            "Esa Rantanen"
        ],
        "pub_source": "",
        "pub_date": "2005/5/23",
        "description": "The effectiveness of ground-based flight training devices in teaching flying skills is measured by transfer of training, quantifiable by a transfer effective ratio (TER). The incremental transfer effectiveness ratio (ITER) determines the transfer effectiveness of successive increments of training in the ground trainer. Previous research on a personal computer based aviation training device (PCATD) has shown that this device is effective for teaching instrument tasks (Taylor et al., 1996; 1999). In a later study as predicted by the incremental transfer of training theory of Roscoe (1971)., the greatest transfer of training effect was found for the group that received five hours compared to 10 and 15 hours of prior PCATD training in an airplane (Taylor et al., 2002b). In some cases the results indicate a complex pattern supporting the notion that more training in a PCATD is not necessarily better. The research reported here sought to replicate the previous findings by Taylor et al.(1996, 1999, 2002b) using both PCATDs and flight training devices (FTDs).Participants in this experiment were assigned to four flight training device (FTD) groups, one PCATD group, and a control (airplane) group. Training in the FTD was conducted in Frasca 141, level-1 FTDs. The PCATD training was conducted using FAA approved PCATDs from Aviation Teachware Technologies (ELITE) v. 6.0. 2, with flight controls by Precision Flight Controls. Airplane training was carried out in the Piper Archer III aircraft."
    },
    {
        "title": "Effect of air traffic controller taskload and temporal awareness on task prioritization",
        "id": "gTRDElAAAAAJ:J-pR_7NvFogC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:J-pR_7NvFogC",
        "authors": [
            "Esa M Rantanen",
            "Brian R Levinthal"
        ],
        "pub_source": "2005 International Symposium on Aviation Psychology",
        "pub_date": "2005",
        "description": "This paper describes an experiment that was conducted to provide an empirical foundation for estimation of parameters for air traffic controller performance modeling efforts presently pursued within the NASA DAG-TM CE-6 model development. The focus of the work was the task prioritization scheme used in these models. A total of 11 retired FAA controllers and supervisors assigned to the FAA Technical Center volunteered to participate in the experiment. A part-task experimental simulation that presented the participating controllers with several simultaneous tasks in four quadrants, or panes, on a single display was used. Only one pane and typically one task could be viewed at a time. This allowed for measurement of controllers’ attention to each task. All events unfolding in the experimental scenarios and controllers’ actions were recorded and timed as well. From these data, several dependent variables were derived, focusing on the temporal aspects of controllers’ performance and their prioritization of simultaneously available tasks. The results indicate that taskload was manipulated successfully and resulted in measurable differences between experimental conditions in both taskload and performance, the latter evinced by the time elapsed in a window of opportunity for a given task before action was taken on it as well as time remaining in the window of opportunity when action was completed. However, it appears that either the controllers were not aware of these temporal features of their tasks or that other factors dominated their prioritization decisions. Task prioritization may hence be driven by task characteristics that are categorical rather …",
        "citations": 7
    },
    {
        "title": "External Aids and Age Differences in Pilot Communication",
        "id": "gTRDElAAAAAJ:1qzjygNMrQYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:1qzjygNMrQYC",
        "authors": [
            "Daniel Morrow",
            "Dervon Chang",
            "Christopher Wickens",
            "Esa Rantanen",
            "Liza Raquel"
        ],
        "pub_source": "2005 International Symposium on Aviation Psychology",
        "pub_date": "2005",
        "description": "The use of external aids (eg, a kneepad) can reduce the demands of Air Traffic Control (ATC) communication on pilots’ working memory during routine flight. Older pilots may especially benefit from such aids because of agerelated declines in working memory, although cognitive declines may impair the ability to coordinate the use of these aids with concurrent flight navigation and control tasks. We investigated the use of two external aids that may vary in ease of coordination: a conventional knee pad and an electronic notepad, or e-pad. Participants were 6 older (50-65 years) and 6 younger (20-40) active instrument-rated pilots. While in a Frasca flight simulator, they listened to and read back complex (four-instruction) ATC messages while using the kneepad, e-pad, or no aid. Readback accuracy was analyzed by an Age x Aid x Instruction type (Heading, Altitude, Speed) ANOVA with Aid and Instruction as repeated measures. Accuracy was higher when pilots used either aid compared to no aid, and lower for older pilots. The findings suggested a greater aid benefit for older pilots, with a smaller age difference in the two aid conditions than in the no-aid condition. While the Age x Aid interaction was not significant, this interaction was significant for the altitude instruction readbacks. Despite the small sample size, our study replicates note-taking (kneepad) benefits for older as well as younger pilots’ communication, and extends these findings to the novel epad. Results of a usability survey helped improve the e-pad interface. We will next investigate potential attentional costs of these aids for task coordination during simulated Frasca flight, as well as …"
    },
    {
        "title": "Pilots' Conflict Detection with Imperfect Conflict Alerting System for the Cockpit Display of Traffic Information",
        "id": "gTRDElAAAAAJ:V3AGJWp-ZtQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:V3AGJWp-ZtQC",
        "authors": [
            "Xidong Xu",
            "Christopher D Wickens",
            "Esa M Rantanen"
        ],
        "pub_source": "2005 International Symposium on Aviation Psychology",
        "pub_date": "2005",
        "description": "Twenty-four pilots viewed dynamic encounters between the pilot’s “ownship” and an intruder aircraft on a 2-D simulated Cockpit Display of Traffic Information (CDTI) and estimated the point and time of closest approach. A three-level alert system provided a correct categorical estimate of the projected miss distance (MD) on 83% of the trials. The remaining 17% of alerts incorrectly predicted MD. The data of these pilots were compared with a matched “baseline” pilots, who viewed identical trials without the aid of automated alerts. Roughly half the pilots depended on and benefited from this automation, and others did not. Those who benefited did so when problems were difficult but not when they were easy. Furthermore, automation benefits were observed only when automation was correct, but automation costs were not observed when it was in error. While assisting miss distance prediction, the automation led to an underestimate of the time remaining till the point of closest approach.",
        "citations": 2
    },
    {
        "title": "Teams, teamwork, and automation in air traffic control",
        "id": "gTRDElAAAAAJ:kRWSkSYxWN8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:kRWSkSYxWN8C",
        "authors": [
            "Philip W Maynard",
            "Esa M Rantanen"
        ],
        "pub_source": "2005 International Symposium on Aviation Psychology",
        "pub_date": "2005",
        "description": "Many recent initiatives involving social psychology applications in the aviation world have redoubled the interest in the concept of teams and teamwork. The importance of teamwork in airline cockpits, hailed as cockpit (or crew-) resource management (CRM), has been recognized for a relatively long time. It is also widely agreed that extensive and effective interaction among participants in the National Airspace System (NAS), pilots, air traffic controllers, and airline operations personnel, is tantamount to the daily successes of the nation’s air transportation industry. Team aspects in air traffic control (ATC) are, however, much more convoluted than intra-cockpit teams or top-level teamwork between NAS elements. The ATC system involves a complicated network of facilities, technology, and personnel, which all must interact synergistically, often under time pressure, to ensure safe, efficient, and orderly flow of air traffic. It is perhaps due to this complexity that there has been a significant deficiency in research activity relating to teamwork in ATC. Yet, inadequate coordination between controllers has been considered a causal factor in a substantial proportion of low to moderate severity operational errors. Furthermore, automation tools developed for controllers are primarily focused on supporting the individual controller, while many, if not all of ATC functions are a team effort. In this paper we review the literature relevant to the team concept in the ATC domain, identify and characterize the different teams controllers belong to either simultaneously (eg, intra-and inter-facility teams) or in different operational environments, and catalog the results from …",
        "citations": 4
    },
    {
        "title": "AHFD",
        "id": "gTRDElAAAAAJ:B3FOqHPlNUQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:B3FOqHPlNUQC",
        "authors": [
            "En Route Controller Task Prioritization",
            "Esa M Rantanen",
            "Brian R Levinthal",
            "Sharon J Yeakel"
        ],
        "pub_source": "",
        "pub_date": "2005/1",
        "description": "This report describes an experiment that was conducted to provide an empirical foundation for estimation of parameters for air traffic controller performance modeling efforts presently pursued by MA&D within the NASA DAG-TM CE-6 model development. The focus of the work was the task prioritization scheme used in these models.A total of 11 retired FAA controllers and supervisors assigned to the FAA Technical Center’s Human Factors Research and Development Laboratory (HFRDL) at Atlantic City International airport, NJ, volunteered to participate in the experiment. A part task experimental simulation that presented the participating controllers with several simultaneous tasks in four quadrants, or panes, on a single display was used. Only one pane and typically one task could be viewed at a time. This allowed for measurement of controllers’ attention to each task (ie, dwell times in each pane). All events …"
    },
    {
        "title": "The effectiveness of a personal computer aviation training device (PCATD), a flight training device (FTD), and an airplane in conducting instrument proficiency checks",
        "id": "gTRDElAAAAAJ:bEWYMUwI8FkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:bEWYMUwI8FkC",
        "authors": [
            "Henry L Taylor",
            "Donald A Talleur",
            "Esa M Rantanen",
            "Tom W Emanuel Jr"
        ],
        "pub_source": "2005 International Symposium on Aviation Psychology",
        "pub_date": "2005",
        "description": "This project evaluated the effectiveness of a personal computer aviation training device (PCATD), a flight training device (FTD) and an airplane for conducting an instrument proficiency check (IPC). The study compared the performance of pilots receiving an IPC in a PCATD, in a FTD and in an airplane (IPC# 1) with performance on a later IPC in an airplane (IPC# 2). Chi-square tests were used to analyze the IPC# 1 and IPC# 2 data to determine whether the treatment (assignment to group) had an effect on the pass/fail ratio for the IPC# 1 and IPC# 2 flights respectively. The treatment effect on the IPC# 1 and IPC# 2 pass/fail ratios were not statistically significant. A series of planned-comparison tests were performed both between the experimental groups and between subjects within each experimental group. The PCATD group was compared to the Airplane group and to the FTD group, the Airplane group to the FTD group. None of these comparisons showed statistically significant (a<. 05) differences between groups. These findings provide compelling evidence for permitting the use of PCATDs to give IPCs.",
        "citations": 13
    },
    {
        "title": "The impact of sector characteristics and aircraft count on air traffic control communications and workload",
        "id": "gTRDElAAAAAJ:RHpTSmoSYBkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:RHpTSmoSYBkC",
        "authors": [
            "Esa M Rantanen",
            "Philip W Maynard",
            "Deniz Özhan"
        ],
        "pub_source": "2005 International Symposium on Aviation Psychology",
        "pub_date": "2005",
        "description": "Means of communication between pilots and controllers is one of the fundamental principles of air traffic control (ATC). Consequently, air-ground communications will both reflect the taskload imposed on the controller as well as drive the workload experienced by the controller. Therefore, analysis of ATC communications could potentially reveal a very rich and detailed picture of the demands placed on a controller in a given sector and traffic situation. This paper reports analysis of ATC voice data obtained from three different sectors at the Indianapolis air route traffic control center (ZID ARTCC). The main purpose of this analysis was to examine how different sector characteristics and the busy and slow periods within the sectors differed explicitly in terms of pilot-controller communications and implicitly in terms of controller taskload and workload. Measures derived from the voice data were also compared to metrics reflecting ATC sector complexity that were derived from the output of the objective activity and taskload assessment program, POWER, developed by the FAA.",
        "citations": 7
    },
    {
        "title": "Effectiveness of Flight Training Devices used for instrument training",
        "id": "gTRDElAAAAAJ:ZeXyd9-uunAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ZeXyd9-uunAC",
        "authors": [
            "Henry L Taylor",
            "Donald A Talleur",
            "Tom W Emanuel Jr",
            "Esa Rantanen"
        ],
        "pub_source": "",
        "pub_date": "2005",
        "description": "The effectiveness of ground-based flight training devices in teaching flying skills is measured by transfer of training, quantifiable by a transfer effective ratio (TER). The incremental transfer effectiveness ratio (ITER) determines the transfer effectiveness of successive increments of training in the ground trainer. Previous research on a personal computer based aviation training device (PCATD) has shown that this device is effective for teaching instrument tasks (Taylor et al., 1996; 1999). In a later study as predicted by the incremental transfer of training theory of Roscoe (1971)., the greatest transfer of training effect was found for the group that received five hours compared to 10 and 15 hours of prior PCATD training in an airplane (Taylor et al., 2002b). In some cases the results indicate a complex pattern supporting the notion that more training in a PCATD is not necessarily better. The research reported here sought to …",
        "citations": 7
    },
    {
        "title": "Transfer of training effectiveness of a flight training device (FTD)",
        "id": "gTRDElAAAAAJ:QIV2ME_5wuYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:QIV2ME_5wuYC",
        "authors": [
            "Henry L Taylor",
            "Donald A Talleur",
            "Tom W Emanuel Jr",
            "Esa M Rantanen"
        ],
        "pub_source": "2005 International Symposium on Aviation Psychology",
        "pub_date": "2005",
        "description": "A transfer of training research design was used to measure the effectiveness of a flight training device (FTD) and to determine the point at which additional training in a FTD was no longer effective. The dependent measures were number of trials to specific completion standards, time to complete a flight lesson, and time to a successful evaluation flight. Percent transfer and transfer effectiveness ratios (TERs) were computed for each instrument task and for the time to complete a flight lesson. The data from the current study indicates that the FTD and the PCATD appear effective in teaching basic and advanced instrument tasks to private pilots but the limited number of subjects prevented this effectiveness from being convincingly demonstrated. As a result of prior training in an FTD and a PCATD time to a stage check or an instrument rating flight check flight was less when compared to an airplane control group.",
        "citations": 15
    },
    {
        "title": "Objective pilot performance measurement: A literature review and taxonomy of metrics",
        "id": "gTRDElAAAAAJ:KlAtU1dfN6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:KlAtU1dfN6UC",
        "authors": [
            "NR Johnson",
            "EM Rantanen"
        ],
        "pub_source": "Proceedings of the 13th International Symposium of Aviation Psychology",
        "pub_date": "2005",
        "citations": 16
    },
    {
        "title": "AHFD",
        "id": "gTRDElAAAAAJ:u9iWguZQMMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:u9iWguZQMMsC",
        "authors": [
            "Esa Rantanen",
            "Nicholas R Johnson",
            "Donald A Talleur"
        ],
        "pub_source": "",
        "pub_date": "2004/11/21",
        "description": "The current POWER “suite” of air traffic control (ATC) metrics includes such measures as traffic count, control duration, and variability in aircraft headings, altitudes, and speeds, as well as latencies of handoff initiation and acceptance, as well as records of a number of different controller activities. While these measures yield a reasonably detailed picture of events in a sector during the recording period, there is a substantial gap between them and measures of real interest, for example, measures of sector complexity and controller workload, situation awareness, and performance. Hence, although vast amounts of objective data are potentially available from operational ATC system, derivation of valid, reliable, and meaningful measures from them remains a problem. This problem is particularly pronounced when variables of interest are not directly measurable, such as controller workload and performance.This project represents an emphatically systematic and comprehensive approach to the measurement problem in ATC. The project involved many subtasks. The body of literature on ATC research was organized into taxonomy of ATC measures. Development of criteria for POWER measures was approached in the larger context of establishing and validating theoretical links between direct and indirect measures, facilitated by the measures taxonomy. Evaluation and validation of POWER measures was performed by analysis of data from three sectors at Indianapolis center (ZID). Development and validation of new measures involved an experiment using a part-task ATC simulation and POWER output from data from Kansas City center (ZKC …"
    },
    {
        "title": "Time delays in air traffic control communication loop: effect on controller performance and workload",
        "id": "gTRDElAAAAAJ:_FxGoFyzp5QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:_FxGoFyzp5QC",
        "authors": [
            "Esa M Rantanen",
            "Jason S McCarley",
            "Xidong Xu"
        ],
        "pub_source": "The International Journal of Aviation Psychology",
        "pub_date": "2004/10/1",
        "description": "The impact of digital technology-induced delays in the pilot-controller communications on air traffic controllers' performance and workload was investigated in 2 experiments manipulating systemic audio delay (AD) and variable pilot delay (PD). Vectoring accuracy (Experiment 1), lateral separation between 2 aircraft on converging tracks (Experiment 2), and subjective workload (NASA-Task Load Index) were measured. In Experiment 1, the effect of AD was measurable but not statistically significant; PD reduced accuracy and resulted in earlier turn initiations. In Experiment 2, both AD and PD significantly reduced separation between aircrafts. Short communication delays, however, did not substantially degrade controller performance in the experiments.",
        "citations": 31
    },
    {
        "title": "An electronic instruction manual and checklist for steam boiler start-up",
        "id": "gTRDElAAAAAJ:XiSMed-E-HIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:XiSMed-E-HIC",
        "authors": [
            "Satoru Tokuda",
            "Esa M Rantanen",
            "Jessica CM Gonzalez de Sather"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2004/9",
        "description": "Development of an electronic user manual/checklist for a steam-generating power plant boiler start-up is described. Human factors guidelines for development of effective instructional materials were reviewed. Subject matter experts (experienced operators at the power plant) were used to gain requisite knowledge in the procedures and tasks involved in start-up of a steam boiler. Functions of the main components in the power plant and boilers were studied in relevant literature. The new manual/checklist includes description of the system components as part of operative actions and separate actions are arranged into categorical groups, each associated with informative headings. Flowcharts are used to guide users through complex procedures and pictures of critical plant components are provided. All sentences to explain actions are simple and have fewer than 20 words. Several operators have checked and …"
    },
    {
        "title": "Criterion setting for objective, Fourier analysis based pilot performance metrics",
        "id": "gTRDElAAAAAJ:hMod-77fHWUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:hMod-77fHWUC",
        "authors": [
            "Nicholas R Johnson",
            "Esa M Rantanen",
            "Donald A Talleur"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2004/9",
        "description": "This study reports the development and evaluation of time series based objective pilot performance metrics. From a previously developed array of autocorrelation and Fourier analysis based metrics, five Fourier-based metrics that employed a threshold value were chosen to investigate their effectiveness in separating pilots who, based on instructor pilot (IP) evaluations, had either passed or failed a particular segment of an instrument proficiency check flight. An instrument landing system (ILS) approach was chosen for analysis based on IP feedback of what flight segments were most difficult to evaluate, had greatest sensitivity to overall pilot performance, and greatest criticality to the flying task. Further analysis showed that an optimal value for the criterion value could be found that most effectively separated those pilots that had passed the ILS segment from those who had failed. Criterion setting methods without …",
        "citations": 4
    },
    {
        "title": "Measurement of taskload and performance in a dynamic multi-task experiment",
        "id": "gTRDElAAAAAJ:mB3voiENLucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:mB3voiENLucC",
        "authors": [
            "Brian R Levinthal",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 48 (3 …",
        "pub_date": "2004/9",
        "description": "This paper discusses an experimental paradigm for measuring human performance under time pressure. Participants were presented with four simultaneous number-entry tasks. Entry could occur only within a discrete window of opportunity, represented visually by a target range within a variable-speed progress bar. Participants could view only one task at a time, thus performance required scanning and sampling of all four tasks. Sampling behavior (mouse movements to the vicinity of one of the four tasks) was manipulated via access effort; blocks of trials presented either a half or full second lag before a target task would become visible. Participants' performance was evaluated by the proportion of responses completed within the required window of opportunity as well as the proportion of a window of opportunity that elapsed before the onset of a response. Results indicate a decrease in such performance as a …",
        "citations": 5
    },
    {
        "title": "AHFD",
        "id": "gTRDElAAAAAJ:uWQEDVKXjbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:uWQEDVKXjbEC",
        "authors": [
            "Xidong Xu",
            "Christopher D Wickens",
            "Esa Rantanen"
        ],
        "pub_source": "",
        "pub_date": "2004/6",
        "description": "This experiment assessed pilots’ abilities to use the imperfect (partially reliable) alerting system to detect conflicts on a cockpit display of traffic information (CDTI). An 83% reliability level of automated conflict detection that was chosen, simulated the sort of unreliability that might be characteristic of such a system, predicting conflicts with longer look-ahead-times, in a probabilistic airspace, subject to turbulence, uncertainty, and future pilot control actions between the time of alert and the time of closest approach with the conflicting traffic.24 licensed pilots viewed a series of dynamic encounters on a 2D CDTI that varied widely in their difficulty, as influenced by lateral conflict geometry (conflict angle, speed, and distance & time till closest approach). Pilots were asked to estimate the point and time of closest approach at varying times before that point was reached. A 3-level alert system provided a correct categorical estimate of the projected miss distance on 83% of the trials. The remaining 17% of alerts were equally divided between automation misses and false alarms, of large and small magnitude. The data of these pilots were compared with a matched sample of “baseline” pilots who viewed identical trials without the aid of automated alerts.The results revealed that roughly half the pilots depended on automation, and used it to improve their performance (accurate estimation of miss distance) relative to the baseline pilots who did not receive the automation. Those pilots who depended on automation did so more on the more difficult traffic trials, and were able to improve their performance on the 83% trials when automation was correct, without …"
    },
    {
        "title": "Comparison of the Effectiveness of a Personal Computer Aviation Training Device, a Flight Training Device, and an Airplane in Conducting Instrument Proficiency Checks",
        "id": "gTRDElAAAAAJ:dshw04ExmUIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:dshw04ExmUIC",
        "authors": [
            "Henry L Taylor",
            "Donald A Talleur",
            "Esa M Rantanen",
            "Tom W Emanuel Jr"
        ],
        "pub_source": "",
        "pub_date": "2004/4/2",
        "description": "This report covers the fifth six months of a three-year effort to compare the effectiveness of a personal computer-based aviation training device (PCATD), a flight training device (FTD), and an airplane for conducting instrument proficiency checks (IPC). During the six-month period covered by the report, we have:"
    },
    {
        "title": "Book review of control theory for humans: quantitative approaches to modeling performance by RJ Jagacinski and JM Flach, Mahwah, NJ: Lawrence Erlbaum (2003), pp. xiii+ 379, 99 …",
        "id": "gTRDElAAAAAJ:vRqMK49ujn8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:vRqMK49ujn8C",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "Theoretical Issues in Ergonomics Science",
        "pub_date": "2004/3/1",
        "description": "This long-awaited book provides a welcome—even essential—addition to every human factors professional’s bookshelf. The authors’ intended audience for the text is advanced undergraduates and graduate students in behavioural sciences, engineering and design. This statement appears to be accurate. However, the book should also be very appropriate and valuable to a much broader readership, embracing the population of human factors educators, researchers and practitioners. Indeed, the text makes a cogent case for the study and application of control theory in numerous facets of the human factors discipline. The 27 chapters in the book are relatively short, on average only a little over 13 pages long, with the longest chapters at 17 pages. This makes the text highly suitable for use as a textbook, with each chapter easily covered in a single lecture and the entire book in one semester-long course. The clear …"
    },
    {
        "title": "Developing and validating human factors certification criteria for cockpit displays of traffic information avionics",
        "id": "gTRDElAAAAAJ:ULOm3_A8WrAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ULOm3_A8WrAC",
        "authors": [
            "Esa M Rantanen",
            "Christopher D Wickens",
            "Xidong Xu",
            "Lisa C Thomas"
        ],
        "pub_source": "No. AHFD-04-1/FAA-04-1). Savoy, IL: University of Illinois, Aviation Human Factors Division",
        "pub_date": "2004/1/6",
        "description": "This report examines issues associated with traffic awareness and conflict detection and resolution applications, particularly the predictive and planning support offered by the Cockpit Display of Traffic Information (CDTI). However, inferences about future trajectories of ownship and traffic made by the CDTI logic will, by nature, be imperfect, leading to an apparent loss of reliability of the prediction/planning tools. This loss of reliability and its impact on pilots’ behavior and cognition is the focus of this report. Three specific aspects of the CDTI are distinguished: Alerts, visual symbology, and planning tools.The report draws from general human factors literature. The tradeoff between false alarms (FAs) and misses (or late alerts), how these tradeoffs affect trust and reliance in the alerting system, and how low base-rate events necessarily create a high false alarm rate (FAR), if highcost misses are to be minimized, are examined. The report concludes with general recommendations emerging from the literature on solutions to mitigate the problems of FAs, with an emphasis on multi-level alerts. Also literature that has addressed the FA–late alert tradeoff and evaluated the CDTI alerts with pilot-in-the-loop (PIL) data was reviewed. Lessons learned from implementation of Traffic Alert and Collision Avoidance System (TCAS) were assessed and results of the analysis of ASRS reports from TCAS system are reported. From this review, guidance will emerge regarding what aspects of conflict situations make detection and response difficult from a pilot’s point of view, and therefore should be targeted for inclusion in certification and approval. Also documents by …",
        "citations": 22
    },
    {
        "title": "The effectiveness of personal computer aviation training device, a flight training device, and an airplane in conducting instrument proficiency checks: volume 2: objective …",
        "id": "gTRDElAAAAAJ:8AbLer7MMksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:8AbLer7MMksC",
        "authors": [
            "EM Rantanen",
            "NR Johnson",
            "DA Talleur"
        ],
        "pub_source": "Final Technical Report AHFD-04-16/FAA-04-6",
        "pub_date": "2004",
        "citations": 12
    },
    {
        "title": "Imperfect conflict alerting systems for the cockpit display of traffic information",
        "id": "gTRDElAAAAAJ:7PzlFSSx8tAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:7PzlFSSx8tAC",
        "authors": [
            "Xidong Xu",
            "Christopher D Wickens",
            "Esa Markus Rantanen"
        ],
        "pub_source": "University of Illinois at Urbana-Champaign, Aviation Human Factors Division",
        "pub_date": "2004",
        "citations": 12
    },
    {
        "title": "The effectiveness of a personal computer aviation training device, a flight training device, and an airplane in conducting instrument proficiency checks",
        "id": "gTRDElAAAAAJ:aqlVkmm33-oC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:aqlVkmm33-oC",
        "authors": [
            "Henry L Taylor",
            "Donald A Talleur",
            "Esa M Rantanen",
            "Tom W Emanuel Jr"
        ],
        "pub_source": "",
        "pub_date": "2004",
        "description": "Instrument pilots must meet the recent instrument experience requirements of FAR 61.57 (c) or (d) every six months to maintain instrument currency, and an approved flight-training device (FTD) or an airplane may be used to meet these requirements. An instrument pilot who fails to meet these requirements within a 12-month period must pass an instrument proficiency check (IPC) to regain instrument currency. The present study was designed to examine how FTDs and PCATDs compared with each other and with an airplane in the administration of an IPC. Two checks were performed, the first in one of the three possible devices (FTD, PCATD, airplane) and the second in an airplane. Two questions were addressed by this research: first, was the present rule allowing an FTD to be used to administer the IPC warranted and second, could a PCATD be used as effectively as an FTD to administer the check? Additionally …",
        "citations": 12
    },
    {
        "title": "Estimation of conflict risk using cockpit displays of traffic information",
        "id": "gTRDElAAAAAJ:8k81kl-MbHgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:8k81kl-MbHgC",
        "authors": [
            "Xidong Xu",
            "Esa Markus Rantanen",
            "Christopher D Wickens"
        ],
        "pub_source": "University of Illinois at Urbana-Champaign, Aviation Human Factors Division",
        "pub_date": "2004",
        "citations": 15
    },
    {
        "title": "A Human Factors Database for Matching Human Errors and Technological Interventions",
        "id": "gTRDElAAAAAJ:u_35RYKgDlwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:u_35RYKgDlwC",
        "authors": [
            "Esa M Rantanen",
            "Douglas A Wiegmann",
            "Brent O Palmer",
            "Kevin M Musiorski"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2003/10",
        "description": "One of the main factors in all aviation accidents is human error. The NASA Aviation Safety Program (AvSP), therefore, has identified several human-factors safety technologies to address this issue. Some technologies directly address human error either by attempting to reduce the occurrence of errors or by mitigating the negative consequences of errors. However, new technologies and system changes may also introduce new error opportunities or even induce different types of errors. Consequently, a thorough understanding of the relationship between error classes and technology “fixes” is crucial for the evaluation of intervention strategies outlined in the AvSP, so that resources can be effectively directed to maximize the benefit to flight safety. The purpose of the present project, therefore, was to examine the repositories of human factors data to identify the possible relationship between different error class and …"
    },
    {
        "title": "Special Projects in Undergraduate Human Factors Courses: Evaluation of Power Plant Boiler Control Interface",
        "id": "gTRDElAAAAAJ:maZDTaKrznsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:maZDTaKrznsC",
        "authors": [
            "Esa M Rantanen",
            "Jessica CM Gonzalez de Sather"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2003/10",
        "description": "A special project involving a campus utility plant HMI evaluation was offered to a group of undergraduate students enrolled in an introductory human factors class. Fifteen out of 55 students enrolled in the course volunteered for the special project. Specific subtasks were created in collaboration with the plant management and allocated to subgroups of students. These subtasks were scheduled to coincide with corresponding topics in the course. Evaluated by both the educational outcomes and the usefulness of the project deliverables to the power plant, the project clearly represents a beneficial situation to both students and instructors. The value of hands-on experience with task analysis, control room design, and HMI design to the students is undisputable. This case is also exemplary in terms of providing a service to the University community as a byproduct of the academic pursuits.",
        "citations": 3
    },
    {
        "title": "Human factors considerations in the design of an aircraft maintenance hangar",
        "id": "gTRDElAAAAAJ:e5wmG9Sq2KIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:e5wmG9Sq2KIC",
        "authors": [
            "Esa M Rantanen",
            "Thomas A Butts",
            "David S Wojtowicz",
            "Michelle L Webb",
            "Ann K Marin"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2003/10",
        "description": "Many human factors issues in aircraft maintenance are directly related to the technicians' working environment and can be addressed in the maintenance facility design. The goal of this project was to identify and catalog human factors issues that should be considered from the outset in the design of a new maintenance facility for the Institute of Aviation at the University of Illinois. Towards this end, the structure and functionality of the existing hangar was examined, the technicians were interviewed, and their tasks analyzed. Based on these data as well as results from link- and activity relationship analyses, human factors requirements were listed for each functional area of the proposed facility. A suggested layout for the new facility represents an optimum relative arrangement of the workspaces, positioning of the aircraft in the main hangar, and the flow of tools, materials, and documents within the facility from an …",
        "citations": 5
    },
    {
        "title": "Timing of discrete actions: Evidence for perceptual dominance in human performance",
        "id": "gTRDElAAAAAJ:HDshCWvjkbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:HDshCWvjkbEC",
        "authors": [
            "Xidong Xu",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2003/10",
        "description": "An experiment involving a street-crossing task is described. The subjects were required to release a pedestrian within a narrow window of opportunity to cross the road without being run over by vehicles. To test a number of hypotheses on whether timing of actions is driven by perceptual cues or some internal clocking mechanisms, the experiment involved conditions where the street-crossing task was either visible throughout trials or where the vehicles were removed, and coupled with a concurrent mental arithmetic loading task with either visually or auditorily presented stimuli The data support the hypothesis that when the stimuli remain visible, people predominantly rely on perceptual cues for timing discrete actions. Significant performance decrements were observed in the removal conditions Importance of the visual component in the task performance was supported by the larger performance decrement in the …",
        "citations": 3
    },
    {
        "title": "Personal computer aviation training devices: Their effectiveness for maintaining instrument currency",
        "id": "gTRDElAAAAAJ:UebtZRa9Y70C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:UebtZRa9Y70C",
        "authors": [
            "Donald A Talleur",
            "Henry L Taylor",
            "Tom W Emanuel Jr",
            "Esa Rantanen",
            "Gary L Bradshaw"
        ],
        "pub_source": "The International Journal of Aviation Psychology",
        "pub_date": "2003/10/1",
        "description": "This study examined the effectiveness of personal computer aviation training devices (PCATDs) for maintaining the Federal Aviation Administration's instrument-currency requirement. One hundred and six instrument-current pilots received an instrument proficiency check (IPC) and were assigned equally to 3 independent training groups (aircraft, flight training device [FTD], and PCATD) and to a control group who received no training. The 3 training groups received recurrent training in their respective devices over the course of a 6-month period, following which all 4 groups received a second IPC. Pilots trained in the FTD and PCATD performed (a) comparably; (b) significantly better than the control group, indicating positive transfer of training; and (c) at least as well as the aircraft group.",
        "citations": 32
    },
    {
        "title": "Imperfect automation in aviation traffic alerts: A review of conflict detection algorithms and their implications for human factors research",
        "id": "gTRDElAAAAAJ:Tyk-4Ss8FVUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Tyk-4Ss8FVUC",
        "authors": [
            "Lisa C Thomas",
            "Christopher D Wickens",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 47 (3 …",
        "pub_date": "2003/10",
        "description": "Automated warning and alert devices such as airborne collision avoidance systems (ACASs) represent a class of automation that is often found to be imperfect. The imperfections can be expressed as the number of false alarms or missed events. Most ACASs are constructed with a bias to prevent misses (which may have catastrophic consequences) and therefore, coupled with a low base-rate of conflict events, create high false alarm rates. In this paper, we review the adequacy of various CDTI warning algorithms that have been proposed and tested in addressing the false alarm issue, and the potential for multiple levels of alerting to mitigate the effects of false alarms on trust and reliance on the CDTI. We suggest new directions for future research, including evaluating the effects of false alarm rates on pilots' use of the CDTI, determining what strategies may enhance pilot tolerance of false alarms, and investigating …",
        "citations": 37
    },
    {
        "title": "Conflict detection in air traffic control: A task analysis, a literature review, and a need for further research",
        "id": "gTRDElAAAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Xidong Xu",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the 12th International Symposium on Aviation Psychology, 1289 …",
        "pub_date": "2003/4/14",
        "description": "A task analysis for a typical air traffic control conflict detection scenario is described. Two types of prediction components are identified,(1) a relative judgment (RJ) task with regard to which aircraft will reach the projected point of intersection first, and (2) a prediction-motion (PM) task estimating the time-to-collide if the aircraft will reach the intersection simultaneously. Also identified are several alternative strategies that can be potentially used by controllers to perform the RJ and PM tasks. Following the task analysis, a literature review on factors influencing the RJ and PM performance reveals that although there are a number of studies on controller performance in conflict detection, almost no one has studied how the controller actually performs the RJ and PM tasks. Finally, a number of potential research questions are proposed with an aim to shed new light on the human attention/cognition mechanisms involved in the prediction tasks in ATC and hopefully contribute to the knowledge base regarding motion prediction involving multiple objects or multiple tasks.",
        "citations": 40
    },
    {
        "title": "Drift in blind reciprocal aiming movements",
        "id": "gTRDElAAAAAJ:-f6ydRqryjwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:-f6ydRqryjwC",
        "authors": [
            "Esa M Rantanen",
            "David A Rosenbaum"
        ],
        "pub_source": "Motor Control",
        "pub_date": "2003/4/1",
        "description": "There is anecdotal evidence of drift in various reciprocal motor tasks, but as far as is known, no investigations into this phenomenon have been reported. Yet, systematic drift can potentially explain a significant proportion of the total variability in motor output. Three experiments were conducted to ascertain the nature of drift in reciprocal aiming tasks and to develop methods and measures to isolate and quantify drift for analyses. We also evaluated a computational posture-based model of reaching movements with respect to the findings of the experiments. Drift was observed in all three experiments, generally toward the middle of the joint motility range. Simulations based on the model produced drift to the middle of the task movement range rather than middle of the joint movement range. Adding noise to the model could increase its power for simulating the underlying principles of movement control as reflected in …",
        "citations": 6
    },
    {
        "title": "Measurement of the visual field",
        "id": "gTRDElAAAAAJ:Wp0gIr-vW9MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Wp0gIr-vW9MC",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "Perceptual and Motor Skills",
        "pub_date": "2003/2",
        "description": "There is increasing evidence that concurrent visual and nonvisual tasks not only reduce the size but also result in systematic deformation of the visual field. Given such complex changes in the visual field, appropriate representation and measurement of its shape is all important. Shape measures utilized by tesearchcrs and reported in the literature should also be sufficiently standardized to allow comparison of results across experiments.",
        "citations": 8
    },
    {
        "title": "Effectiveness of personal computers to meet recency of experience requirements",
        "id": "gTRDElAAAAAJ:5nxA0vEk-isC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:5nxA0vEk-isC",
        "authors": [
            "Henry L Taylor",
            "DA Talleur",
            "GL Bradshaw",
            "TW Emanuel Jr",
            "E Rantanen",
            "CL Hulin",
            "L Lendrum"
        ],
        "pub_source": "United States. Department of Transportation. Federal Aviation Administration …",
        "pub_date": "2003/2/1",
        "description": "The purpose of the current study was to investigate the effectiveness of Personal Computer Aviation Training Devises (PCATDs) and Flight Traning Devices (FTDs) to meet FAA recency of experience requirements for instrument flight. Two types of training devices were tested: 1) an FAA approved PCATD; and 2) a Frasca 141 FTD. An Instrument Proficiency Check (IPC) was given to all subjects in the airplane to establish a performance baseline (IPC #1). After the completion of IPC #1 in the airplane, the subjects were randomly assigned to one of four groups: the PCATD, the FTD, the aircraft or the control group with a balancing constraint so that the subjects successfully completing IPC #1 were equally distributed among the four groups. During the six-month period, each subject received two recency of experience flights of about 1.8 hours each in either the PCATD, the FTD or the aircraft; the control group received no recency training. These recency of experience flights included three instrument approaches, holding procedures, and intercepting and tracking navigation radials and courses. After the six-month period, performance on an IPC in the airplane (IPC #2) compared pilots who received recency of experience in the training devices to a control group. The subjects in the PCATD and FTD group were also compared to the aircraft group who received recency of experience in the airplane. A comparison of the three training groups with the control group performance on the final instrument proficiency check indicated that the training groups performed significantly better than the control group. The study also indicated that PCATDs are effective …",
        "citations": 19
    },
    {
        "title": "Comparison of the Effectiveness of a Personal Computer Aviation Training Device, a Flight Training Device, and an Airplane in Conducting Instrument Proficiency Checks",
        "id": "gTRDElAAAAAJ:a0OBvERweLwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:a0OBvERweLwC",
        "authors": [
            "Tom W Emanuel Jr",
            "Henry L Taylor",
            "Donald A Talleur",
            "Esa M Rantanen"
        ],
        "pub_source": "12th International Symposium on Aviation Psychology, 2003University of Illinois, Urbana-Champaign",
        "pub_date": "2003",
        "description": "In order to maintain instrument currency, instrument pilots must meet the recency of experience requirements of FAR 61.57 (c) or (d) every six months. The recency of experience requirements may be conducted in an airplane or simulated in an approved flight training device (FTD). If an instrument pilot fails to meet recency of experience requirements within a 12-month period, an instrument proficiency check (IPC) must be accomplished with a certified flight instructor, instrument (CFII) to regain instrument currency. This project seeks to evaluate the effectiveness of a personal computer aviation training device (PCATD) and a FTD in conducting an IPC. The study will compare the performance of pilots receiving an IPC in a PCATD, in a FTD or in an airplane (IPC# 1) with performance on an IPC in an airplane (IPC# 2). This comparison between a PCATD and an airplane will investigate the effectiveness of the PCATD in administering an IPC. Currently, the PCATD is not approved for IPCs. The IPC requirements are indicated in the Instrument Pilot Practical Test Standards (US Dept. of Transportation, 1998). The comparison between a Frasca and the airplane will determine whether the current rule to permit IPCs in a FTD is warranted. Finally, the performance of pilots receiving IPC# 1 in an airplane will be compared with IPC# 2 in an airplane with a second CFII. This comparison will permit the determination of the reliability of IPCs conducted in an airplane."
    },
    {
        "title": "Human Factors Implications of Air Traffic Management Procedures and Algorithms",
        "id": "gTRDElAAAAAJ:g5m5HwL7SMYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:g5m5HwL7SMYC",
        "authors": [
            "Esa M Rantanen",
            "Wayne J Davis"
        ],
        "pub_source": "12th International Symposium on Aviation Psychology, 2003University of Illinois, Urbana-Champaign",
        "pub_date": "2003",
        "description": "This paper describes how the air traffic management (ATM) problem is primarily temporal, sequencing arrivals at intervals such that the acceptance rate of a given runway is not exceeded. The current air traffic control automation efforts are based on time-based metering of arrivals to major airports in the National Airspace System (NAS). Such metering systems assist controllers and air traffic managers by extending the prediction and projection horizons beyond to what is within the capabilities of unaided human cognition and provide through a number of different interfaces early warnings of excessive demand and feedback on the effect of various responses. However, the procedures to manage excessive demand are difficult to administer and result in compounding delays and wasted resources. This paper describes an algorithm that computes customized transition trajectories for aircraft approaching a designated runway in a manner that ensures minimum regulatory separation between successive aircraft. Putative benefits of the algorithm include maximal use of available resources, dynamic transitions between free and controlled flight, and reallocation of functions between human controllers and automated systems."
    },
    {
        "title": "Taxonomies of measures in air traffic control research",
        "id": "gTRDElAAAAAJ:Zph67rFs4hoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Zph67rFs4hoC",
        "authors": [
            "Esa M Rantanen",
            "Ashley Nunes"
        ],
        "pub_source": "12th International Symposium on Aviation Psychology, 2003University of Illinois, Urbana-Champaign",
        "pub_date": "2003",
        "description": "This paper describes how the demands by airlines in recent years to move away from the constraints of the current air traffic control (ATC) system have prompted much research in two related avenues of human factors. The first is concerned with assessing the effects implementing advanced ATC concepts, such as Free Flight, on controller performance, whereas the second is concerned with determining how automated tools can help controllers ensure that this performance is not negatively affected by the implementation of such concepts themselves. In both instances, a systematic evaluation process is required to make such assessments. Such evaluations however, have traditionally proven to be an arduous task given the relative difficulty of selecting the appropriate performance measure to effectively answer the research question being addressed. This paper tackles this problem by providing an evolving taxonomy of ATC performance measures. The goal of providing this taxonomy is to help researchers more easily identify and apply the relevant measurement techniques during empirical investigation.",
        "citations": 10
    },
    {
        "title": "Incremental training effectiveness of personal computers used for instrument training",
        "id": "gTRDElAAAAAJ:WF5omc3nYNoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:WF5omc3nYNoC",
        "authors": [
            "Henry L Taylor",
            "Donald A Talleur",
            "Tom W Emanuel Jr",
            "Esa M Rantanen",
            "Gary L Bradshaw",
            "Sybil I Phillips"
        ],
        "pub_source": "12th International Symposium on Aviation Psychology, 2003University of Illinois, Urbana-Champaign",
        "pub_date": "2003",
        "description": "This paper describes how an incremental transfer of training research design was used to measure the effectiveness of a personal computer aviation training device (PCATDP and to determine the point at which additional training in a PCATD was no longer effective. The dependent measures were trials to specific completion standards, time to complete a flight lesson and time to a successful evaluation flight. The paper describes how percent transfer, transfer effectiveness ratios (TER) and incremental transfer effectiveness ratios (ITER) were computed for each instrument task and for the time to complete a flight lesson. The data indicate that the PCATD is effective in teaching basic and advanced instrument tasks to private pilots, which replicated the findings of an earlier study. As a result of prior training in a PCATD, trials, time to complete the flight lesson and time to a successful evaluation flight were less when compared to an airplane Control group. Overall, the greatest effect was found for the PCATD 5 group, which was predicted by the incremental transfer of training theory of Roscoe.",
        "citations": 21
    },
    {
        "title": "The Impact of Communication Delays on Air Traffic Controllers' Vectoring Performance",
        "id": "gTRDElAAAAAJ:TQgYirikUcIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:TQgYirikUcIC",
        "authors": [
            "Esa M Rantanen",
            "Jason S McCarley",
            "Xidong Xu"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2002/9",
        "description": "An experiment was conducted to investigate the impact of communication delays in the pilot—controller communication loop on air traffic controllers' performance and workload. Four levels of constant systemic audio delay (AD), 150, 250 ms, 350 ms, and 1,000 ms, and two levels of variable pilot delay (PD), zero delay and realistic delay, were employed. Vectoring accuracy and the controller's final turn initiation served as dependent variables. Subjective workload was measured by the NASA-TLX workload index. Eight subjects proficient in the task participated in the experiment. Random PD had significant effects on both vectoring accuracy and final turn initiation; accuracy was reduced and initiation times were earlier when PD was added. However, data showed no effect of AD on vectoring accuracy, and no evidence of compensatory strategies in response to increasing AD levels. Results suggest that variability in …",
        "citations": 4
    },
    {
        "title": "Pilot error in copying air traffic control clearances",
        "id": "gTRDElAAAAAJ:LkGwnXOMwfcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:LkGwnXOMwfcC",
        "authors": [
            "Esa M Rantanen",
            "Nina K Kokayeff"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2002/9",
        "description": "A study investigating the accuracy of pilots' copying air traffic control clearances is described. Twentyfour airline pilots listened to 28 taped clearances and copied them down on an answer sheet using shorthand, longhand, or some combination of these according to their preferences. The copied clearances were analyzed by the number of correctly copied elements, the number of omitted elements, and the number of extraneous elements that were not present in the original clearance. Preliminary results indicate a strong influence of habit and familiar operating environment and procedures on the accuracy of copying unfamiliar information. Common errors included victor-airways copied as jet-airways, low altitudes copied as much higher, and slow speeds copied as much higher. The vulnerability of controller-pilot communications to the effects of unfamiliarity is apparent. A detailed analysis of these data may provide …",
        "citations": 20
    },
    {
        "title": "Incremental training effectiveness of personal computer aviation training devices (PCATD) used for instrument training",
        "id": "gTRDElAAAAAJ:eq2jaN3J8jMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:eq2jaN3J8jMC",
        "authors": [
            "Henry L Taylor",
            "DA Talleur",
            "TW Emanuel Jr",
            "EM Rantanen",
            "GL Bradshaw",
            "SI Phillips"
        ],
        "pub_source": "University of Illinois at Urbana-Champaign, Aviation Research Lab",
        "pub_date": "2002",
        "citations": 9
    },
    {
        "title": "ARL",
        "id": "gTRDElAAAAAJ:EUQCXRtRnyEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:EUQCXRtRnyEC",
        "authors": [
            "Douglas A Wiegmann",
            "Esa Rantanen"
        ],
        "pub_source": "",
        "pub_date": "2002/1",
        "description": "One of the main factors in all aviation accidents is human error. The NASA Aviation Safety Program (AvSP), therefore, has identified several human-factors safety technologies to address this issue. Some technologies directly address human error either by attempting to reduce the occurrence of errors or by mitigating the negative consequences of errors. However, new technologies and system changes may also introduce new error opportunities or even induce different types of errors. Consequently, a thorough understanding of the relationship between error classes and technology “fixes” is crucial for the evaluation of intervention strategies outlined in the AvSP, so that resources can be effectively directed to maximize the benefit to flight safety. The purpose of the present project, therefore, was to examine the repositories of human factors data to identify the possible relationship between different error class and technology intervention strategies. The first phase of the project, which is summarized here, involved the development of prototype data structures or matrices that map errors onto “fixes”(and vice versa), with the hope of facilitating the development of standards for evaluating safety products. Possible follow-on phases of this project are also discussed. These additional efforts include a thorough and detailed review of the literature to fill in the data matrix and the construction of a complete database and standards checklists."
    },
    {
        "title": "Defining the relationship between human error classes and technology intervention strategies",
        "id": "gTRDElAAAAAJ:roLk4NBRz8UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:roLk4NBRz8UC",
        "authors": [
            "Douglas A Wiegmann",
            "Esa Rantanen",
            "Vicki K Crisp"
        ],
        "pub_source": "",
        "pub_date": "2002/1/1",
        "description": "One of the main factors in all aviation accidents is human error. The NASA Aviation Safety Program (AvSP), therefore, has identified several human-factors safety technologies to address this issue. Some technologies directly address human error either by attempting to reduce the occurrence of errors or by mitigating the negative consequences of errors. However, new technologies and system changes may also introduce new error opportunities or even induce different types of errors. Consequently, a thorough understanding of the relationship between error classes and technology \"fixes\" is crucial for the evaluation of intervention strategies outlined in the AvSP, so that resources can be effectively directed to maximize the benefit to flight safety. The purpose of the present project, therefore, was to examine the repositories of human factors data to identify the possible relationship between different error class and technology intervention strategies. The first phase of the project, which is summarized here, involved the development of prototype data structures or matrices that map errors onto \"fixes\" (and vice versa), with the hope of facilitating the development of standards for evaluating safety products. Possible follow-on phases of this project are also discussed. These additional efforts include a thorough and detailed review of the literature to fill in the data matrix and the construction of a complete database and standards checklists.",
        "citations": 16
    },
    {
        "title": "ARL",
        "id": "gTRDElAAAAAJ:xtRiw3GOFMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:xtRiw3GOFMkC",
        "authors": [
            "Esa Rantanen",
            "Jason McCarley",
            "Xu Xidong",
            "Sharon Yeakel"
        ],
        "pub_source": "",
        "pub_date": "2001/12",
        "description": "Two experiments were conducted to investigate the impact of an additional audio delay (AD) in the pilot controller communication loop brought about by the NEXCOM technology on air traffic controllers ‘performance, workload, and subjective acceptability. The experiments modeled two scenarios where AD would have dire effect on controller performance and system safety, a final sequencing task in Experiment 1 and a conflict resolution task in Experiment 2. The independent variables were same in both experiments: Four levels of AD were employed, a 150 ms delay, representing the present analog system, 250 ms, 350 ms, and 1,000 ms delay. The last condition represented the maximum delay associated with the system. Two levels of random pilot delayb (PD) were also employed, zero delay and realistic delay. The zero delay condition allowed investigation of the impact of the different AD levels in isolation …"
    },
    {
        "title": "Human performance in timing of discrete actions",
        "id": "gTRDElAAAAAJ:_kc_bZDykSQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:_kc_bZDykSQC",
        "authors": [
            "Esa M Rantanen",
            "Xidong Xu"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "2001/10",
        "description": "An experiment on human timing performance is described. A scenario of street crossing without the aid of traffic lights was presented on a computer screen. The subjects' task was to let a pedestrian to cross the street between successive vehicles by pressing a key. Independent variables were the size of the gap between vehicles and the speed of the traffic stream. The subjects' performance was evaluated by the distributions of the crossing initiation times and the proportions of two types of timing errors in the experimental conditions: Too early and too late releases of the pedestrian. Increasing the accuracy requirement by reducing the duration of the window of opportunity resulted in a shift to earlier release times, smaller standard deviations of the release time distributions, and increased proportions of the “too early” errors. Our results show a way to include also the tails of the response distributions in the analyses.",
        "citations": 7
    },
    {
        "title": "Design considerations for web-based applications",
        "id": "gTRDElAAAAAJ:eQOLeE2rZwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:eQOLeE2rZwMC",
        "authors": [
            "Luke Wroblewski",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting 45 …",
        "pub_date": "2001/10",
        "description": "The rapid growth of weblications—application-oriented software delivered as a service over the Web—has revealed a lack of effective guidelines for their design and implementation. Existing Web usability guidelines hinder weblication usability since they are primarily based on interactions within a browsing metaphor. Interface design guidelines for client applications, on the other hand, do not address the conventions of Web users, limitations of the Web environment, nor the new possibilities inherent in the Web. This paper outlines a set of guidelines for weblication interfaces, which fuse translated client-application guidelines and re-purposed Web usability guidelines together to form a solid foundation for weblication interface design. The goal of these recommendations is to address the issues associated with weblication interface design and to present an overall method for thinking about them, emphasizing an …",
        "citations": 26
    },
    {
        "title": "Derivation of pilot performance measures from flight data recorder information",
        "id": "gTRDElAAAAAJ:qxL8FJ1GzNcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:qxL8FJ1GzNcC",
        "authors": [
            "Esa M Rantanen",
            "Donald A Talleur",
            "Henry L Taylor",
            "Gary L Bradshaw",
            "Tom W Emanuel Jr",
            "Lester Lendrum",
            "Charles L Hulin",
            "IL Savoy"
        ],
        "pub_source": "11th International Symposium on Aviation Psychology",
        "pub_date": "2001/3",
        "description": "Flight Data Recorder (FDR) data has proven invaluable in accident and incident analysis to determine the aircraft states and crew actions in abnormal or emergency situations. With advanced technology the quality and quantity of such data have substantially improved, and these data have also become more accessible than before. Consequently, a number of participating airlines have begun to routinely analyze the flight data from regular flights within Flight Operational Quality Assurance (FOQA) programs to identify patterns of irregularities and potentially hazardous situations (Brandt, 1999). Objective FDR data could also be particularly valuable in training and pilot performance assessment for research purposes, where accurate quantitative data could not be obtained otherwise.Although the current FDRs provide a wealth of data that can be efficiently handled and stored, information extraction from these data is hampered by the lack of proven performance measures. For example, only when predetermined parameter values are exceeded are they automatically flagged in the FOQA data; but a detailed analysis of these instances must be done manually. Because manual analysis of the FDR data is labor-intensive and time consuming, it may not be carried out in appropriate detail, and much useful information is thus lost.",
        "citations": 14
    },
    {
        "title": "Measurement of pilot performance during instrument flight using flight data recorders",
        "id": "gTRDElAAAAAJ:sSrBHYA8nusC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:sSrBHYA8nusC",
        "authors": [
            "EM Rantanen",
            "DA Talleur"
        ],
        "pub_source": "International Journal of Aviation Research and Development",
        "pub_date": "2001",
        "citations": 14
    },
    {
        "title": "Computerized Electoral Ballot Design Using a Touch Screen",
        "id": "gTRDElAAAAAJ:cFHS6HbyZ2cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:cFHS6HbyZ2cC",
        "authors": [
            "Abigail A Ebbing",
            "Esa M Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society... Annual Meeting",
        "pub_date": "2001",
        "description": "All citizens of the United States over the age of 18 have the right to vote. Those who so choose should be able to exercise this right effectively and without confusion. The year 2000 presidential election indicated that many voters were flustered by the ballot, however, leading to the widely debated controversies about the results. Particularly in Palm Beach County, Florida, several display design principles were violated on the ballot, leading to problems for the diverse population using it. This demonstration presents a new system designed to decrease the number of voting errors and facilitate an efficient tallying system, further reducing errors in the counting process. The redesigned ballot also proposes a nationwide standard to alleviate many of the problems exposed by the November 2000 election.The general voting process with the system outlined here will remain the same: The voter arrives at the designated …"
    },
    {
        "title": "Web-Based Information Management: An Open Portal Interface Solution.",
        "id": "gTRDElAAAAAJ:blknAaTinKkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:blknAaTinKkC",
        "authors": [
            "Luke Wroblewski",
            "Esa M Rantanen"
        ],
        "pub_source": "Human Computer Interaction International Conference",
        "pub_date": "2001",
        "description": "A common trend in information management today is the distribution of large quantities of data through a single interface. This is exemplified in web accessible “portals”, which grant users access to multiple information sources through a single web page. These “portals” include not only the familiar Yahoo®-like web sites, but also corporate intranets and scientific workspaces. The basic problem facing all such implementations is that too much information is presented on insufficient screen space. The result is information delivery interfaces, which are confusing, overwhelming, and often so full of information that it is difficult for a user to locate the data they seek. The second major problem with web-based information portals is that the amount of user preferences they support is minimal. At best, one can choose their page elements, which column they reside in, and a possible color set. The intent of this demonstration is to present a better way of managing multiple web-accessible information sources within a single, highly customizable interface that utilizes the principles of web-based application interface design. The demonstration will consist of an online interactive tutorial. The tutorial will first point out flaws within current web-based information management systems by allowing a user to manipulate these systems and offering explanations of why certain elements in their interfaces are insufficient for proper information handling. The second stage of the demonstration will describe in detail the National Center for Supercomputing Applications’(NCSA) Open Portal Interface Environment (OPIE) and, in an interactive manner, point out its particular …",
        "citations": 3
    },
    {
        "title": "Effectiveness of a personal computer aviation training device(PCATD) for maintaining instrument currency",
        "id": "gTRDElAAAAAJ:R3hNpaxXUhUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:R3hNpaxXUhUC",
        "authors": [
            "Donald A Talleur",
            "Henry L Taylor",
            "Gary L Bradshaw",
            "Tom W Emanuel Jr",
            "Esa Rantanen",
            "Lester Lendrum",
            "Charles L Hulin"
        ],
        "pub_source": "Focusing Attention on Aviation Safety",
        "pub_date": "2001",
        "description": "This study investigates the potential of personal Computer Aviation Training Devices (PCATDs) to substitute for actual aircraft experience for maintaining instrument currency. A Jeppesen FS-200 PCATD and a Frasca-141 flight-training device (FTD) were tested. The experiment compared the flight performance of four groups after a six-month period between instrument proficiency check (IPC) flights. The control group received no training to maintain currency in this period. Three other groups received training in either the PCATD, the Frasca, or the aircraft. Preliminary results for 106 subjects are presented. The performance of the subjects on an initial evaluation flight test and a final proficiency flight test six months later were compared. All subjects were instrument current by FAA standards prior to the evaluation flight test. Fortytwo percent of the 106 subjects passed the evaluation flight test while 52 percent passed …",
        "citations": 4
    },
    {
        "title": "Variability and drift in blind reaching movements",
        "id": "gTRDElAAAAAJ:VOx2b1Wkg3QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:VOx2b1Wkg3QC",
        "authors": [
            "Esa Markus Rantanen"
        ],
        "pub_source": "The Pennsylvania State University",
        "pub_date": "2000",
        "description": "The research paradigms and error measures commonly used in human movement research seldom account for the temporal dimension of repetitive movements. There is anecdotal evidence of drift in various reciprocal motor tasks, but as far as is known, no investigations into this phenomenon have been reported. Yet, systematic drift can potentially explain a significant proportion of the total variability in motor output.",
        "citations": 1
    },
    {
        "title": "The effect of mental workload on the visual field size and shape",
        "id": "gTRDElAAAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Esa M Rantanen",
            "Joseph H Goldberg"
        ],
        "pub_source": "Ergonomics",
        "pub_date": "1999/6/1",
        "description": "Mental workload is known to reduce the area of one's visual field, but little is known about its effects on the shape of the visual field. Considering this, the visual fields of 13 subjects were measured concurrently under three levels of mental workload using a Goldmann visual perimeter. Tone counting tasks were employed to induce mental workload, avoiding interference with visual performance. Various methods of shape measurement and analysis were used to investigate the variation of the shape of the visual field as a function of mental load. As expected, the mean area of visual fields reduced to 92.2% in the medium workload condition and to 86.41% under heavy workload, compared to light load condition. This tunnelling effect was not uniform, but resulted in statistically significant shape distortion as well, as measured by the majority of the 12 shape indices used here. These results have visual performance …",
        "citations": 239
    },
    {
        "title": "Modeling air traffic controller selection test battery tasks",
        "id": "gTRDElAAAAAJ:M05iB0D1s5AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:M05iB0D1s5AC",
        "authors": [
            "Esa Rantanen",
            "Hoben Thomas"
        ],
        "pub_source": "International Symposium on Aviation Psychology, 10 th, Columbus, OH",
        "pub_date": "1999",
        "description": "The problem of selecting controller applicants for training is twofold: First, individual characteristics that correlate with successful performance in the profession must be identified, and suitable tests devised to recognize individuals possessing such traits. Second, performance criteria must be chosen and appropriate statistical models developed to evaluate the predictive power of the screening tasks. However, in spatial and mathematical reasoning tasks it may be inappropriate to regard differences among scores as representing simply graded differences in performance, rather there are distinct subgroups within some populations. Mixed regression models, which estimate several regression functions within the same data set, offer an alternative approach. (Author)"
    },
    {
        "title": "A Hypertext Database for the Design of Visual Inspection Operations",
        "id": "gTRDElAAAAAJ:dfsIfKJdRG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:dfsIfKJdRG4C",
        "authors": [
            "Joseph H Goldberg",
            "Xerxes P Kotval",
            "Esa Rantanen"
        ],
        "pub_source": "Proceedings of the Human Factors and Ergonomics Society Annual Meeting",
        "pub_date": "1996/10",
        "description": "A hypertext database was developed to aid a corporate in its evaluation and redesign of visual inspection operations. Inspection-sensitive factors were integrated into an overall framework, literature was summarized, then sites were visited to measure the levels and impacts of these factors on visual inspection operations. This information is available in many locations of the package. The resulting HTML package allows managers, engineers, and others to start either with a facility or with a specific inspection factor, then work down to the level of literature, finding appropriate answers, in one integrated framework."
    },
    {
        "title": "The Effect of Mental Workload on the Size and Shape of the Visual Field",
        "id": "gTRDElAAAAAJ:LPZeul_q3PIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:LPZeul_q3PIC",
        "authors": [
            "Esa M Rantanen"
        ],
        "pub_source": "Pennsylvania State University",
        "pub_date": "1996",
        "citations": 1
    },
    {
        "title": "Perception of symmetry in polygon displays",
        "id": "gTRDElAAAAAJ:k_IJM867U9cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:k_IJM867U9cC",
        "authors": [
            "EM Rantanem",
            "Joseph H Goldberg"
        ],
        "pub_source": "NPIC&HMIT",
        "pub_date": "1996",
        "description": "The safety parameter display for nuclear power plants is an example of an object display which integrates several parameters into a single display. The purpose of this study was to determine the just noticeable difference (JND) in regularity for two polygonal figures, a pentagon and an octagon, which mimicked polar graphic safety parameter displays. It was hypothesized that the subjects would be able to detect smaller deviations from a regular shape in an octagon, which is more redundant than a pentagon. Additionally, it was hypothesized that outward deviations would be better detected than inward deviations, as well as deviations along vertices close to the edges of the computer screen. All these issues have implications in display design.Two experiments were conducted. Eight graduate students volunteered as subjects in both experiments. The stimuli were presented on a computer screen and the subjects indicated whether the shape presented was regular or irregular by pressing the appropriate key on the keyboard. In Experiment 1 the independent variables were the type of the polygon (octagon or pentagon), direction of deviation of a vertex (inward or outward), and the magnitude of the deviation (1, 3, and 6%). The response variables were the hit rate, a sensitivity measure d’, criterion measure β, and the reaction time. Only the deviation magnitude had a statistically significant effect on performance, but the scale used (1, 3, and 6% deviations) proved to be too coarse for accurate determination of the JND.",
        "citations": 6
    },
    {
        "title": "Applying Quality Function Deployment to Air Traffic Control Curriculum at Embry-Riddle Aeronautical University",
        "id": "gTRDElAAAAAJ:j8SEvjWlNXcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:j8SEvjWlNXcC",
        "authors": [
            "Esa M Rantanen",
            "Glenn L Spach"
        ],
        "pub_source": "Annual Air Traffic Control Association Fall Conference Proceedings",
        "pub_date": "1995",
        "description": "Lee Spach is an FAA-certified pilot with 10 years flying experience. He received his BS in Aerospace Studies from Embry-Riddle Aeronautical University in 1994. Currently he is pursuing a Master of Aeronautical Science-degree at Embry-Riddle and serves as a graduate assistant and an adjunct instructor for the University's ATC courses. Mr. Spach is involved in developing an aviation English curriculum and implementation of TQM into the ATC program at ERAU."
    },
    {
        "title": "The role of dynamic memory in air traffic controllers situation awareness",
        "id": "gTRDElAAAAAJ:L8Ckcad2t8MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:L8Ckcad2t8MC",
        "authors": [
            "Esa Rantanen"
        ],
        "pub_source": "Situational awareness in complex systems",
        "pub_date": "1994",
        "description": "Although the term situation awareness is fairly new, air traffic controllers have always been familiar with the concept. Controllers refer to their situation awareness as the\" picture\", either\" having the picture\" or\" losing the picture\". The current definitions of situation awareness (eg, Endsley, cited in Garland, Phillips, Tilden, and Wise, 1991) quite accurately describe the demands of air traffic control (ATC) as well, and make the controller's picture synonymous with situation awareness. In the following text, the terms\" picture\" and\" situation awareness\" are used interchangeably. The air traffic controller's memory is very important in ATC in general, but especially in the maintenance of the controller's picture. Because of the nature of the job and the environment in which controllers work, their dynamic memory in particular has a central role in updating the picture. There is, however, very little research done on the relationships between the controllers picture, dynamic memory, and workload, all of which are 0 fundamental concepts of ATC. This paper will attempt to suggest some of these relationships and raise questions about the role of the dynamic memory in the air traffic controller's situation awareness.",
        "citations": 11
    },
    {
        "title": "The effect of active and passive control on air traffic controller dynamic memory",
        "id": "gTRDElAAAAAJ:f2IySw72cVMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:f2IySw72cVMC",
        "authors": [
            "Esa Markus Rantanen"
        ],
        "pub_source": "Embry-Riddle Aeronautical University",
        "pub_date": "1993",
        "description": "Conclusions................................................................................................... 21Purpose of the Study............................................................................................. 22Method........................................................................................................................ 23Subjects................................................................................................................ 23Instruments........................................................................................................... 23Simulator....................................................................................................... 24Scenarios....................................................................................................... 24viiTest............................................................................................................... 25Design.................................................................................................................. 25Experiment I.................................................................................................. 26Experiment II................................................................................................ 27Validity considerations................................................................................... 28Procedure …"
    },
    {
        "title": "PROBLEM STATEMENT: RESULTS: VULNERABILITY AND VALENCE ANALYSIS",
        "id": "gTRDElAAAAAJ:ipzZ9siozwsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:ipzZ9siozwsC",
        "authors": [
            "Faithful C Onwuegbuche",
            "Rajesh Titung",
            "Esa Rantanen",
            "Anca D Jurcut",
            "Cecilia Alm",
            "Liliana Pasquale"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Faithful C. Onwuegbuche, Rajesh Titung, Esa Rantanen, Anca D. Jurcut, Cecilia Alm, \nLiliana Pasquale PROBLEM STATEMENT: RESULTS: Page 1 1 2 3 4 References [1] \nMUNCASTER, P. What is phishing and how do you prevent phishing attacks? https://www.verizon.com/business/resources/articles/s/whatis-phishing-and-how-do-you-prevent-phishing-attacks/ \n[2] PROOFPOINT. 2022 State of Phishing. https://go.proofpoint.com/en-2022-state-of-the-phish.html \n[3] CIALDINI, RB, AND CIALDINI, RB Influence: The psychology of persuasion, vol. 55. \nCollins New York, 2007. [4] SCHNEIER, B. A Hacker’s Mind: How the Powerful Bend Society’s \nRules, and how to Bend Them Back. WW Norton & Company, 2023. [5] CIAMBRONE,G.,ANDWILSON,S. \nCreation and analysis of a corpus of scam emails targeting universities. In Companion \nProceedings of the ACM Web Conference 2023 (New York, NY, USA, 2023), WWW ’23 …"
    },
    {
        "title": "Share on",
        "id": "gTRDElAAAAAJ:N5tVd3kTz84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:N5tVd3kTz84C",
        "authors": [
            "Cristina Albuquerque",
            "Ciprian Baciu",
            "Stephan Bauer",
            "Peter Beer",
            "Sonja Biede",
            "Reinhard Braunstingl",
            "Lori Brown",
            "Barbara Burian",
            "Bert Busscher",
            "James Christensen",
            "Tim Coombs",
            "Samuel Cromie",
            "Robert J de Boer",
            "Katia Defrancq",
            "Doris Dehn",
            "Key Dismukes",
            "André Droog",
            "Hinnerk Eißfeldt",
            "Carina Eriksen",
            "Solveig Eschen",
            "Karl Fennell",
            "Kazuo Furuta",
            "Kerstin Gaisbachgrabner",
            "Valerie Gawron",
            "Gudela Grote",
            "Gerhard Gruber",
            "Don Harris",
            "Brian Hilburn",
            "David Hunter",
            "Peter Jorna",
            "Nektarios Karanikas",
            "Raymond E King",
            "Uwe Klingauf",
            "Harald Kolrep",
            "Kara A Latorella",
            "Wen-Chin Li",
            "Steve K Lilley",
            "Shem Malmquist",
            "Lena Martensson",
            "Monica Martinussen",
            "Norman Maxim",
            "Preven Naidoo",
            "Jan Noyes",
            "Esa Rantanen",
            "Stefan Rentsch",
            "Jan Joris Roessingh",
            "Wolfgang Roth",
            "Christoph Santel",
            "Jeffery Schroeder",
            "Marian Schuver-van Blanken",
            "Michaela Schwarz",
            "Steve Shorrock",
            "Gideon Singer",
            "Anthony J Smoker",
            "Matthew Thomas",
            "Melanie Todd",
            "Pamela Tsang",
            "Michael A Vidulich",
            "Mark Wiggins",
            "Lu Yanyu",
            "Alf Zimmer",
            "Wolf-Dietrich Zuzan"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The colleagues listed below reviewed the incoming manuscripts very conscientiously and provided constructive suggestions to many of our authors. Furthermore, in most cases they reviewed quickly, which is a fundamental prerequisite for a rapid manuscript management. The editors of Aviation Psychology and Applied Human Factors are greatly indebted to all of them."
    },
    {
        "title": "Thu, 06/27/2013-9: 58am--kxbwcs Jennifer Professor Ph. D., University of Arizona Office",
        "id": "gTRDElAAAAAJ:JoZmwDi-zQgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:JoZmwDi-zQgC",
        "authors": [
            "Suzanne Bamonto",
            "Brian Barry",
            "Joseph Baschnagel",
            "Robert Bowen",
            "A Eleanor Chand-Matzke",
            "Jessamy Comer",
            "Kirsten Condry",
            "Caroline DeLong",
            "Nicholas DiFonzo",
            "John Edlund",
            "Stephanie Godleski",
            "Andrew Herbert",
            "Rebecca Houston",
            "Jennifer Lukomski",
            "Scott Merydith",
            "Vincent Pandolfi",
            "Susan Powell",
            "Esa Rantanen",
            "Lindsay S Schenkel",
            "A Smerbeck",
            "Tina Sutton",
            "Christine VanHemel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Jennifer Lukomski has been with the Department of Psychology/School Psychology program since 1997. She is a Licensed Psychologist, and a Registered Yoga Instructor. Her research interest’s focus on deaf and hard of hearing individual’s executive functioning, social emotional functioning and resiliency. In addition, her current research exploration is in the area of dreams, and the mind-body connection."
    },
    {
        "title": "Thu, 06/27/2013-9: 49am--kxbwcs Esa Associate Professor BS and MS, Embry-Riddle Aeronautical University MSIE and PhD Engineering Psychology, Pennsylvania State University",
        "id": "gTRDElAAAAAJ:PELIpwtuRlgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:PELIpwtuRlgC",
        "authors": [
            "Suzanne Bamonto",
            "Brian Barry",
            "Joseph Baschnagel",
            "Robert Bowen",
            "A Eleanor Chand-Matzke",
            "Jessamy Comer",
            "Kirsten Condry",
            "Caroline DeLong",
            "Nicholas DiFonzo",
            "John Edlund",
            "Stephanie Godleski",
            "Andrew Herbert",
            "Rebecca Houston",
            "Jennifer Lukomski",
            "Scott Merydith",
            "Vincent Pandolfi",
            "Susan Powell",
            "Esa Rantanen",
            "Lindsay S Schenkel",
            "A Smerbeck",
            "Tina Sutton",
            "Christine VanHemel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Professor Rantanen trained as an airline pilot and worked as an air traffic controller before going back to school and into an academic career. Before joining the psychology faculty at RIT in 2007, Professor Rantanen was in the faculty of Institute of Aviation of the University of Illinois at Urbana-Champaign."
    },
    {
        "title": "Thu, 06/27/2013-10: 16am--kxbwcs Kirsten Associate Professor Ph. D., University of Minnesota Office",
        "id": "gTRDElAAAAAJ:_B80troHkn4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:_B80troHkn4C",
        "authors": [
            "Suzanne Bamonto",
            "Brian Barry",
            "Joseph Baschnagel",
            "Robert Bowen",
            "A Eleanor Chand-Matzke",
            "Jessamy Comer",
            "Kirsten Condry",
            "Caroline DeLong",
            "Nicholas DiFonzo",
            "John Edlund",
            "Stephanie Godleski",
            "Andrew Herbert",
            "Rebecca Houston",
            "Jennifer Lukomski",
            "Scott Merydith",
            "Vincent Pandolfi",
            "Susan Powell",
            "Esa Rantanen",
            "Lindsay S Schenkel",
            "A Smerbeck",
            "Tina Sutton",
            "Christine VanHemel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Dr. Kirsten Condry joined the RIT Psychology Department in 2006. Her area of expertise is in developmental psychology, where she studies learning, perception and cognitive development in children and adults. As the 2013 recipient of the Eisenhart Award for Outstanding Teaching, her recent research focus is on developing and assessing teaching techniques to improve writing and critical thinking in college courses. Another area of interest is media effects on development, including how children and babies learn through video-mediated communication (like Skype). Dr. Condry supervises senior projects that extend beyond related areas like childhood experiences and parenting to include topics like language differences and cultural influences (particularly among deaf, hard of hearing and hearing students) and the effects of media on attitudes. Dr. Condry is currently the Undergraduate Program Director for …"
    },
    {
        "title": "Thu, 06/27/2013-10: 37am--jxgwcs Vincent Associate Professor Ph. D., Hofstra University Licensed Psychologist in New York State",
        "id": "gTRDElAAAAAJ:tkaPQYYpVKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:tkaPQYYpVKoC",
        "authors": [
            "Suzanne Bamonto",
            "Brian Barry",
            "Joseph Baschnagel",
            "Robert Bowen",
            "A Eleanor Chand-Matzke",
            "Jessamy Comer",
            "Kirsten Condry",
            "Caroline DeLong",
            "Nicholas DiFonzo",
            "John Edlund",
            "Stephanie Godleski",
            "Andrew Herbert",
            "Rebecca Houston",
            "Jennifer Lukomski",
            "Scott Merydith",
            "Vincent Pandolfi",
            "Susan Powell",
            "Esa Rantanen",
            "Lindsay S Schenkel",
            "A Smerbeck",
            "Tina Sutton",
            "Christine VanHemel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Dr. Pandolfi earned his doctoral degree in Clinical and School Psychology from Hofstra University and has been a full-time faculty member at RIT since 2005. His research focuses on the assessment of youth with autism spectrum disorders (ASD). Dr. Pandolfi and his colleagues at the University of Rochester Medical Center and Hofstra University have published peer-reviewed papers and book chapters on the reliability and validity of ASD screening measures and measures used to assess for co-occurring mental health problems in this population. A major aim of this research is to help establish evidence-based assessment protocols for the evaluation of youth with ASD. Dr. Pandolfi is also a New York State licensed psychologist who specializes in the assessment and treatment of emotional and behavioral disorders in youth with ASD."
    },
    {
        "title": "Thu, 06/27/2013-10: 27am--jxgwcs Suzanne Associate Professor/School Psychology Graduate Program Director Ph. D., School Psychology, University of Oregon BA, Psychology, SUNY …",
        "id": "gTRDElAAAAAJ:Y5dfb0dijaUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Y5dfb0dijaUC",
        "authors": [
            "Suzanne Bamonto",
            "Brian Barry",
            "Joseph Baschnagel",
            "Robert Bowen",
            "A Eleanor Chand-Matzke",
            "Jessamy Comer",
            "Kirsten Condry",
            "Caroline DeLong",
            "Nicholas DiFonzo",
            "John Edlund",
            "Stephanie Godleski",
            "Andrew Herbert",
            "Rebecca Houston",
            "Jennifer Lukomski",
            "Scott Merydith",
            "Vincent Pandolfi",
            "Susan Powell",
            "Esa Rantanen",
            "Lindsay S Schenkel",
            "A Smerbeck",
            "Tina Sutton",
            "Christine VanHemel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Dr. Bamonto has been teaching in the RIT School Psychology Program since the fall of 2003. Her primary research interests are related to the use of Curriculum-Based Measurement to improve academic outcomes for students at risk for learning disabilities and academic failure, especially in the area of basic reading. Related interests include implementation of systems-level reforms such as Response to Intervention, Multi-Tier System of Supports, and family-school partnerships.Dr. Bamonto’s current projects include an investigation of the technical properties and instructional utility of CBM Vocabulary Matching in a local high school. She also is collaborating with Professor Maria Cristina Joly, an educational psychologist in Brazil, on developing a larger set of studies entitled, CBM to IDC: A cross cultural investigation of basic skills’ assessment in schools."
    },
    {
        "title": "Wed, 06/26/2013-11: 48am--kxbwcs Stephanie Assistant Professor BA, Hamilton College MA, Ph. D., University at Buffalo",
        "id": "gTRDElAAAAAJ:eMMeJKvmdy0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:eMMeJKvmdy0C",
        "authors": [
            "Suzanne Bamonto",
            "Brian Barry",
            "Joseph Baschnagel",
            "Robert Bowen",
            "A Eleanor Chand-Matzke",
            "Jessamy Comer",
            "Kirsten Condry",
            "Caroline DeLong",
            "Nicholas DiFonzo",
            "John Edlund",
            "Stephanie Godleski",
            "Andrew Herbert",
            "Rebecca Houston",
            "Jennifer Lukomski",
            "Scott Merydith",
            "Vincent Pandolfi",
            "Susan Powell",
            "Esa Rantanen",
            "Lindsay S Schenkel",
            "A Smerbeck",
            "Tina Sutton",
            "Christine VanHemel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Professor Godleski joined the Department of Psychology in the Fall of 2015. Her areas of expertise are within Clinical and Developmental Psychology. Her research focuses on developmental pathways to risk and resilience, particularly within early development from pregnancy to early childhood. In particular, she is interested in how parent and family influences (eg, parental substance use, discipline, etc) impact the development of aggressive thoughts and behaviors in childhood."
    },
    {
        "title": "Thu, 06/27/2013-10: 19am--kxbwcs Lindsay S. Associate Professor Ph. D., University of Nebraska-Lincoln Office",
        "id": "gTRDElAAAAAJ:Mojj43d5GZwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:Mojj43d5GZwC",
        "authors": [
            "Suzanne Bamonto",
            "Brian Barry",
            "Joseph Baschnagel",
            "Robert Bowen",
            "A Eleanor Chand-Matzke",
            "Jessamy Comer",
            "Kirsten Condry",
            "Caroline DeLong",
            "Nicholas DiFonzo",
            "John Edlund",
            "Stephanie Godleski",
            "Andrew Herbert",
            "Rebecca Houston",
            "Jennifer Lukomski",
            "Scott Merydith",
            "Vincent Pandolfi",
            "Susan Powell",
            "Esa Rantanen",
            "Lindsay S Schenkel",
            "A Smerbeck",
            "Tina Sutton",
            "Christine VanHemel"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Dr. Schenkel’s research is in the area of developmental psychopathology and the role of social cognition in the clinical expression of serious mental illness, particularly bipolar disorder and schizophrenia. Her work has examined emotion processing abnormalities among individuals who suffer from mood disorders as well as those who have histories of childhood trauma. Dr. Schenkel is utilizing eye tracking methodology to better understand this issue (eg, associations between atypical visual scanning and impairments in emotion recognition). Her work has also focused on relationships between early traumatic experiences and later clinical outcomes among hearing and deaf individuals. To this end, her research attempts to integrate clinical, developmental, and psychophysiological approaches in the study of risk factors for serious mental illness and social-cognitive dysfunction."
    },
    {
        "title": "Conflict Detection",
        "id": "gTRDElAAAAAJ:eflP2zaiRacC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:eflP2zaiRacC",
        "authors": [
            "Stéphanie Stankovic",
            "Esa Rantanen",
            "Nicolas Ponomarenko",
            "French Civil Aviation Authority"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The focus of current theoretical models of conflict detection concerns how controllers determine whether specific aircraft pairs that have been selectively attended will be in conflict or not. We define conflict as the potential loss of separation between two aircraft, or a situation where two aircraft would lose separation at some time in the future should they continue on their present trajectories. Consider two aircraft flying at the same altitude on converging courses. Determining whether these aircraft will violate lateral separation requires the integration of speed and distance information to predict the distance or time between the aircraft at the point of intersection of their trajectories (Law et al., 1993; Loft, Neal, & Humphreys, 2007; Neal & Kwantes, 2009). When aircraft are also changing altitude (especially in approach control), the prediction of loss of separation in the future also requires the integration of the vertical speeds and altitudes of aircraft, and the subsequent computation of whether the difference between aircraft altitudes at the time of the position overlap on the lateral plane are below a minimum separation (Stankovic, Loft, Rantanen, & Ponomarenko, in press; Xu & Rantanen, 2003). Several theoretical accounts of how controllers detect conflicts have been published (Loft, Bolland, Humphreys & Neal, 2009; Rantanen & Nunes, 2005; Stankovic, Raufaste, & Averty, 2008).In empirical studies of conflict detection, researchers have typically either asked controllers to assess the risk of conflict between aircraft or to estimate the likelihood that they would intervene on a given aircraft pair to assure separation, but there has been little consideration of …"
    },
    {
        "title": "To be presented at the 13th International Symposium on Aviation Psychology, Dayton, OH, 2005.",
        "id": "gTRDElAAAAAJ:08ZZubdj9fEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:08ZZubdj9fEC",
        "authors": [
            "Philip W Maynard",
            "Esa M Rantanen"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Many recent initiatives involving social psychology applications in the aviation world have redoubled the interest in the concept of teams and teamwork. The importance of teamwork in airline cockpits, hailed as cockpit (or crew-) resource management (CRM), has been recognized for a relatively long time. It is also widely agreed that extensive and effective interaction among participants in the National Airspace System (NAS), pilots, air traffic controllers, and airline operations personnel, is tantamount to the daily successes of the nation’s air transportation industry. Team aspects in air traffic control (ATC) are, however, much more convoluted than intra-cockpit teams or top-level teamwork between NAS elements. The ATC system involves a complicated network of facilities, technology, and personnel, which all must interact synergistically, often under time pressure, to ensure safe, efficient, and orderly flow of air traffic. It …"
    },
    {
        "title": "Meeting. Santa Monica: Human Factors and Ergonomics Society, 2004.",
        "id": "gTRDElAAAAAJ:K3LRdlH-MEoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:K3LRdlH-MEoC",
        "authors": [
            "Brian R Levinthal",
            "Esa M Rantanen"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "This paper discusses an experimental paradigm for measuring human performance under time pressure. Participants were presented with four simultaneous number-entry tasks. Entry could occur only within a discrete window of opportunity, represented visually by a target range within a variable-speed progress bar. Participants could view only one task at a time, thus performance required scanning and sampling of all four tasks. Sampling behavior (mouse movements to the vicinity of one of the four tasks) was manipulated via access effort; blocks of trials presented either a half or full second lag before a target task would become visible. Participants’ performance was evaluated by the proportion of responses completed within the required window of opportunity as well as the proportion of a window of opportunity that elapsed before the onset of a response. Results indicate a decrease in such performance as a result of display lag manipulation. The potential for the use of this paradigm in developing predictive measures of performance is discussed."
    },
    {
        "title": "Columbus, OH: The Ohio State University. 2001.",
        "id": "gTRDElAAAAAJ:OU6Ihb5iCvQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:OU6Ihb5iCvQC",
        "authors": [
            "Donald A Talleur",
            "Henry L Taylor",
            "Gary L Bradshaw",
            "Tom W Emanuel Jr",
            "Esa Rantanen",
            "Lester Lendrum",
            "Charles L Hulin"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "This study investigates the potential of personal Computer Aviation Training Devices (PCATDs) to substitute for actual aircraft experience for maintaining instrument currency. A Jeppesen FS-200 PCATD and a Frasca-141 flight-training device (FTD) were tested. The experiment compared the flight performance of four groups after a six-month period between instrument proficiency check (IPC) flights. The control group received no training to maintain currency in this period. Three other groups received training in either the PCATD, the Frasca, or the aircraft. Preliminary results for 106 subjects are presented. The performance of the subjects on an initial evaluation flight test and a final proficiency flight test six months later were compared. All subjects were instrument current by FAA standards prior to the evaluation flight test. Fortytwo percent of the 106 subjects passed the evaluation flight test while 52 percent passed …"
    },
    {
        "title": "Society. Santa Monica, CA: Human Factors and Ergonomics Society, 2003.",
        "id": "gTRDElAAAAAJ:UxriW0iASnsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:UxriW0iASnsC",
        "authors": [
            "Esa M Rantanen",
            "Jessica С M Gonzalez de Sather"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "A special project involving a campus utility plant I-LMI evaluation was offered to a group of undergradtlate students enrolled in an introductory human factors class. Fifteen out of 55 students enrolled in the course volunteered for the special project. Speciﬁc subtasm were created in collaboration with the plant management and allocated to subgroups of students. These subtasks were scheduled to coincide with corresponding topics in the course. Evaluated by both the educational outcomes and the usefulness of the project deliverables to the power plant, the project clearly represents a beneﬁcial situation to ‘both students and instructors. The value of hands-on experience with task analysis, control room design, and HMJ design to the students is uridisputable. This case is also exemplary in terms of providing a service to the University community as a byproduct of the academic pursuits."
    },
    {
        "title": "To be presented at the 12th International Symposium on Aviation Psychology, Dayton, OH, 2003.",
        "id": "gTRDElAAAAAJ:KxtntwgDAa4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:KxtntwgDAa4C",
        "authors": [
            "Xidong Xu",
            "Esa M Rantanen"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "A task analysis for a typical air traffic control conflict detection scenario is described. Two types of prediction components are identified,(1) a relative judgment (RJ) task with regard to which aircraft will reach the projected point of intersection first, and (2) a prediction-motion (PM) task estimating the time-to-collide if the aircraft will reach the intersection simultaneously. Also identified are several alternative strategies that can be potentially used by controllers to perform the RJ and PM tasks. Following the task analysis, a literature review on factors influencing the RJ and PM performance reveals that although there are a number of studies on controller performance in conflict detection, almost no one has studied how the controller actually performs the RJ and PM tasks. Finally, a number of potential research questions are proposed with an aim to shed new light on the human attention/cognition mechanisms involved in …"
    },
    {
        "title": "Columbus, OH: The Ohio State University. 2001.",
        "id": "gTRDElAAAAAJ:NhqRSupF_l8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:NhqRSupF_l8C",
        "authors": [
            "Esa M Rantanen",
            "Donald A Talleur",
            "Henry L Taylor",
            "Gary L Bradshaw",
            "Tom W Emanuel Jr",
            "Lester Lendrum",
            "Charles L Hulin",
            "IL Savoy"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Flight Data Recorder (FDR) data has proven invaluable in accident and incident analysis to determine the aircraft states and crew actions in abnormal or emergency situations. With advanced technology the quality and quantity of such data have substantially improved, and these data have also become more accessible than before. Consequently, a number of participating airlines have begun to routinely analyze the flight data from regular flights within Flight Operational Quality Assurance (FOQA) programs to identify patterns of irregularities and potentially hazardous situations (Brandt, 1999). Objective FDR data could also be particularly valuable in training and pilot performance assessment for research purposes, where accurate quantitative data could not be obtained otherwise.Although the current FDRs provide a wealth of data that can be efficiently handled and stored, information extraction from these data is …"
    },
    {
        "title": "To be presented at the 12th International Symposium on Aviation Psychology, Dayton, OH, 2003.",
        "id": "gTRDElAAAAAJ:zA6iFVUQeVQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:zA6iFVUQeVQC",
        "authors": [
            "Donald A Talleur",
            "Christopher D Wickens"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "An incremental transfer of training research design was used to measure the effectiveness of a PCATD and to determine the point at which additional training in a PCATD was no longer effective. The dependent measures were trials to specific completion standards, time to complete a flight lesson and time to a successful evaluation flight. Percent transfer, transfer effectiveness ratios (TER) and incremental transfer effectiveness ratios (ITER) were computed for each instrument task and for the time to complete a flight lesson. The data indicate that the PCATD is effective in teaching basic and advanced instrument tasks to private pilots, which replicated the findings of an earlier study by Taylor and colleagues. As a result of prior training in a PCATD, trials, time to complete the flight lesson and time to a successful evaluation flight were less when compared to an airplane Control group. Overall, the greatest effect was …"
    },
    {
        "title": "To be presented at the 13th International Symposium on Aviation Psychology, Dayton, OH, 2005.",
        "id": "gTRDElAAAAAJ:SeFeTyx0c_EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:SeFeTyx0c_EC",
        "authors": [
            "Nicholas R Johnson",
            "Esa M Rantanen"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "This paper will present a review of development and evaluation of objective pilot performance measures. A basic taxonomy of measure types is also presented where objective measures are classified distinguishing between direct measures, derivative metrics based on these, and indirect measures of unobservable constructs and phenomena. The recent development of novel objective measures and their ability to predict and classify pilot performance will also be reported."
    },
    {
        "title": "Annual Meeting. Santa Monica: Human Factors and Ergonomics Society, 2004.",
        "id": "gTRDElAAAAAJ:70eg2SAEIzsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:70eg2SAEIzsC",
        "authors": [
            "Xidong Xu",
            "Christopher D Wickens",
            "Esa M Rantanen"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "We explored the effects of conflict geometry on pilot conflict understanding, manifested in estimation accuracy of three continuous variables: miss distance, time to closest point of approach, and orientation at the closest point of approach. Results indicated (a) increased difficulty of understanding with conflicts that occurred with slower speeds, a longer time into the future, and a longer distance into the future;(b) a tendency for pilots’ judgments often to be conservative, judging that conflicts were both more risky and would occur sooner than was actually the case; and (c) a “distance-over-speed” bias, such that two aircraft viewed farther apart and converging rapidly were perceived as less risky than two aircraft that were closer to each other and converging at a slower rate, even though the time until a conflict occurred was identical.INTRODUCTION Given the importance of conflict detection with the CDTI in free flight and its under-representation in research, the present study investigated the effects of conflict geometry on pilots’ conflict awareness using a CDTI. Dependent variables were estimate errors of the above-described continuous measures of conflict risk (TCPA, MD, and OCPA). The goals of this experiment were to identify the features that would make unaided conflict detection difficult or easy and to identify the biases that would affect estimation performance."
    },
    {
        "title": "To be presented at the 12th International Symposium on Aviation Psychology, Dayton, OH, 2003.",
        "id": "gTRDElAAAAAJ:lSLTfruPkqcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=gTRDElAAAAAJ:lSLTfruPkqcC",
        "authors": [
            "Esa M Rantanen",
            "Philip W Maynard",
            "Deniz Özhan"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Means of communication between pilots and controllers is one of the fundamental principles of air traffic control (ATC). Consequently, air-ground communications will both reflect the taskload imposed on the controller as well as drive the workload experienced by the controller. Therefore, analysis of ATC communications could potentially reveal a very rich and detailed picture of the demands placed on a controller in a given sector and traffic situation. This paper reports analysis of ATC voice data obtained from three different sectors at the Indianapolis air route traffic control center (ZID ARTCC). The main purpose of this analysis was to examine how different sector characteristics and the busy and slow periods within the sectors differed explicitly in terms of pilot-controller communications and implicitly in terms of controller taskload and workload. Measures derived from the voice data were also compared to metrics reflecting ATC sector complexity that were derived from the output of the objective activity and taskload assessment program, POWER, developed by the FAA."
    }
]