[
    {
        "title": "Are industrial ml image classifiers robust to withstand adversarial attacks on videos?",
        "id": "GX_Iau8AAAAJ:TIZ-Mc8IlK0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:TIZ-Mc8IlK0C",
        "authors": [
            "Sergei Chuprov",
            "Shivam Mahajan",
            "Raman Zatsarenko",
            "Leon Reznik",
            "Aleksandr Ruchkan"
        ],
        "pub_source": "2023 IEEE Western New York Image and Signal Processing Workshop (WNYISPW)",
        "pub_date": "2023/11/3",
        "description": "We investigate the impact of adversarial attacks against videos on the object detection and classification performance of industrial Machine Learning (ML) application. Specifically, we design the use case with the Intelligent Transportation System that processes real videos recorded by the vehicles’ dash cams and detects traffic lights and road signs in these videos. As the ML system, we employed Rekognition cloud service from Amazon, which is a commercial tool for on-demand object detection in the data of various modalities. To study Rekognition robustness to adversarial attacks, we manipulate the videos by adding the noise to them. We vary the intensity of the added noise by setting the ratio of randomly selected pixels affected by this noise. We then process the videos affected by the noise of various intensity and evaluate the performance demonstrated by Rekognition. As the evaluation metrics, we employ …",
        "citations": 1
    },
    {
        "title": "Are industrial ml image classifiers robust to data affected by network qos degradation?",
        "id": "GX_Iau8AAAAJ:tYavs44e6CUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:tYavs44e6CUC",
        "authors": [
            "Raman Zatsarenko",
            "Chirayu Anil Marathe",
            "Sergei Chuprov",
            "Matthew Hyland",
            "Leon Reznik"
        ],
        "pub_source": "2023 IEEE Western New York Image and Signal Processing Workshop (WNYISPW)",
        "pub_date": "2023/11/3",
        "description": "In industrial applications, Machine Learning (ML) services are often deployed on cloud infrastructure and require a transfer of the input data over a network, which is susceptible to Quality of Service (QoS) degradation. In this paper we investigate the robustness of industrial ML classifiers towards varying Data Quality (DQ) due to degradation in network QoS. We define the robustness of an ML model as the ability to maintain a certain level of performance under variable levels of DQ at its input. We employ the classification accuracy as the performance metric for the ML classifiers studied. The POWDER testbed is utilized to create an experimental setup consisting of a real-world wireless network connecting two nodes. We transfer multiple video and image files between the two nodes under varying degrees of packet loss and varying buffer sizes to create degraded data. We then evaluate the performance of AWS …",
        "citations": 1
    },
    {
        "title": "Federated learning with trust evaluation for industrial applications",
        "id": "GX_Iau8AAAAJ:g3aElNc5_aQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:g3aElNc5_aQC",
        "authors": [
            "Sergei Chuprov",
            "Moinuddin Memon",
            "Leon Reznik"
        ],
        "pub_source": "2023 IEEE Conference on Artificial Intelligence (CAI)",
        "pub_date": "2023/6/5",
        "description": "We propose and investigate a novel Reputation and Trust-based technique incorporation for Federated Learning (FL) industrial applications to address possible anomalous local data caused by malicious attacks or other factors that can deteriorate the produced Machine Learning (ML) model performance. We evaluate our technique against the centralized Deep Neural Network- and Random Forest-based topologies and also against conventional FL structures on the available financial industry datasets. Our study results demonstrate that our techniques allows detecting anomalous local data models and also improving the produced model effectiveness, especially in the cases of practical importance.",
        "citations": 1
    },
    {
        "title": "Federated Learning for Robust Computer Vision in Intelligent Transportation Systems",
        "id": "GX_Iau8AAAAJ:hMsQuOkrut0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:hMsQuOkrut0C",
        "authors": [
            "Sergei Chuprov",
            "Kartavya Manojbhai Bhatt",
            "Leon Reznik"
        ],
        "pub_source": "2023 IEEE Conference on Artificial Intelligence (CAI)",
        "pub_date": "2023/6/5",
        "description": "We study Federated Learning (FL) as the promising technology to design the computer vision Machine Learning-based applications, which are robust to possible Data Quality (DQ) degradation in real Intelligent Transportation Systems (ITSs). As ITSs are composed of diverse data generation and communication units, DQ of images they produce and use may vary dramatically. We study the images of various quality distributed over the local clients and perform iterative FL training with two distinct aggregation strategies: Federated Averaging (FedAvg) and Geometric Median (GM). We consequently evaluate the models cross-trained over a single DQ cohort against other DQ categories. Then we analyze the image (traffic signs) recognition performance and its robustness toward the DQ degradation for each training cohort and aggregation strategy. Based on the results, we provide our recommendations on how to train …"
    },
    {
        "title": "Study on network importance for ml end application robustness",
        "id": "GX_Iau8AAAAJ:KUbvn5osdkgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:KUbvn5osdkgC",
        "authors": [
            "Sergei Chuprov",
            "Leon Reznik",
            "Garegin Grigoryan"
        ],
        "pub_source": "ICC 2023-IEEE International Conference on Communications",
        "pub_date": "2023/5/28",
        "description": "In this paper, we investigate the robustness of the ML end application performance to network Quality of Service (QoS) degradation, and the ways to improve it. We introduce a novel system approach to define the Machine Learning (ML) with Integrated Networks (MLINs) and describe how ML end performance can be employed to adjust network hyperparameters in order to prevent system Data Quality decrease. We investigate the interrelations between the network QoS degradation during the data transmission and ML image classification performance. We demonstrate how the studied interrelationships can be employed to produce recommendations on network adjustment in order to improve MLIN robustness. In particular, we propose an example of MLIN feedback system design that employs ML end performance as the major indicator to produce recommendations on network hyperparameters adjustment aimed …",
        "citations": 1
    },
    {
        "title": "Robust Autonomous Vehicle Computer-Vision-Based Localization in Challenging Environmental Conditions",
        "id": "GX_Iau8AAAAJ:ILKRHgRFtOwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ILKRHgRFtOwC",
        "authors": [
            "Sergei Chuprov",
            "Pavel Belyaev",
            "Ruslan Gataullin",
            "Leon Reznik",
            "Evgenii Neverov",
            "Ilia Viksnin"
        ],
        "pub_source": "Applied Sciences",
        "pub_date": "2023/5/6",
        "description": "In this paper, we present a novel autonomous vehicle (AV) localization design and its implementation, which we recommend to employ in challenging navigation conditions with a poor quality of the satellite navigation system signals and computer vision images. In the case when the GPS signal becomes unstable, other auxiliary navigation systems, such as computer-vision-based positioning, are employed for more accurate localization and mapping. However, the quality of data obtained from AV’s sensors might be deteriorated by the extreme environmental conditions too, which infinitely leads to the decrease in navigation performance. To verify our computer-vision-based localization system design, we considered the Arctic region use case, which poses additional challenges for the AV’s navigation and might employ artificial visual landmarks for improving the localization quality, which we used for the computer vision training. We further enhanced our data by applying affine transformations to increase its diversity. We selected YOLOv4 image detection architecture for our system design, as it demonstrated the highest performance in our experiments. For the computational platform, we employed a Nvidia Jetson AGX Xavier device, as it is well known and widely used in robotic and AV computer vision, as well as deep learning applications. Our empirical study showed that the proposed computer vision system that was further trained on the dataset enhanced by affine transformations became robust regarding image quality degradation caused by extreme environmental conditions. It was effectively able to detect and recognize images of artificial …",
        "citations": 6
    },
    {
        "title": "Are ml image classifiers robust to medical image quality degradation?",
        "id": "GX_Iau8AAAAJ:EYYDruWGBe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:EYYDruWGBe4C",
        "authors": [
            "Sergei Chuprov",
            "Akshaya Nandkishor Satam",
            "Leon Reznik"
        ],
        "pub_source": "2022 IEEE Western New York Image and Signal Processing Workshop (WNYISPW)",
        "pub_date": "2022/11/4",
        "description": "Classification of medical images plays an important role in medical assisting applications, as it helps in performing routine patients diagnostics. In many cases, the images are transferred over a network to the cloud-based service that might result in their corruption. In this paper, we investigate how the ML medical image classification performance can be affected by the network Quality of Service (QoS) and Data Quality (DQ) degradation. In our study, we employ real-world X-ray image scans of lungs diseases and real life networks. As ML medical image classification systems, we employ well-known industrial VVG16, ResNet50, and InceptionV3 models, analyze and compare their performance. We leverage the POWDER platform to establish real wireless network between the two nodes. We transfer our X-ray scans between these nodes with various packet losses to obtain images corrupted due to network QoS …",
        "citations": 5
    },
    {
        "title": "Integrating Security with Accuracy Evaluation in Sensors Fusion",
        "id": "GX_Iau8AAAAJ:vbGhcppDl1QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:vbGhcppDl1QC",
        "authors": [
            "Igor Khokhlov",
            "Sergei Chuprov",
            "Leon Reznik"
        ],
        "pub_source": "2022 IEEE Sensors",
        "pub_date": "2022/10/30",
        "description": "This paper presents a novel approach of integrating sensor accuracy and sensor platform security in overall sensor system evaluation and presents a new developed method and a software tool that are designed to assist the sensor community in assessing the security aspect of complex sensor platforms such as smartphones. We recommend conducting sensor platform security evaluation along with the accuracy estimation and employing them together while designing sensor fusion. We developed a mobile platform's security evaluation tool, which we describe in this paper, and encourage its application in this process. Also, we describe a use case that shows how sensors fusion may affect not only sensor accuracy but also data security in practice. By introducing security into sensor system design at the earlier stage, we try to bridge sensor accuracy and security evaluation.",
        "citations": 1
    },
    {
        "title": "Multi-Modal Sensor Selection with Genetic Algorithms",
        "id": "GX_Iau8AAAAJ:p__nRnzSRKYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:p__nRnzSRKYC",
        "authors": [
            "Sergei Chuprov",
            "Leon Reznik",
            "Igor Khokhlov",
            "Karan Manghi"
        ],
        "pub_source": "2022 IEEE Sensors",
        "pub_date": "2022/10/30",
        "description": "We develop Genetic Algorithms based method and the tool to select sensors, which provide the specified quality of data after fusion. In this paper, we concentrate on introducing multi-modal sensor fusion in the selection operation. To evaluate data quality, we consider the combination of diverse sensor's accuracy and security metrics. We modify data quality evaluation calculus that incorporates these major metrics to include the possibility of multi-modal sensor fusion. To evaluate Genetic Algorithm feasibility in sensor selection, we compare it against the conventional brute force search approach. To implement our approach and facilitate its use in practice, we produce and release an Android application that automatically selects multi-modal sensors based on the specified sensor types and required data quality.",
        "citations": 2
    },
    {
        "title": "Influence of transfer learning on machine learning systems robustness to data quality degradation",
        "id": "GX_Iau8AAAAJ:BwyfMAYsbu0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:BwyfMAYsbu0C",
        "authors": [
            "Sergei Chuprov",
            "Igor Khokhlov",
            "Leon Reznik",
            "Srujan Shetty"
        ],
        "pub_source": "2022 International Joint Conference on Neural Networks (IJCNN)",
        "pub_date": "2022/7/18",
        "description": "The evolution of the Machine Learning (ML) has led to the emergence of Transfer Learning (TL) approach, which allows reusing pretrained industrial ML systems after their input data values or even an application domain has changed. In this paper, we investigate the TL process and its impact on the performance of ML-end systems with integrated network facilities. Especially, we focus on ML-systems designed for the classification of image media-files, transmitted over a network. Packet loss in a network is considered as a major input Data Quality (DQ) deterioration factor that can result in ML system classification performance degradation after pretraining on good inputs. To investigate the typical industrial TL process, we study the relationships between the ML model's last layer weights, hyperparameters, and classification performance throughout the retraining process. In addition, we conduct an empirical study to …",
        "citations": 4
    },
    {
        "title": "How degrading network conditions influence machine learning end systems performance?",
        "id": "GX_Iau8AAAAJ:epqYDVWIO7EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:epqYDVWIO7EC",
        "authors": [
            "Sergei Chuprov",
            "Leon Reznik",
            "Antoun Obied",
            "Srujan Shetty"
        ],
        "pub_source": "IEEE INFOCOM 2022-IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)",
        "pub_date": "2022/5/2",
        "description": "As intelligent knowledge-based decision makers, Machine Learning (ML) end applications highly depend on input data quality. Systems that integrate ML-end applications use computer networks for data delivery from the data source to ML processors. Packet losses and lack of resources are the factors that may result in a quality degradation of data transmitted over computer networks, and consequently negatively impact the accuracy of ML applications. In this paper, we investigate the relation between network quality of service (QoS) degradation and ML-end decision making performance based on the data transmitted over various network conditions. For realistic testing, we implement an empirical study, in which we leverage the POWDER platform that provides real-world wireless 5G network testbed. In our experiments, we transfer media-files between the nodes of this real network under various QoS conditions …",
        "citations": 9
    },
    {
        "title": "Adversarial Machine Learning",
        "id": "GX_Iau8AAAAJ:URolC5Kub84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:URolC5Kub84C",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Wiley-IEEE Press",
        "pub_date": "2022",
        "description": "The chapter introduces novel adversarial machine learning attacks and the taxonomy of its cases, where machine learning is used against AI‐based classifiers to make them fail. It investigates a possible data corruption and quality decrease influence on the classifier performance. The module proposes data restoration procedures and other measures to protect against adversarial attacks. Generative adversarial networks are introduced, and their use is discussed. Multiple algorithm examples and use cases are included.",
        "citations": 1
    },
    {
        "title": "Hackers versus Normal Users",
        "id": "GX_Iau8AAAAJ:uWiczbcajpAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:uWiczbcajpAC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Wiley-IEEE Press",
        "pub_date": "2022",
        "description": "The chapter starts with discussing how hacker's demography and their culture have been changing over the years. Then it proceeds with presenting hacking attacks, techniques, and tools as well as anti‐hacking protection mechanisms. In the second part, it moves to the ordinary user's profiles and authentication. Here we show how to employ data science and statistical approaches to find out and analyze user's characteristics and their influence on the security level of their computer practice. The chapter presents the computer device security evaluation procedures. It discusses how to conduct analysis, observations, results, and recommendations for users to improve their overall security practices and the security of their devices. Also, it examines the hacking web fingerprinting attacks against the privacy protection TOR technology that utilizes machine learning as well as possible protection mechanisms. Examples …",
        "citations": 1
    },
    {
        "title": "Firewall Design and Implementation",
        "id": "GX_Iau8AAAAJ:vDijr-p_gm4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:vDijr-p_gm4C",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Wiley-IEEE Press",
        "pub_date": "2022",
        "description": "The chapter introduces firewalls and their design as the first line of defense mechanism. This chapter's goal is twofold: (i) to cover major aspects of the firewall design and operation for security professional education and (ii) explain how artificial intelligence and machine learning techniques and technologies are employed for enhancing firewalls and the security they provide. For the first goal, it provides the firewall definition, discusses the functions, possible architectures, and operational models concentrating on the presentation of their advantages and drawbacks. It includes the step‐by‐step guide to the firewall design and implementation process ranging from planning to deployment and maintenance. For the second goal, the chapter moves the reader from basic rules design to sophisticated AI and ML employment algorithms that improve it. The major emphasis is placed on using rules to set up, configure, and …"
    },
    {
        "title": "Malware and Vulnerabilities Detection and Protection",
        "id": "GX_Iau8AAAAJ:EkHepimYqZsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:EkHepimYqZsC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Wiley-IEEE Press",
        "pub_date": "2022",
        "description": "The chapter discusses malware types, its detection and recognition techniques and tools. It provides and extensive classification of various malware and virus families, discusses their taxonomy, basic composition and comparison between them. Beyond pure malware examples, it reviews spam and software vulnerabilities too. Multiple real life cases and examples are provided. Then it moves to presenting malware detection principles, algorithms and techniques, as well as anti‐malware tools and technologies. Their examples and use cases are included.",
        "citations": 2
    },
    {
        "title": "Computer Security with Artificial Intelligence, Machine Learning, and Data Science Combination",
        "id": "GX_Iau8AAAAJ:0KyAp5RtaNEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:0KyAp5RtaNEC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Wiley-IEEE Press",
        "pub_date": "2022",
        "description": "The chapter discusses the basic concepts of computer security as well as the taxonomy and classification of the fundamental algorithms in the domains of artificial intelligence, machine learning, and data science in relation to their applications in computer security. It reviews the sources of security threats and the attacks, using the area of IoT and wireless devices as an example, as well as examines the possible protection mechanisms and tools. The module provides a general classification of intelligent approaches and their relationship to various computer security fields. It focuses on an introduction of the major intelligent techniques and technologies in computer security, such as expert systems, fuzzy logic, machine learning, artificial neural networks, and genetic algorithms. While presenting multiple techniques, the text emphasizes their advantage in comparison to each other as well as the obstacles in their …",
        "citations": 6
    },
    {
        "title": "Intrusion Detection Systems",
        "id": "GX_Iau8AAAAJ:yB1At4FlUx8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:yB1At4FlUx8C",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Wiley-IEEE Press",
        "pub_date": "2022",
        "description": "The chapter develops knowledge and practical skills on intrusion detection systems (IDS) design, analysis, implementation, and use. It presents IDS definition and discusses their goals and functions as well as their progress from the historical perspective. It advances reader's design and analysis skills in computer security domain by discussing artificial intelligence and machine learning techniques and their application in IDS design and implementation as well as in classifying IDS, evaluating an IDS performance, choosing the IDS design tools, and employing them in practical design exercise. Algorithm and code examples are provided.",
        "citations": 1
    },
    {
        "title": "Intelligent Security Systems: How Artificial Intelligence, Machine Learning and Data Science Work for and Against Computer Security",
        "id": "GX_Iau8AAAAJ:nrtMV_XWKgEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:nrtMV_XWKgEC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "John Wiley & Sons",
        "pub_date": "2021/9/23",
        "description": "INTELLIGENT SECURITY SYSTEMS Dramatically improve your cybersecurity using AI and machine learning In Intelligent Security Systems, distinguished professor and computer scientist Dr. Leon Reznik delivers an expert synthesis of artificial intelligence, machine learning and data science techniques, applied to computer security to assist readers in hardening their computer systems against threats. Emphasizing practical and actionable strategies that can be immediately implemented by industry professionals and computer device’s owners, the author explains how to install and harden firewalls, intrusion detection systems, attack recognition tools, and malware protection systems. He also explains how to recognize and counter common hacking activities. This book bridges the gap between cybersecurity education and new data science programs, discussing how cutting-edge artificial intelligence and machine learning techniques can work for and against cybersecurity efforts. Intelligent Security Systems includes supplementary resources on an author-hosted website, such as classroom presentation slides, sample review, test and exam questions, and practice exercises to make the material contained practical and useful. The book also offers: A thorough introduction to computer security, artificial intelligence, and machine learning, including basic definitions and concepts like threats, vulnerabilities, risks, attacks, protection, and tools An exploration of firewall design and implementation, including firewall types and models, typical designs and configurations, and their limitations and problems Discussions of intrusion detection systems (IDS …",
        "citations": 6
    },
    {
        "title": "Improving knowledge based detection of soft attacks against autonomous vehicles with reputation, trust and data quality service models",
        "id": "GX_Iau8AAAAJ:uc_IGeMz5qoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:uc_IGeMz5qoC",
        "authors": [
            "Sergei Chuprov",
            "Ilia Viksnin",
            "Iuliia Kim",
            "Timofey Melnikov",
            "Leon Reznik",
            "Igor Khokhlov"
        ],
        "pub_source": "2021 IEEE International Conference on Smart Data Services (SMDS)",
        "pub_date": "2021/9/5",
        "description": "Autonomous vehicles group’s security and safety improvement and assurance is a challenging research problem. In this paper, we describe our smart data-oriented security service, which is aimed at detecting malfunctioning or malicious agents based on the fusion of multi-agents Reputation, Trust and Data Quality (DQ) models for traffic control. To address the classical Reputation zero value challenge, we introduce the DQ evaluation service, which allows to use the vehicle’s objective characteristics to assign the initial Reputation value to a new agent when it is joining the group. To validate our approach, we conducted an empirical study on real intersection traffic with multiple vehicles. Multiple experiments were performed on our custom physical intersection management test ground and even bigger vehicles groups were studied by simulation. The experimental results verify our approach capability to effectively …",
        "citations": 5
    },
    {
        "title": "Recurrent neural networks for colluded applications attack detection in android os devices",
        "id": "GX_Iau8AAAAJ:z_wVstp3MssC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:z_wVstp3MssC",
        "authors": [
            "Igor Khokhlov",
            "Ninad Ligade",
            "Leon Reznik"
        ],
        "pub_source": "2020 International Joint Conference on Neural Networks (IJCNN)",
        "pub_date": "2020/7/19",
        "description": "The paper presents a design and an implementation of an intelligent detector of a novel \"colluded applications\" attack on user's privacy in Android OS devices, which employs recurrent neural network (RNN) models. The paper reports the results of an empirical study that involved the attack research, data collection and pre-processing, the choice of the RNN model for a detector design, multiple detector implementations, their performance evaluation and analysis, and finally, an Android app realization and execution on a real device. We investigate and analyze multiple attack scenarios and the attack influence on such technological signals as memory consumption and a CPU's cores clock speed. For the attack detection, a few detectors exploring multiple RNN models are designed, implemented, and examined. The detectors employ various RNN models, such as a simple recurrent neural network, a long short-term …",
        "citations": 2
    },
    {
        "title": "What is the value of data value in practical security applications",
        "id": "GX_Iau8AAAAJ:VLnqNzywnoUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:VLnqNzywnoUC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik"
        ],
        "pub_source": "2020 IEEE Systems Security Symposium (SSS)",
        "pub_date": "2020/7/1",
        "description": "Data value (DV) is a novel concept that is introduced as one of the Big Data phenomenon features. While continuing an investigation of the DV ontology and its relationship with the data quality (DQ) on the conceptual level, this paper researches possible applications and use of the DV in the practical design of security and privacy protection systems and tools. We present a novel approach to DV evaluation that maps DQ metrics into DV value. Developed methods allow DV and DQ use in a wide range of application domains. To demonstrate DQ and DV concept employment in real tasks we present two real-life scenarios. The first use case demonstrates the DV use in crowdsensing application design. It shows up how DV can be calculated by integrating various metrics characterizing data application functionality, accuracy, and security. The second one incorporates the privacy consideration into DV calculus by …",
        "citations": 2
    },
    {
        "title": "Reputation and trust models with data quality metrics for improving autonomous vehicles traffic security and safety",
        "id": "GX_Iau8AAAAJ:uJ-U7cs_P_0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:uJ-U7cs_P_0C",
        "authors": [
            "Sergey Chuprov",
            "Ilya Viksnin",
            "Iuliia Kim",
            "Leon Reznikand",
            "Igor Khokhlov"
        ],
        "pub_source": "2020 IEEE systems security symposium (SSS)",
        "pub_date": "2020/7/1",
        "description": "In this paper, we develop, implement, test, and analyze a novel technique that allows to improve the security and safety of intersections crossing by the group of autonomous vehicles. The proposed approach is based on augmenting the trust and reputation models with data quality evaluation and using it for initial trust value assignment. This technique allows increasing accuracy and recall rates in detecting agents that might supply incorrect data and facilitating their removal from the agent group consideration. To evaluate the proposed method, we performed the simulation study of the autonomous vehicle traffic control through an intersection. The conducted experiments showed that the employment of data quality metrics improves detecting autonomous vehicles and other agents that might transmit incorrect data.",
        "citations": 18
    },
    {
        "title": "Knowledge graph in data quality evaluation for IoT applications",
        "id": "GX_Iau8AAAAJ:XD-gHx7UXLsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:XD-gHx7UXLsC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik"
        ],
        "pub_source": "2020 IEEE 6th World Forum on Internet of Things (WF-IoT)",
        "pub_date": "2020/6/2",
        "description": "The IoT advancement raises concerns about the varying quality of data produced by IoT devices. Data quality (DQ) is an important concept that is used in the design and employment of information, data management, decision making, and engineering systems with multiple applications already available for solving specific problems. However, current approaches to DQ integration into the data management pipeline are limited to particular applications that harden their adoption in the IoT domain. This paper presents a generic framework that enables DQ evaluation incorporation in a broad spectrum of IoT applications. The framework is based on a knowledge graph that facilitates its adoption in new applications. The developed framework supports selecting the DQ metrics and implementing their integration calculus. The use case that validates the framework in solving real-life tasks is presented.",
        "citations": 7
    },
    {
        "title": "Image processing in autonomous vehicle model positioning and movement control",
        "id": "GX_Iau8AAAAJ:t7zJ5fGR-2UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:t7zJ5fGR-2UC",
        "authors": [
            "Sergey Chuprov",
            "Egor Marinenkov",
            "Ilya Viksnin",
            "Leon Reznik",
            "Igor Khokhlov"
        ],
        "pub_source": "2020 IEEE 6th World Forum on Internet of Things (WF-IoT)",
        "pub_date": "2020/6/2",
        "description": "This paper presents a novel technique for processing an on-board camera's images with the goal to determine the location and trajectory of an unmanned autonomous vehicle (AV) in order to control traffic through an intersection. The empirical study with multiple AV's physical models was conducted. The physical testing ground parameters and components parts used to build up the AV's model and to develop methods for image processing and decision-making are described. The technique has been successfully employed and tested under laboratory conditions.",
        "citations": 2
    },
    {
        "title": "Learning to recommend third-party library migration opportunities at the API level",
        "id": "GX_Iau8AAAAJ:7T2F9Uy0os0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:7T2F9Uy0os0C",
        "authors": [
            "Hussein Alrubaye",
            "Mohamed Wiem Mkaouer",
            "Igor Khokhlov",
            "Leon Reznik",
            "Ali Ouni",
            "Jason Mcgoff"
        ],
        "pub_source": "Applied Soft Computing",
        "pub_date": "2020/5/1",
        "description": "The manual migration between different third-party libraries represents a challenge for software developers. Developers typically need to explore both libraries Application Programming Interfaces, along with reading their documentation, in order to locate the suitable mappings between replacing and replaced methods. In this paper, we introduce RAPIM, a machine learning model that recommends mappings between methods from two different libraries. Our model learns from previous migrations, manually performed in mined software systems, and extracts a set of features related to the similarity between method signatures and method textual documentations. We evaluate our model using 8 popular migrations, collected from 57,447 open-source Java projects. Results show that RAPIM is able to recommend relevant library API mappings with an average accuracy score of 87%. Finally, we provide the community …",
        "citations": 49
    },
    {
        "title": "Framework for integral data quality and security evaluation in smartphones",
        "id": "GX_Iau8AAAAJ:evX43VCCuoAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:evX43VCCuoAC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik",
            "Sergey Chuprov"
        ],
        "pub_source": "IEEE Systems Journal",
        "pub_date": "2020/4/28",
        "description": "Data quality (DQ) concept should play an important role in decision-making and engineering systems. Underestimation of DQ may lead to resource waste, wrong conclusions, or inefficient decisions. Unfortunately, current approaches to DQ incorporating into data management systems are limited to particular applications. This problem is aggravated by the DQ inequality of data sources. This is especially critical in mobile crowd-sensing applications where data may come from unverified data contributors using the smartphones and other mobile devices. To facilitate the expansion of DQ evaluation to a wider spectrum of applications, this article presents a framework for integral DQ and security evaluation in Android-based smartphones. The developed framework provides support for selecting the DQ metrics and implementing their calculus by integrating diverse sensor DQ and security metrics. We present multiple …",
        "citations": 5
    },
    {
        "title": "Adaptive data fusion in inertial sensors and data quality analysis of sensor networks",
        "id": "GX_Iau8AAAAJ:-_dYPAW6P2MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:-_dYPAW6P2MC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik",
            "Sergey Edward Lyshevski"
        ],
        "pub_source": "2020 IEEE 40th International Conference on Electronics and Nanotechnology (ELNANO)",
        "pub_date": "2020/4/22",
        "description": "This paper investigates microelectromechanical systems (MEMS) technology sensors. The device- and system-level analyses are performed. An investigation is focused on multi-degree-of-freedom (MDOF) microsystem-technology inertial sensors which are widely used in mobile devices, surveillance and reconnaissance platforms, wearable electronics, guidance and navigation systems, etc. Open problems of data quality (DQ) in sensor networks, evaluation of sensor data, data fusion, DQ improvement, and data homogeneity in MDOF sensors are addressed. The DQ metrics design and their use are reported. Our research and algorithmic developments are focused on data assertion, adaptive signal processing, asynchronous data fusion and data management from heterogeneous multiple sensors and sensor networks. Using a serial protocol I 2 C interface, considered MDOF sensors can fuse the directly …",
        "citations": 2
    },
    {
        "title": "Sensors in mobile devices knowledge base",
        "id": "GX_Iau8AAAAJ:2KloaMYe4IUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:2KloaMYe4IUC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik",
            "Sahil Ajmera"
        ],
        "pub_source": "IEEE Sensors Letters",
        "pub_date": "2020/2/20",
        "description": "Multiple sensors are incorporated in modern mobile devices. The ubiquity of these mobile devices with a wide range of embedded sensors enables developing new types of sensor networks and novel applications. However, more often than not, users are unaware of the sensor quality in their devices. With the goal of facilitating closer collaboration between sensor developers and users' communities, we developed a knowledge base that contains various characteristics of sensors embedded into mobile devices and their quality analysis. In our novel analysis, we fused both sensor and mobile device characteristics to produce integral sensor quality indicators. Machine learning and clustering techniques were employed. To validate our approach, we collected comprehensive information about sensors currently embedded in more than 9000 mobile devices and analyzed them. We made this knowledge base and …",
        "citations": 9
    },
    {
        "title": "From Data Communication to Delivery of Quality Data (Presentation)",
        "id": "GX_Iau8AAAAJ:fEOibwPWpKIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:fEOibwPWpKIC",
        "authors": [
            "Leon Reznik",
            "Igor Khokhlov"
        ],
        "pub_source": "",
        "pub_date": "2020",
        "description": "TigerPrints - Large Scale Networking (LSN) Workshop on Huge Data: A Computing, Networking \nand Distributed Systems Perspective: From Data Communication to Delivery of Quality Data \n(Presentation) Home Search Browse All Collections My Account About DC Network Digital \nCommons Network™ Skip to main content TigerPrints Clemson University Home My Account \nFAQ Contact Us About < Previous Event Next Event > Home Conferences HUGEDATA \nDATA_MOVEMENT 13 Data Movement Event Title From Data Communication to Delivery of \nQuality Data (Presentation) Presenter Information Leon Reznik, Rochester Institute of \nTechnology Igor Khokhlov, Rochester Institute of Technology Start Date 14-4-2020 10:00 AM \nEnd Date 14-4-2020 11:20 AM Download Share COinS Apr 14th, 10:00 AM Apr 14th, 11:20 AM \nFrom Data Communication to Delivery of Quality Data (Presentation) Search Enter search terms: …"
    },
    {
        "title": "From Data Communication to Delivery of Quality Data (White Paper)",
        "id": "GX_Iau8AAAAJ:35r97b3x0nAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:35r97b3x0nAC",
        "authors": [
            "Leon Reznik",
            "Igor Khokhlov"
        ],
        "pub_source": "",
        "pub_date": "2020",
        "description": "The advances in the information and communication technologies over the last decade laid a strong foundation for data generation and storage on a staggering scale. Also, this development moved the point of possible data use far away from data source locations, thus enhancing the importance of cybersecurity and safety factors consideration in system design. Progress in nanoscale devices, Internet of Things, Citizen Science made possible to collect huge volumes of the data of wide varieties generated with high velocity. This data may have rather poor quality characteristics, such as low signal-to-noise ratio, high probability of errors, high distortion, dynamic device non-uniformity. If the current trend continues, we may expect an unprecedented scale of generating, storing, and communicating more and more data of low quality overfilling the available capacities. The current data management structures would not …"
    },
    {
        "title": "The machine learning models for activity recognition applications with wearable sensors",
        "id": "GX_Iau8AAAAJ:tzM49s52ZIMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:tzM49s52ZIMC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik",
            "Rohit Bhaskar"
        ],
        "pub_source": "2019 18th IEEE International Conference On Machine Learning And Applications (ICMLA)",
        "pub_date": "2019/12/16",
        "description": "The growing number of fitness trackers and dedicated smartphone applications indicate the importance of human activity recognition tasks in everyday life. Wearable devices tend to incorporate a broad spectrum of various sensors, such as an accelerometer, a gyroscope, a heart rate sensor, etc. It is essential to understand what type of data and algorithm contribute to a better overall activity recognition rate, especially for real-time activity recognition based on real-time data streams. In this paper, we focus on comparing and contrasting different machine learning techniques and gauge their performance in terms of human activity recognition accuracy. We investigate and analyze sensor mounting position, sensor types, and data type influence on activity recognition accuracy. Also, we render and analyze the benefits of using a RNN classifier over a more static classifier such as J48 and Naive Bayes algorithms in our …",
        "citations": 4
    },
    {
        "title": "Machine learning in anomaly detection: Example of colluded applications attack in android devices",
        "id": "GX_Iau8AAAAJ:_Re3VWB3Y0AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:_Re3VWB3Y0AC",
        "authors": [
            "Igor Khokhlov",
            "Michael Perez",
            "Leon Reznik"
        ],
        "pub_source": "2019 18th IEEE International Conference On Machine Learning And Applications (ICMLA)",
        "pub_date": "2019/12/16",
        "description": "The paper investigates the feasibility of using machine learning (ML) applications for an anomaly-based unknown attack detection by monitoring system parameters on resource-constrained Android mobile devices. It introduces colluded applications example as a use case of unknown sophisticated attacks, examines its formalization models and possible scenarios as well as develops the machine learning classifiers for its detection. We investigate multiple attack cases and record them to produce datasets characterizing a memory consumption and a CPU cores clock speed changes during the attacks that could be employed to design classifiers based on ML techniques. For the attack detection, a few ML classifiers are presented and examined. The classifiers employ various ML techniques and models, such as feed-forward neural network and long short-term memory. Model performance in detecting multiple …",
        "citations": 4
    },
    {
        "title": "Sensor selection optimization with genetic algorithms",
        "id": "GX_Iau8AAAAJ:ZfRJV9d4-WMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ZfRJV9d4-WMC",
        "authors": [
            "Igor Khokhlov",
            "Akshay Pudage",
            "Leon Reznik"
        ],
        "pub_source": "2019 IEEE SENSORS",
        "pub_date": "2019/10/27",
        "description": "Sensor networks and systems may incorporate sensors and sensor platforms of various quality and security. Current methods of sensor selection fail to produce effective and efficient decisions and to scale up to real-life cases. This paper develops and describes an intelligent optimization technique based on the genetic algorithms, whose execution time could be adjusted to meet real case requirements. The developed technique allows selection optimization based on the aggregation of multiple sensors and sensor platform indicators from quality and security domains. This technique has been implemented, and the empirical study of its execution on Android smartphones has been conducted. The results have been analyzed and prove the technique's efficiency in real-life cases.",
        "citations": 7
    },
    {
        "title": "System signals monitoring and processing for colluded application attacks detection in android os",
        "id": "GX_Iau8AAAAJ:tKAzc9rXhukC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:tKAzc9rXhukC",
        "authors": [
            "Igor Khokhlov",
            "Michael Perez",
            "Leon Reznik"
        ],
        "pub_source": "2019 IEEE Western New York Image and Signal Processing Workshop (WNYISPW)",
        "pub_date": "2019/10/4",
        "description": "This paper investigates a novel colluded application attack's influence on the system's technological signals of an Android OS smartphone. This attack requires two or more applications to collaborate in order to bypass permission restriction mechanisms and leak private data. We implement this attack on a real stock Android OS smartphone and record such technological signals as overall memory consumption, CPU utilization, and CPU frequency. These recordings are studied in order to investigate the feasibility of their employment in building the attack classifiers. In developing those classifiers, we employed various machine learning techniques processing these technological signals. Such machine learning techniques as a feed-forward and long-short term memory neural networks were investigated and compared against each other. The results achieved are presented and analyzed.",
        "citations": 2
    },
    {
        "title": "Computational intelligence framework for automatic quiz question generation",
        "id": "GX_Iau8AAAAJ:hkOj_22Ku90C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:hkOj_22Ku90C",
        "authors": [
            "Akhil Killawala",
            "Igor Khokhlov",
            "Leon Reznik"
        ],
        "pub_source": "2018 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE)",
        "pub_date": "2018/7/8",
        "description": "Computational intelligence techniques are attracting more and more attention in NLP and text analysis applications. This paper is devoted to their use in automatic question generation based on text analysis with the goal to develop the computational intelligence framework that should automate or semi-automate the process of quiz and exam question generation. The framework operation is based on information retrieval and NLP algorithms. It incorporates the application of production rules, LSTM neural network models, and other intelligent techniques. It allows generating multiple choice questions, true and false questions as well as \"Wh\"-type (What? When? How?) questions. Automation procedures for each type question generation are developed, presented and analyzed. The typical challenges in framework development and application are considered and possible solutions are discussed. The results of the …",
        "citations": 26
    },
    {
        "title": "Meetci: A computational intelligence software design automation framework",
        "id": "GX_Iau8AAAAJ:PR6Y55bgFSsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:PR6Y55bgFSsC",
        "authors": [
            "Igor Khokhlov",
            "Chinmay Jain",
            "Ben Miller-Jacobson",
            "Andrew Heyman",
            "Leonid Reznik",
            "Robert St Jacques"
        ],
        "pub_source": "2018 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE)",
        "pub_date": "2018/7/8",
        "description": "Computational Intelligence (CI) algorithms/techniques are packaged in a variety of disparate frameworks/applications that all vary with respect to specific supported functionality and implementation decisions that drastically change performance. Developers looking to employ different CI techniques are faced with a series of trade-offs in selecting the appropriate library/framework. These include resource consumption, features, portability, interface complexity, ease of parallelization, etc. Considerations such as language compatibility and familiarity with a particular library make the choice of libraries even more difficult. The paper introduces MeetCI, an open source software framework for computational intelligence software design automation that facilitates the application design decisions and their software implementation process. MeetCI abstracts away specific framework details of CI techniques designed within a …",
        "citations": 1
    },
    {
        "title": "Trusted CI Webinar: Data Quality & Security Evaluation Framework Development with Leon Reznik & Igor Khokhlov",
        "id": "GX_Iau8AAAAJ:eMMeJKvmdy0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:eMMeJKvmdy0C",
        "authors": [
            "Leon Reznik",
            "Igor Khokhlov"
        ],
        "pub_source": "",
        "pub_date": "2018/3/26",
        "description": "In this talk, we are presenting our work on building a data quality and security (DQS) framework, which integrates cybersecurity with other diverse metrics, such as accuracy, reliability, timeliness, and safety into a single methodological and technological framework. This innovation has a high potential to enable a significant improvement in a wide spectrum of science and technology applications as it will create new opportunities for optimizing data structures, data processing and fusion procedures based on a new quality and security information application. While the developed evaluation techniques may cover a wide range of data sources, the current framework’s implementation concentrates on using an ordinary user’s owned mobile devices and Android-based smartphones in particular. After discussing a motivation and general concepts of data quality evaluation, we will present preliminary results. As the framework integrates various metrics from accuracy to security and privacy, we will show examples of cyberinfrastructure elements from those areas developed so far. The security evaluation aspect of the framework is introduced with the Android applications that evaluate a smartphone security, gives a comprehensive score, and advises how the smartphone security can be improved. Two applications that are already available on Google Play will be presented and discussed. In addition, we will show some examples of the framework’s user interface designed for data quality metrics assignment and demonstrate its visualization capabilities. The data privacy evaluation is presented with the investigation of the colluded application vulnerability …"
    },
    {
        "title": "Design of activity recognition systems with wearable sensors",
        "id": "GX_Iau8AAAAJ:t6usbXjVLHcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:t6usbXjVLHcC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik",
            "Justin Cappos",
            "Rohit Bhaskar"
        ],
        "pub_source": "2018 ieee sensors applications symposium (sas)",
        "pub_date": "2018/3/12",
        "description": "Wearable sensors are widely utilized in human activity monitoring and recognition systems. Not only do these sensors come in different form factors but the software that comes bundled with them also varies from device to device and is constantly evolving. Also, multiple types of sensors on these devices are used to recognize human activity. Owing to the flexible form factor, these devices can also be mounted on a plethora of different positions on the human body. With all the aforementioned variables, it becomes imperative that the quality of data provided by wearable sensors needs to be evaluated. This paper describes an empirical study resulting in evaluating the accuracy of human activity recognition by wearable sensors based on the type of sensor, the physical mounting position of the sensor on the human body, their type of activity being monitored and the type of device being used. The paper further delves …",
        "citations": 23
    },
    {
        "title": "Mobile road pothole classification and reporting with data quality estimates",
        "id": "GX_Iau8AAAAJ:olpn-zPbct0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:olpn-zPbct0C",
        "authors": [
            "Ayush Vora",
            "Leon Reznik",
            "Igor Khokhlov"
        ],
        "pub_source": "2018 Fourth International Conference on Mobile and Secure Services (MobiSecServ)",
        "pub_date": "2018/2/24",
        "description": "Harnessing the power of mobile computing platforms has opened up newer possibilities of gathering and classifying data by leveraging the use of crowd-sourcing. In the current generation that is being dominated by the mobile computing platform namely smart-phones, crowd-sourcing can be achieved in a relatively hassle-free yet effective means of collecting data from a large set of ordinary users. Tapping into this source pool, however, has a drawback of unspecified data quality and security and hence the lack of trust in the data collected. This paper proposes an approach that aims to realize the most influential factors related to destructiveness of potholes that are encountered on roadways, while supplementing the data with quality estimates derived from the completeness of the data and security and quality factors of the input device itself that is involved in the data collection process, thereby addressing the …",
        "citations": 6
    },
    {
        "title": "What can data analysis recommend on design of wearable sensors?",
        "id": "GX_Iau8AAAAJ:Mojj43d5GZwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:Mojj43d5GZwC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik",
            "Suresh Babu Jothilingam",
            "Rohit Bhaskar"
        ],
        "pub_source": "2018 15th IEEE Annual Consumer Communications & Networking Conference (CCNC)",
        "pub_date": "2018/1/12",
        "description": "The paper aims at developing recommendations on the design and use of human activity recognition systems based on wearable sensors and their applications. Both the system structure and the application design challenges are addressed. Various design problems are investigated such as the selection of a number and types of sensors, amount of samples used for recognition, choice of machine learning techniques and the features set for a classifier design as well as the type of a training model employed. The design is implemented on the Android smartphone sensors platform and tested by conducting an empirical study in a real-life environment. The study results are provided and discussed. The recommendations on the sensor systems design are derived.",
        "citations": 4
    },
    {
        "title": "Android system security evaluation",
        "id": "GX_Iau8AAAAJ:HE397vMXCloC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:HE397vMXCloC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik"
        ],
        "pub_source": "2018 15th IEEE Annual Consumer Communications & Networking Conference (CCNC)",
        "pub_date": "2018/1/12",
        "description": "This demonstration presents an application for a system security score evaluation. The security score represents overall security level of the Android OS based device. The proposed application is based on the library that uses standard Android OS API and Google SafetyNet library. We followed up modular approach that allows to use our library independently from our application in any stock Android OS version 5.0 and above. Application evaluates overall security level, gives an explanation of the each parameter, gives advices how to improve overall security of the device, and allows to simulate the evaluation that shows how each parameter affects the security level.",
        "citations": 33
    },
    {
        "title": "Colluded applications vulnerabilities in android devices",
        "id": "GX_Iau8AAAAJ:N5tVd3kTz84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:N5tVd3kTz84C",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik"
        ],
        "pub_source": "2017 IEEE 15th Intl Conf on Dependable, Autonomic and Secure Computing, 15th Intl Conf on Pervasive Intelligence and Computing, 3rd Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress (DASC/PiCom/DataCom/CyberSciTech)",
        "pub_date": "2017/11/6",
        "description": "Modern smartphones may store user's very private information whose leakage may cause bad or even dramatic privacy and security violations. In this paper, we describe in details possible vulnerabilities whose exploitation can lead to a privacy leakage. These vulnerabilities depend on communication between colluded applications, which can employ either an overt or covert mode communication to bypass permission security mechanisms of the Android OS. Covert communication can even conceal the very fact of their communication act to help avoid a detection by anti-malware software. In the reported empirical study, we simulated various cases of both attack types on the Android device. By employing Android system monitor tools, signals characterizing application's allocated memory consumption and overall memory consumption as well as a CPU utilization have been recorded and analyzed over periods of …",
        "citations": 4
    },
    {
        "title": "Neural networks and the search for a quadratic residue detector",
        "id": "GX_Iau8AAAAJ:wbdj-CoPYUoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:wbdj-CoPYUoC",
        "authors": [
            "Michael Potter",
            "Leon Reznik",
            "Stanisław Radziszowski"
        ],
        "pub_source": "2017 International Joint Conference on Neural Networks (IJCNN)",
        "pub_date": "2017/5/14",
        "description": "This paper investigates the feasibility of employing artificial neural network techniques for solving fundamental cryptography problems, taking quadratic residue detection as an example. The problem of quadratic residue detection is one which is well known in both number theory and cryptography. While it garners less attention than problems such as factoring or discrete logarithms, it is similar in both difficulty and importance. No polynomial-time algorithm is currently known to the public by which the quadratic residue status of one number modulo another may be determined. This work leverages machine learning algorithms in an attempt to create a detector capable of solving instances of the problem more efficiently. A variety of neural networks, currently at the forefront of machine learning methodologies, were compared to see if any were capable of consistently outperforming random guessing as a mechanism for …",
        "citations": 1
    },
    {
        "title": "Sentiment Analysis: Android applications",
        "id": "GX_Iau8AAAAJ:kzcrU_BdoSEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:kzcrU_BdoSEC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Rochester Institute of Technology",
        "pub_date": "2017/5",
        "description": "As there are millions of applications available today that serves various purposes, therefore its components like sentiment analysis of the user comments have become an important study of research. Sentiment Analysis is also known as opinion mining that helps in evaluating whether the content is negative, neutral or positive. It helps in understanding the attitude or how the user feels with respect to a topic. Most of the users provide comments and ratings to an application after getting acquainted with the application. We are mainly concerned with the opinions of other users while downloading an application. These feedback’s play an important role in shaping our views. Reviewing each and every comment becomes difficult and thus the natural language processing with respect to sentiment analysis comes into the picture. Users are not only concerned with the feedback but also various other factors such as security …"
    },
    {
        "title": "Secure communication and signal processing in inertial navigation systems",
        "id": "GX_Iau8AAAAJ:XiVPGOgt02cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:XiVPGOgt02cC",
        "authors": [
            "Liam Herlihy",
            "Erik Golen",
            "Leonid Reznik",
            "Sergey Edward Lyshevski"
        ],
        "pub_source": "2017 IEEE 37th International Conference on Electronics and Nanotechnology (ELNANO)",
        "pub_date": "2017/4/18",
        "description": "This paper focuses on secure communication, data-analytic signal processing and robust algorithms for inertial navigation systems (INSs). Middleware, software, data processing and algorithms are studied. We examine and report high-impact technology developments as applied to current and next generations of INSs. We research advanced microelectronic, processing and software solutions. New architectures, algorithms and protocols for robustly reconfigurable networked inertial systems are studied. Examining advanced-technology inertial measurement units with application-specific integrated circuits, long-standing problems are solved. The INSs impediments are minimized by using intelligent processing schemes, consistent algorithms and software. Precision, accuracy, resolution, stability, bandwidth and dynamic range are improved by attenuating noise, reducing static error and minimizing dynamic error …",
        "citations": 9
    },
    {
        "title": "Data security evaluation for mobile android devices",
        "id": "GX_Iau8AAAAJ:bnK-pcrLprsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:bnK-pcrLprsC",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik"
        ],
        "pub_source": "2017 20th Conference of Open Innovations Association (FRUCT)",
        "pub_date": "2017/4/3",
        "description": "Vast spreading of Android-based devices with embedded diverse sensors make them popular platforms for data collection in various research domains. However, Android OS complexity and vulnerabilities may facilitate sensor data manipulation and falsification that will have a high impact on data security and quality. This paper presents a data security and quality evaluation method based on a possibility assessment of malicious actions that exploit certain Android OS features and vulnerabilities as well as applications installed. It describes the Android OS architecture features related to security and major security mechanisms. The paper shows metrics chosen for data security evaluation and the developed method of their integration that computes Overall Security Evaluation Score representing sensor originated data trustworthiness level. The examples of Overall Security Evaluation Score calculation are …",
        "citations": 27
    },
    {
        "title": "Data security and quality evaluation framework: Implementation empirical study on android devices",
        "id": "GX_Iau8AAAAJ:5ugPr518TE4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:5ugPr518TE4C",
        "authors": [
            "Igor Khokhlov",
            "Leon Reznik",
            "Ashish Kumar",
            "Ankan Mookherjee",
            "Rohan Dalvi"
        ],
        "pub_source": "2017 20th Conference of Open Innovations Association (FRUCT)",
        "pub_date": "2017/4/3",
        "description": "Tremendous growth of a number of mobile devices and amount of data produced by sensors embedded therein requires new approaches to sensor data management. The main feature of the novel approach proposed in this paper includes an assignment of security and data quality indicators to data entities. These indicators represent the trustworthiness level, which a data consumer may have. Employing them as filters would allow for an optimization of diverse sensors data processing and fusing with a significant reduction in data volumes. The paper describes the developed comprehensive methodology that resulted in the evaluation framework. Framework merges together sensor data collection and security and quality evaluation methods as well as procedures for calculating various data quality metrics such as sensor accuracy, reliability, timeliness, correctness and their integration. The paper desribes main …",
        "citations": 9
    },
    {
        "title": "Vision Assistive Devices and User Interfaces",
        "id": "GX_Iau8AAAAJ:1yQoGdGgb4wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:1yQoGdGgb4wC",
        "authors": [
            "L Reznik",
            "L Lvovsky",
            "H Reznik",
            "L Ulanovsky"
        ],
        "pub_source": "US Patent App. 15/268,927",
        "pub_date": "2017/3/9",
        "description": "Vision assistive device and user interface are disclosed. In some embodiments, a vision assistive device includes a housing having a base for positioning the housing on a surface; one or more imaging units disposed along a top portion of the housing, each imaging unit being angled downward so a central axis of the imaging unit forms an acute angle with the surface so the imaging unit captures a target image from a target object; and a control system accommodated within the housing, the control system being connected to the one or more imaging units to process the target image captured by each imaging unit and to output the target image to a user.",
        "citations": 3
    },
    {
        "title": "Traffic Light Detection",
        "id": "GX_Iau8AAAAJ:UHK10RUVsp4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:UHK10RUVsp4C",
        "authors": [
            "Swati Bhartiya",
            "Leon Reznik"
        ],
        "pub_source": "",
        "pub_date": "2016/12/12",
        "description": "Traffic signal detection, from an image, is a vital part of any intelligent system that deals with the maintenance of traffic rules and regulations. Organizations that deal with traffic laws and regulations require an intelligent system which when given an input image is able to determine the presence of a traffic signal, the type of light that is lit up on the signal. This paper is based on recognition of the traffic light that is lit up in a traffic signal given an image. This has various other applications as well-self-driving cars need real-time road assistance. Hence, it can be used by the video camera that captures the nearby surroundings of the self-driving car."
    },
    {
        "title": "Step Counting Investigation with Smartphone Sensors",
        "id": "GX_Iau8AAAAJ:AXPGKjj_ei8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:AXPGKjj_ei8C",
        "authors": [
            "Rohit Dilip Giyanani",
            "Leon Reznik"
        ],
        "pub_source": "",
        "pub_date": "2016/12/12",
        "description": "2 Background Research 3 2.1 Data collection for the Step Counter Accuracy Study......... 3 2.2 Results from the Step Counter Accuracy Study............ 4 2.3 Inferences from the study......................... 4"
    },
    {
        "title": "Vision assistive devices and user interfaces",
        "id": "GX_Iau8AAAAJ:ZuybSZzF8UAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ZuybSZzF8UAC",
        "authors": [
            "L Reznik",
            "L Lvovsky",
            "H Reznik",
            "L Ulanovsky"
        ],
        "pub_source": "US Patent 9,449,531",
        "pub_date": "2016/9/20",
        "description": "Vision assistive device and user interface are disclosed. In some embodiments, a vision assistive device includes a housing having a base for positioning the housing on a surface; one or more imaging units disposed along a top portion of the housing, each imaging unit being angled downward so a central axis of the imaging unit forms an acute angle with the surface so the imaging unit captures a target image from a target object; and a control system accommodated within the housing, the control system being connected to the one or more imaging units to process the target image captured by each imaging unit and to output the target image to a user.",
        "citations": 2
    },
    {
        "title": "Fuzzy Intervals Application for Software Metrological Certification in Measurement and Information Systems",
        "id": "GX_Iau8AAAAJ:fQNAKQ3IYiAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:fQNAKQ3IYiAC",
        "authors": [
            "Konstantin K Semenov",
            "Leonid K Reznik",
            "Gennady N Solopchenko"
        ],
        "pub_source": "International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems",
        "pub_date": "2015/12",
        "description": "This paper analyzes the advantages and disadvantages of two types of self-validating software that may run on into measurements devices: programs, which realize interval computations, and programs, which process inaccurate initial data that are expressed in terms of fuzzy intervals. The proposed analysis is presented from the viewpoint of metrology requirements. It is demonstrated that expressing measurement uncertainties in the form of fuzzy intervals results in the software that is better suited for its application in measurement systems.",
        "citations": 4
    },
    {
        "title": "Fuzzy System Design for Security and Environment Control Applications",
        "id": "GX_Iau8AAAAJ:LPZeul_q3PIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:LPZeul_q3PIC",
        "authors": [
            "Andrew Heyman",
            "Leon Reznik",
            "Michael Negnevitsky",
            "Andrew Hoffman"
        ],
        "pub_source": "International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems",
        "pub_date": "2015/12",
        "description": "As the amount of data available to researchers continues to grow, sharp class distinctions generated through Boolean logic fundamentally limit researchers' abilities to adequately process data into useable information. The application of fuzzy systems to real world problems allows us to synthesize this raw data into meaningful results. This paper demonstrates how fuzzy theory can be applied to real life application's design where rules can be generated explicitly through an expert system, or implicitly derived through a hybrid neural-fuzzy system. The paper illustrates the success of the fuzzy system use in applications by providing examples in the context of mobile device security evaluation and air quality evaluation and prediction. The examples represent important application areas within engineering and information technology domains."
    },
    {
        "title": "Trust evaluation in mobile devices: An empirical study",
        "id": "GX_Iau8AAAAJ:WbkHhVStYXYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:WbkHhVStYXYC",
        "authors": [
            "Richard Weiss",
            "Leon Reznik",
            "Yanyan Zhuang",
            "Andrew Hoffman",
            "Darrell Pollard",
            "Albert Rafetseder",
            "Tao Li",
            "Justin Cappos"
        ],
        "pub_source": "2015 IEEE Trustcom/BigDataSE/ISPA",
        "pub_date": "2015/8/20",
        "description": "Mobile devices today, such as smartphones and tablets, have become both more complex and diverse. This paper presents a framework to evaluate the trustworthiness of the individual components in a mobile system, as well as the entire system. The major components are applications, devices and networks of devices. Given this diversity and multiple levels of a mobile system, we develop a hierarchical trust evaluation methodology, which enables the combination of trust metrics and allows us to verify the trust metric for each component based on the trust metrics for others. The paper first demonstrates this idea for individual applications and Android-based smartphones. The methodology involves two stages: initial trust evaluation and trust verification. In the first stage, an expert rule system is used to produce trust metrics at the lowest level of the hierarchy. In the second stage, the trust metrics are verified by …",
        "citations": 10
    },
    {
        "title": "Devices, Systems and User Interfaces for Simplifying Control of Portable Computers",
        "id": "GX_Iau8AAAAJ:vRqMK49ujn8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:vRqMK49ujn8C",
        "authors": [
            "L Reznik"
        ],
        "pub_source": "US Patent App. 14/616,123",
        "pub_date": "2015/8/6",
        "description": "Devices, systems and user interfaces for simplifying control of portable computers are provided. For example, a system for simplifying operation of a computing device may comprise a frame defining a receptacle, the receptacle being sized and shaped to receive a computing device; one or more controllers disposed on the frame; and an electrical connector disposed in the receptacle for electrically connecting the frame to the computing device, wherein, when the frame is electrically connected to the computing device, the one or more controllers are enabled to operate the computing device.",
        "citations": 4
    },
    {
        "title": "Data quality indicators composition and calculus: Engineering and information systems approaches",
        "id": "GX_Iau8AAAAJ:uWQEDVKXjbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:uWQEDVKXjbEC",
        "authors": [
            "Leon Reznik",
            "Sergey Edward Lyshevski"
        ],
        "pub_source": "Sensors & Transducers",
        "pub_date": "2015/2/1",
        "description": "Big Data phenomenon is a result of novel technological developments in sensor, computer and communication technologies. Nowadays more and more data are produced by nanoscale photonic, optoelectronic and electronic devices. However, their quality characteristics could be very low. The paper proposes new methods of the data management with huge data amounts that is based on associating of data quality indicators with each data entity. To achieve this goal, one needs to define the composition of the data quality indicators and to develop their integration calculus. As data quality evaluation involves multidisciplinary research, various metrics have been investigated. The paper describes two major approaches in assigning the data quality indicators and developing their integration calculus. The information systems approach employs traditional high-level metrics like data accuracy, consistency and completeness. The engineering approach utilizes signal characteristics processed with the probability based calculus. The data quality metrics composition and calculus are discussed. The tools developed to automate the metrics selection and calculus procedures are presented. The user-friendly interface examples are provided. Copyright© 2015",
        "citations": 3
    },
    {
        "title": "Data Quality and Security Evaluation Tool for Nanoscale Sensors",
        "id": "GX_Iau8AAAAJ:u9iWguZQMMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:u9iWguZQMMsC",
        "authors": [
            "Leon Reznik",
            "Sergey Edward Lyshevski"
        ],
        "pub_source": "SECURWARE 2014",
        "pub_date": "2014/11/16",
        "description": "The paper proposes a novel approach to data and information management in multi-stream data collection systems with heterogeneous data sources. Data may be produced by novel nanoscale photonic, optoelectronic and electronic devices. Poor quality characteristics are expected. In the proposed approach, we use a set of data quality indicators with each data entity, and, develop the calculus that integrates various data quality (DQ) indicators ranging from traditional data accuracy metrics to network security and business performance measures. The integral indicator will calculate the DQ characteristics at the point of data use instead of conventional point of origin. The DQ metrics composition and calculus are discussed. The tools are developed to automate the metrics selection and calculus procedures for the DQ integration is presented. The user-friendly interactive capabilities are illustrated.",
        "citations": 1
    },
    {
        "title": "Estimates and measures of data communication and processing in nanoscaled classical and quantum physical systems",
        "id": "GX_Iau8AAAAJ:UxriW0iASnsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:UxriW0iASnsC",
        "authors": [
            "Sergey E Lyshevski",
            "Leonid Reznik",
            "Trevor C Smith",
            "Mamyrbek A Beisenbi",
            "Janar Y Jarasovna",
            "Nurlan S Mukataev",
            "Arystan N Omarov"
        ],
        "pub_source": "14th IEEE International Conference on Nanotechnology",
        "pub_date": "2014/8/18",
        "description": "This paper studies fundamentals of classical, classical-quantum and quantum information technologies to advance sensing, data acquisition and computing. The overall goal is to define, analyze and evaluate classical and quantum-mechanical information measures pertained to data processing by low-power nanoelectronic devices, nanoICs, nano-waveguides, CMOS nanophotonics, etc. Electronic, optoelectronic and photonic systems operate on the electron- and photon-induced transductions. There are fundamental differences in physics, arithmetics, device- and system-level solutions as electrostatic and quantum phenomena are utilized. This paper analyzes multi-physics quantum↔classical processing. We enable a knowledge base in cognizant areas across computer science and engineering. Our findings enable existing and future communication, sensing, information fusion, computing and processing …",
        "citations": 3
    },
    {
        "title": "Vision assistive device",
        "id": "GX_Iau8AAAAJ:tOudhMTPpwUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:tOudhMTPpwUC",
        "authors": [
            "L Reznik",
            "L Lvovsky",
            "H Reznik"
        ],
        "pub_source": "US Patent App. 29/449,236",
        "pub_date": "2014/4/1",
        "description": "2015-11-11 Assigned to THE GOVERNOR AND COMPANY OF THE BANK OF IRELAND, AS COLLATERAL AGENT reassignment THE GOVERNOR AND COMPANY OF THE BANK OF IRELAND, AS COLLATERAL AGENT SECURITY INTEREST (SEE DOCUMENT FOR DETAILS). Assignors: FREEDOM SCIENTIFIC INC., AS A GRANTOR2015-11-11 Assigned to THE GOVERNOR AND COMPANY OF THE BANK OF IRELAND, AS COLLATERAL AGENT reassignment THE GOVERNOR AND COMPANY OF THE BANK OF IRELAND, AS COLLATERAL AGENT SECURITY INTEREST (SEE DOCUMENT FOR DETAILS). Assignors: FREEDOM SCIENTIFIC INC., AS A GRANTOR",
        "citations": 4
    },
    {
        "title": "POSTER: Signal anomaly based attack detection in wireless sensor networks",
        "id": "GX_Iau8AAAAJ:yD5IFk8b50cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:yD5IFk8b50cC",
        "authors": [
            "Jeton Bacaj",
            "Leon Reznik"
        ],
        "pub_source": "Proceedings of the 2013 ACM SIGSAC conference on Computer & communications security",
        "pub_date": "2013/11/4",
        "description": "This paper presents a feasibility study of novel attack detection mechanisms in wireless sensor networks (WSN) based on detecting anomalies and changes in sensor signals and data values. Typical WSN attacks are considered in the empirical study of various attack detection techniques utilizing features based on sensor signal strength and other WSN technological parameters and using machine learning classification techniques such as clustering, rule learners, and neural networks. For the attack detection implementation the study employed WSN built from Sun kits available on the market and extended Sensor Network Anomaly Detection System (SNADS) framework of methods and tools.",
        "citations": 1
    },
    {
        "title": "Poster: Data quality evaluation: Integrating security and accuracy",
        "id": "GX_Iau8AAAAJ:cFHS6HbyZ2cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:cFHS6HbyZ2cC",
        "authors": [
            "Leon Reznik",
            "Elisa Bertino"
        ],
        "pub_source": "Proceedings of the 2013 ACM SIGSAC conference on Computer & communications security",
        "pub_date": "2013/11/4",
        "description": "Data quality (DQ) is essential to achieve data trustworthiness, as it assures that data is free of errors, complete, and consistent. This paper proposes an approach to evaluate DQ in multichannel sensor networks and systems with heterogeneous data sources. The approach integrates various DQ indicators ranging from traditional data accuracy metrics to network security and business performance measures. It demonstrates the advantage of including security metrics into the DQ evaluation for the design optimization of data fusion procedures and even the whole data collection and communication systems. The DQ metrics composition and calculus are discussed. However, the major attention is paid to the analysis of the relationship between conventional data accuracy metrics and network security indicators.",
        "citations": 11
    },
    {
        "title": "Measuring Vulnerability for Data coming in from Sensor Networks",
        "id": "GX_Iau8AAAAJ:mB3voiENLucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:mB3voiENLucC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Rochester Institute of Technology",
        "pub_date": "2013/6",
        "description": "1.1 BackgroundNational Institute of Standards and Technology (NIST) defines the term Data Vulnerability as a measurable quantity, taking into effect various NIST recommended security metrics like access control, authentication and effect on information integrity. Measuring the vulnerability accurately in a quantitative manner enables us to build accurate estimation models to determine the trustworthiness of the data. The focus of this project is applying a relevant estimation method to determine the vulnerability of the system. The system under focus here is a sensor network, which generally operates with minimum or no human interaction. Sensor networks typically carry sensitive data, and unless there is a way to validate the data coming in from these sensor networks, we cannot afford to trust this data. Measuring the vulnerability of data coming in from sensor networks under different threat models, will give us an …"
    },
    {
        "title": "Information-theoretic estimates of communication and processing in nanoscale and quantum optoelectronic systems",
        "id": "GX_Iau8AAAAJ:O3NaXMp0MMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:O3NaXMp0MMsC",
        "authors": [
            "Sergey Edward Lyshevski",
            "Leonid Reznik"
        ],
        "pub_source": "2013 IEEE XXXIII International Scientific Conference Electronics and Nanotechnology (ELNANO)",
        "pub_date": "2013/4/16",
        "description": "This paper applies information theory to examine communication and processing in nanoscale and quantum optoelectronic systems. Classical, semiclassical and quantum information-theoretic analyses and measures are proposed and examined. The reported results and new findings enable practical technological solutions supported by nanoscaled microelectronics and optoelectronics. Our results may advance communication and processing schemes. We contribute to areas of a critical importance and significance, such as communication, data processing, biotechnology, neurophotonics, photonics, etc.",
        "citations": 4
    },
    {
        "title": "On the Impact of Occupation Exposure on Personal Computer Practices",
        "id": "GX_Iau8AAAAJ:RGFaLdJalmkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:RGFaLdJalmkC",
        "authors": [
            "Kimberley Francis",
            "Richard Ballard",
            "Leonid Reznik"
        ],
        "pub_source": "8th Annual Symposium on Information Assurance",
        "pub_date": "2013",
        "description": "Measuring the level of security of general computer users is a difficult problem that has many variables. In this work, we seek to focus on a particular facet of general user security practices by analyzing the relationship between the occupation of such users and their personal computer security practices. In doing so, we hope to reveal the extent to which computer security practices are influenced by day-to-day occupations and activities. To accomplish this task we created and distributed a survey tailored towards laymen using a variety of social media channels to acquire a large enough respondent sample size to produce data worthy of statistical analysis. Then, we analyzed this data by comparing the security practices of users in certain occupations against general users. We also analyzed the relative risk of a user’s security practices when exposed to certain occupations. This helped support our assessment of which occupations generally have users with superior computer security practices. Our results show that users in engineering, technology, and healthcare fields have statistically superior security practices regarding password policies and use of security mechanisms (eg firewalls and antivirus solutions). Using the data and observations from our analysis, we also provide general suggestions and recommendations for users to improve their computer security practices.",
        "citations": 1
    },
    {
        "title": "Scalable multi-precision simulation of spiking neural networks on GPU with OpenCL",
        "id": "GX_Iau8AAAAJ:4TOpqqG69KYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:4TOpqqG69KYC",
        "authors": [
            "Dmitri Yudanov",
            "Leon Reznik"
        ],
        "pub_source": "The 2012 International Joint Conference on Neural Networks (IJCNN)",
        "pub_date": "2012/6/10",
        "description": "Biologically-realistic multi-precision spiking neural network (SNN) simulation is designed and implemented on a new GPU device Radeon™ HD 7970 using OpenCL framework. The implementation aims to investigate the role of time precision in simulated SNNs. Simulation methods and GPU platforms are reviewed. Simulation model and process are presented and analyzed. The GPU model is capable of simulating a SNN with up to two million neurons. GPU and CPU results are directly verified and found to match exactly.",
        "citations": 8
    },
    {
        "title": "Integral instrumentation data quality evaluation: The way to enhance safety, security, and environment impact",
        "id": "GX_Iau8AAAAJ:mVmsd5A6BfQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:mVmsd5A6BfQC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "2012 IEEE International Instrumentation and Measurement Technology Conference Proceedings",
        "pub_date": "2012/5/13",
        "description": "Digital and network revolution has significantly changed the ways how instruments are designed and employed. These changes open up new opportunities but also introduce novel challenges, especially in instrumentation security and safety, and environmental effect domains. The paper proposes the development of new instrument quality assessment and assurance methodology, which should integrate traditional metrics of accuracy and reliability with novel standards for security, safety, and environmental impact. This integral evaluation use in instruments design and service will substantially increase safety, security, and environment levels. The methodology design principles and composition are discussed. Quality evaluation examples as well as practical cases are considered.",
        "citations": 4
    },
    {
        "title": "Metrological self-assurance of data processing software",
        "id": "GX_Iau8AAAAJ:g5m5HwL7SMYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:g5m5HwL7SMYC",
        "authors": [
            "Vladik Kreinovich",
            "Leonid Reznik",
            "Konstantin K Semenov",
            "Gennady N Solopchenko"
        ],
        "pub_source": "",
        "pub_date": "2012",
        "description": "The metrological self-assurance for data processing software is discussed. The way to achieve this property for software is presented.",
        "citations": 5
    },
    {
        "title": "Processing of extremely-large-data and high-performance computing",
        "id": "GX_Iau8AAAAJ:2P1L_qKh6hAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:2P1L_qKh6hAC",
        "authors": [
            "Sergey E Lyshevski",
            "Leonid Reznik"
        ],
        "pub_source": "Proceedings of the International Conference on High Performance Computing",
        "pub_date": "2012",
        "description": "High performance computing implies the ability to effectively, efficiently, consistently, cohesively and coherently access, represent, manage, store, assess, evaluate, compute and process data, thereby enabling analysis, visualization, data mining, extraction,“knowledge generation”,“learning”,“intelligence”,“cognition”, etc. In various applications, processing is accomplished on very large heterogeneous data sets. Exceptional scalable microelectronic hardware solutions, efficient algorithms, advanced architectures, enabling organizations and other solutions were developed and effectively used. However, the nanoscale microelectronics, microelectromechanical systems, photonics and nanotechnology frequently result in diverse, incomplete, incompatible and heterogeneous extremely-large-scale data. The problems of data quality, data complexity, data consistency and data utilization have not being cohesively …",
        "citations": 4
    },
    {
        "title": "The current state of ordinary user security",
        "id": "GX_Iau8AAAAJ:_kc_bZDykSQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:_kc_bZDykSQC",
        "authors": [
            "Leon Reznik",
            "Andrew Christian",
            "Ankit Patel",
            "Brian Treich",
            "Mohammed Alromaih"
        ],
        "pub_source": "Annual Symposium on Information Assurance & Secure Knowledge Management",
        "pub_date": "2012",
        "description": "Past surveys regarding computer security habits of users have been targeted mostly towards companies and their employees, with little attention devoted to ordinary computer users. Investigating the everyday practice of ordinary computer and Internet users from the security perspective may provide valuable information. The data can be used to address the development of computer security tools and for planning educational activities. This paper presents the results of a number of surveys conducted in the winter of 2011-2012 by the students in Dr. Leonid Reznik’s class at the Rochester Institute of Technology. The surveys concentrated on various computer security habits such as types of passwords used, patching regularity, anti-virus software use, and mobile device usage habits. The data collected by one survey has enabled the comparison of computer security practices of two primary language speaker groups …",
        "citations": 1
    },
    {
        "title": "Future of instrumentation? Accuracy! reliability! performance! security?",
        "id": "GX_Iau8AAAAJ:-f6ydRqryjwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:-f6ydRqryjwC",
        "authors": [
            "Leon Reznik",
            "Michael Becker"
        ],
        "pub_source": "2011 Future of Instrumentation International Workshop (FIIW) Proceedings",
        "pub_date": "2011/11/7",
        "description": "The paper puts forward the idea of a wider inclusion of security issues in an instrumentation agenda. We argue that the instrumentation professional community has gained the needed experience and expertise that could be employed in addressing and solving numerous security problems in modern instrumentation and computer systems. The paper presents the development concept of the instrumentation quality evaluation and assurance methodology that should include security metrics along with accuracy, metrology, performance and reliability. The system's design and the metrics compilation are discussed. Case studies illustrating the main features of this implementation are provided."
    },
    {
        "title": "Automated data quality assessment of marine sensors",
        "id": "GX_Iau8AAAAJ:ufrVoPGSRksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ufrVoPGSRksC",
        "authors": [
            "Greg P Timms",
            "Paulo A de Souza Jr",
            "Leon Reznik",
            "Daniel V Smith"
        ],
        "pub_source": "Sensors",
        "pub_date": "2011/10/11",
        "description": "The automated collection of data (e.g., through sensor networks) has led to a massive increase in the quantity of environmental and other data available. The sheer quantity of data and growing need for real-time ingestion of sensor data (e.g., alerts and forecasts from physical models) means that automated Quality Assurance/Quality Control (QA/QC) is necessary to ensure that the data collected is fit for purpose. Current automated QA/QC approaches provide assessments based upon hard classifications of the gathered data; often as a binary decision of good or bad data that fails to quantify our confidence in the data for use in different applications. We propose a novel framework for automated data quality assessments that uses Fuzzy Logic to provide a continuous scale of data quality. This continuous quality scale is then used to compute error bars upon the data, which quantify the data uncertainty and provide a more meaningful measure of the data’s fitness for purpose in a particular application compared with hard quality classifications. The design principles of the framework are presented and enable both data statistics and expert knowledge to be incorporated into the uncertainty assessment. We have implemented and tested the framework upon a real time platform of temperature and conductivity sensors that have been deployed to monitor the Derwent Estuary in Hobart, Australia. Results indicate that the error bars generated from the Fuzzy QA/QC implementation are in good agreement with the error bars manually encoded by a domain expert.",
        "citations": 30
    },
    {
        "title": "Handling information flow in printed text processing",
        "id": "GX_Iau8AAAAJ:08ZZubdj9fEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:08ZZubdj9fEC",
        "authors": [
            "L Reznik",
            "L Ulanovsky",
            "H Reznik"
        ],
        "pub_source": "US Patent App. 12/952,447",
        "pub_date": "2011/7/28",
        "description": "Systems, methods and computer-readable media for processing an image are disclosed. The system comprises a processor, an image capturing unit in communication with the processor, an inspection surface positioned so that at least a portion of the inspection surface is within a field of view (FOV) of the image capturing unit, and an output device. The system has software that monitors the FOV of the image capturing unit for at least one event. The inspection surface is capable of supporting an object of interest. The image capturing unit is in a video mode while the software is monitoring for the at least one event",
        "citations": 5
    },
    {
        "title": "Security of computer use practice: The case of ordinary users survey",
        "id": "GX_Iau8AAAAJ:YOwf2qJgpHMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:YOwf2qJgpHMC",
        "authors": [
            "Leon Reznik",
            "Vincent J Buccigrossi III",
            "Justin Lewis",
            "Asif Dipon",
            "Stefanie Milstead",
            "Nathan LaFontaine",
            "Kenneth Beck",
            "Holden Silva"
        ],
        "pub_source": "Proceedings of the 5th Annual Symposium on Information Assurance (ASIA’11)",
        "pub_date": "2011/6/7",
        "description": "While numerous surveys in regards to computer security are conducted by organizations in order to study the behavior of their employees and users, the most influential in determining the security of a general computer environment group of ordinary users is still lacking in attention. This paper presents the survey results of more than 3,000 computer users who participated in a survey conducted in 2010-2011 by Prof. Reznik’s students at RIT. They researched the practice of home computer users including: the passwords used, patching regularity, firewalls, and anti-virus software application. The samples of results are analyzed and presented here. These results may be utilized for improving overall computer security as well as for the education of users.",
        "citations": 2
    },
    {
        "title": "온주밀감 신품종 ‘하례’,‘삼다’및 ‘탐나’조생의 품질 특성",
        "id": "GX_Iau8AAAAJ:CHSYGLWDkRkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:CHSYGLWDkRkC",
        "authors": [
            "고상욱， 윤수현， 박재호， 문영일， 채치원"
        ],
        "pub_source": "한국원예학회 학술발표요지",
        "pub_date": "2011/5",
        "description": "성되어 보급되기 시작하였다. 기존 품종과 대비하여 특성검정이 완료되었으나각 품종은 서로 다른 시기에 육성되어 동일한 조건에서 비교가 되지 못하였다. 묘목으로 양성된 하례조생, 탐나조생 및 삼다조생이 안정 착과 안정수령에 도달하고 있어 보다 세부적으로 각 품종의 성숙기의 품질 특성을 검정하기위하여 시험을 수행하였다. 감귤시험장 동일 포장에 재식된 엽과비 25 내외로착과 수준이 비슷한 탱자대목의 7 년생 하례, 삼다 및 탐나 조생 온주밀감의 과실을 대상으로 품질을 조사하였다. 시료는 2010 년 12 월 7 일에 착과된 과실을전부 일시에 채취하였다. 각 품종별로 5 주를 선정하여 각기 나무에 착과된 모든과실을 드럼식 선과기를 이용하여 56mm-60mm 와 60-64mm 및 64-72mm 의 구멍을 통과하는 과실을 각기 따로 구분하여 각각 2 번, 3 번 및 4 번 과실로명명하여 전 과실에 대하여 가용성고형물 함량과 구연산으로 환산한 산함량을 조사하였다. 각 품종의 5 주 중 한 나무에서 2 번, 3 번 및 4 번 과실의 과즙을채취하여 유리당을 정량하였 …"
    },
    {
        "title": "Resource awareness in computational intelligence",
        "id": "GX_Iau8AAAAJ:kNdYIx-mwKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:kNdYIx-mwKoC",
        "authors": [
            "Roman V Yampolskiy",
            "Leon Reznik",
            "Mike Adams",
            "Joshua Harlow",
            "Dima Novikov"
        ],
        "pub_source": "International Journal of Advanced Intelligence Paradigms",
        "pub_date": "2011/1/1",
        "description": "High learning and adaptation ability of intelligent agents based on artificial neural networks (ANNs) has made them a popular tool in design and implementation of intrusion detection systems (IDS). However, ANN might consume significant resources during their retraining because of network changes. The paper investigates the design of ANN structures that may reduce the resource consumption without a substantial performance degradation. It describes the results of empirical studies examining a variety of design solutions, such as the choice of the ANN architecture and its parameters, the choice of an ANN fully connected topology versus a partial connectivity and the IDS design in a form of a hierarchical system of heterogeneous ANN-based agents. The results are analysed and design recommendations are provided. The fully connected ANN structure optimised with genetic algorithms has been found to …",
        "citations": 6
    },
    {
        "title": "Distributed neural networks for signal change detection: On the way to cognition in sensor networks",
        "id": "GX_Iau8AAAAJ:Se3iqnhoufwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:Se3iqnhoufwC",
        "authors": [
            "Leon Reznik",
            "Gregory Von Pless",
            "Tayeb Al Karim"
        ],
        "pub_source": "IEEE Sensors Journal",
        "pub_date": "2010/9/27",
        "description": "Cognition is a fundamental feature of natural intelligence, which a modern technology has not yet been able to reproduce in full capacity. Sensor networks provide a new technological support for a substantial increase in an amount and quality of information that might be collected and communicated in complex adaptive systems. Their application may significantly raise the degree of intelligence in system design and implementation into the levels where effects of cognition will start kicking in. The paper describes the results of an empirical study aiming to demonstrate that a cognition ability may be treated as a generic sensor network feature. The new architecture with neural networks distributed over the sensor network platforms was developed for sensor network engineering applications. The detection system learns to detect the change of not only the signal levels but also sensor signal shapes and parameters …",
        "citations": 11
    },
    {
        "title": "Measurement's result and its error as fuzzy variables: background and perspectives",
        "id": "GX_Iau8AAAAJ:Zph67rFs4hoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:Zph67rFs4hoC",
        "authors": [
            "Gennady N Solopchenko",
            "Konstantin K Semenov",
            "Vladik Kreinovich",
            "Leon Reznik"
        ],
        "pub_source": "Key Engineering Materials",
        "pub_date": "2010/9/1",
        "description": "The possibility of using fuzzy variables for describing measurands and their error characteristics is investigated. The elementary arithmetic operations within the limits of such representation are considered.",
        "citations": 2
    },
    {
        "title": "GPU-based simulation of spiking neural networks with real-time performance & high accuracy",
        "id": "GX_Iau8AAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:qjMakFHDy7sC",
        "authors": [
            "Dmitri Yudanov",
            "Muhammad Shaaban",
            "Roy Melton",
            "Leon Reznik"
        ],
        "pub_source": "The 2010 international joint conference on neural networks (IJCNN)",
        "pub_date": "2010/7/18",
        "description": "A novel GPU-based simulation of spiking neural networks is implemented as a hybrid system using Parker-Sochacki numerical integration method with adaptive order. Full single-precision floating-point accuracy for all model variables is achieved. The implementation is validated with exact matching of all neuron potential traces from GPU-based simulation versus those of a reference CPU-based simulation. A network of 4096 Izhikevich neurons simulated on an NVIDIA GTX260 device achieves real-time performance with a speedup of 9 compared to simulation executed on Opteron 285, 2.6-GHz device.",
        "citations": 68
    },
    {
        "title": "Automated assessment of data quality in marine sensor networks",
        "id": "GX_Iau8AAAAJ:eQOLeE2rZwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:eQOLeE2rZwMC",
        "authors": [
            "GP Timms",
            "PA De Souza",
            "L Reznik"
        ],
        "pub_source": "OCEANS'10 IEEE SYDNEY",
        "pub_date": "2010/5/24",
        "description": "Inference on aspects influencing data quality should be based on or derived from experience. In this work we implement a Fuzzy Set Theory approach to provide an assessment of data quality from a near-real time marine sensor network. The Fuzzy System firstly captures tacit knowledge using membership functions, and then uses these membership functions along with statistics derived from the data themselves to assess the quality of each measurement from the sensor network.",
        "citations": 14
    },
    {
        "title": "Intelligent Intrusion Detection Based on Genetically Tuned Artificial Neural Networks",
        "id": "GX_Iau8AAAAJ:_Ybze24A_UAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:_Ybze24A_UAC",
        "authors": [
            "Leon Reznik",
            "Michael J Adams",
            "Bryan Woodard"
        ],
        "pub_source": "Journal of Advanced Computational Intelligence Vol",
        "pub_date": "2010",
        "description": "Artificial intelligence techniques and in particular neural networks (ANN) have been widely employed in an Intrusion Detection System (IDS) design. Due to their high learning ability, their application allows achieving higher performance in various applications. However, they can improve the resource consumption at the same time. This design goal, which is very important in a real life IDS design has received much less attention so far. The paper investigates the optimization methods of improving the ANN-based IDS performance along with the resource consumption. A particular consideration is given to partially connected neural networks that open another way of tuning the ANN structure toward the application. The study examines the choice of the connectivity ratio and its optimization with genetic algorithms. Various genetic algorithms parameters are tested in computer network attacks detection and recognition problems. The results are analyzed and IDS design recommendations are provided."
    },
    {
        "title": "Wireless Sensor Netowork Attacks and Their Detection Based on Signal Anomalies",
        "id": "GX_Iau8AAAAJ:KlAtU1dfN6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:KlAtU1dfN6UC",
        "authors": [
            "Leon Reznik",
            "Kartik Nathan"
        ],
        "pub_source": "IEEE Transactions on Dependable and Secure Computing",
        "pub_date": "2010",
        "description": "Novel technological advancements in wireless mobile communications combined with the limited resources available on the nodes actualize the task of the development of effective and efficient security enhancement techniques, other than the preventive mechanisms. In wireless sensor networks (WSN) these requirements become particularly severe. The paper presents a feasibility study of novel distributed intrusion detection mechanisms based on detecting anomalies and changes in sensor signals. Typical WSN attacks are analyzed in order to determine, which ones result in changes in sensor signals that could be measured and detected. The attacks are executed as a part of an empirical study investigating a WSN implementation of a few various anomaly detection techniques such as clustering, Bayesian chains and neural networks. In order to promote the novel detection methods into a practical WSN design …",
        "citations": 2
    },
    {
        "title": "A framework for measurement anomaly detection in sensor networks",
        "id": "GX_Iau8AAAAJ:qxL8FJ1GzNcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:qxL8FJ1GzNcC",
        "authors": [
            "Leon Reznik",
            "Kartik Nathan"
        ],
        "pub_source": "SENSORS, 2009 IEEE",
        "pub_date": "2009/10/25",
        "description": "The paper discusses sensor signal processing and measurement related applications of a generic framework comprising of methods, modules and interfaces distributed over wireless sensor network (WSN) platforms. This original framework was developed based on the Squawk Java Virtual Machine to run on the Sun SPOT WSN platform sensor kits available on the market. The performance of the implemented system is evaluated using simulated and real-world tests. Testing included anomaly detection in measurements and sensor signals acquired by the sensor nodes. Testing results are analysed and provided in the paper.",
        "citations": 3
    },
    {
        "title": "Intrusion detection in sensor networks based on measurements",
        "id": "GX_Iau8AAAAJ:5nxA0vEk-isC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:5nxA0vEk-isC",
        "authors": [
            "Leon Reznik",
            "Bakytzhan K Bitemirov",
            "Michael Negnevitsky"
        ],
        "pub_source": "SENSORS, 2009 IEEE",
        "pub_date": "2009/10/25",
        "description": "The paper presents the results of an empirical study of the intrusion detection methods in wireless sensor networks (WSN). It intends to verify if networking of heterogeneous sensors in WSN improves the system reliability and security. Unlike many other reported approaches, which employ conventional networking intrusion detection techniques in a WSN environment, this paper presents methods specific to sensor networks. They are designed to take an advantage of receiving sensor signals from networked sensors by building the models of the sensor signals and, on the higher network levels, objects under measurement. The methods are based on statistical processing of the measurement results coming from sensors and employing those models to detect the anomalies caused either by an equipment malfunctioning or human malicious activities and mistakes. Three algorithms are examined and implemented …",
        "citations": 3
    },
    {
        "title": "General principles and purposes of computational intelligence",
        "id": "GX_Iau8AAAAJ:pqnbT2bcN3wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:pqnbT2bcN3wC",
        "authors": [
            "Leonid Reznik"
        ],
        "pub_source": "Systems Science and Cybernetics",
        "pub_date": "2009",
        "description": "Although the term of CI has been widely used for quite a long time with steadily increasing amount of research and practical applications, there is no anonymously accepted definition. This article considers CI as integrity of theories, applying methods and models analogous to those demonstrated by biological intelligent systems in problem solving and decision making. Among such theories are artificial neural networks, genetic algorithms and evolutionary computation, fuzzy and adaptive systems, approximate reasoning and learning, simulated annealing. As most of these methodologies have their own articles allocated, a lot of cross-references are expected to arise. On the other hand, this article maintains a more general level of discussion, paying a particular attention to relations between different CI components and examples of their integration.The article starts with a short presentation of CI as a synergetic structure of different methodologies and describes main principles of the selection of models and methods selection and their combination. It gives a brief report of the CI historical development, the current situation and main research and industrial activities in the area. It explains shortly various parts, however, concentrating mainly on their commonalties and distinguished features. CI components are treated as being complementary rather than",
        "citations": 7
    },
    {
        "title": "Intelligent real-time adaptation for power efficiency in sensor networks",
        "id": "GX_Iau8AAAAJ:j3f4tGmQtD8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:j3f4tGmQtD8C",
        "authors": [
            "Jody Podpora",
            "Leonid Reznik",
            "Gregory Von Pless"
        ],
        "pub_source": "IEEE Sensors Journal",
        "pub_date": "2008/11/18",
        "description": "This paper presents an intelligent, dynamic power conservation scheme for sensor networks in which the sensor network operation is adaptive to both changes in the objects under measurement and the network itself. The conservation scheme switches sensor nodes between a sleep and an active mode in a manner such that the nodes can maximize the time they spend in a power-efficient sleep state, which corresponds to a nonmeasuring and/or nontransmitting mode, while not missing important events. A switching decision is made based on changes (or their absence) in the signals sensed from the environment by an intelligent agent that has been trained to determine whether or not a special event has occurred. This intelligent agent is based on a novel neural network topology that allows for a significant reduction in the resource consumption required for its training and operation without compromising its …",
        "citations": 22
    },
    {
        "title": "Name Affiliation E-mail",
        "id": "GX_Iau8AAAAJ:9ZlFYXVOiuMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:9ZlFYXVOiuMC",
        "authors": [
            "Artur Abdullin",
            "Chris Boyle",
            "Oscar Castillo",
            "Vladimir Cherkasski",
            "Fahmida N Chowdhury NSF",
            "Jan Gehrke",
            "James Gentle",
            "George Mason",
            "Otthein Herzog",
            "Keith A Howell",
            "Mo Jamshidi",
            "Robert Kozma",
            "William F Lawless",
            "Jordan Malof",
            "Maciej A Mazurowski",
            "Patricia Melin",
            "Khalid Moidu",
            "Jaroslaw Pietrzykowski",
            "Danil Prokhorov",
            "Rammohan Ragade",
            "Leon Reznik",
            "Carlos Rojas",
            "Yung C Shin",
            "K Ganesh",
            "Thomas Wagner"
        ],
        "pub_source": "Workshop on Building Computational Intelligence and Machine Learning Virtual Organizations",
        "pub_date": "2008/10/24",
        "description": "Name Affiliation E-mail Page 85 List of participants Name Affiliation E-mail Artur Abdullin \nUniversity of Louisville ar. abdullin@ louisville. edu Chris Boyle University of Louisville chris. \nboyle@ louisville. edu Oscar Castillo Tijuana Institute of Technology ocastillo@ tectijuana. mx \nVladimir Cherkasski University of Minnesota cherk001@ umn. edu Fahmida N. Chowdhury \nNSF fchowdhu@ nsf. gov Jan Gehrke Universität Bremen, Bremen, Germany jgehrke@ tzi. de \nJames Gentle George Mason University jgentle@ gmu. edu Otthein Herzog University of \nBremen herzog@ tzi. de Keith A. Howell George Mason University khowell@ gmu. edu Mo \nJamshidi University of New Mexico moj@ wacongo. org Robert Kozma University of Memphis \nrkozma@ memphis. edu William F. Lawless Paine College lawlessw@ mail. paine. edu Jordan \nMalof University of Louisville jmmalo03@ gmail. com Maciej A. Mazurowski University of …"
    },
    {
        "title": "Application testing of novel neural network structures",
        "id": "GX_Iau8AAAAJ:0EnyYjriUFMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:0EnyYjriUFMC",
        "authors": [
            "Leon Reznik",
            "Gregory Von Pless",
            "Tayeb Al Karim"
        ],
        "pub_source": "Workshop on Building Computational Intelligence and Machine Learning Virtual Organizations",
        "pub_date": "2008/10/24",
        "description": "The paper describes applications of a modified timebased multilayer perceptron (MTBMLP), which is a complex structure composed from a few time-based multilayer perceptrons with a reduced connectivity. The modification reduces connections, isolates information for each function and produces knowledge about the system of functions as a whole. This neural network is applied for change detection in signals delivered by sensor networks and for edge detection in image processing. In both applications a MTBMLP is utilized for function predictions and, after a further structure development is implemented, for an error prediction also. In sensor network applications, a number of experiments with Crossbow sensor kits and the MTBMLP acting as a function predictor have been conducted and analyzed for detecting a significant change in signals of various shapes and nature. A series of experiments with Lena image have been conducted for edge detection applications. The results demonstrate that MTBMLP is more efficient and reliable than other methodologies in sensor network change detection and that its application in in edge detection is also feasible.",
        "citations": 3
    },
    {
        "title": "Development of the intelligent sensor network anomaly detection system: problems and solutions",
        "id": "GX_Iau8AAAAJ:_FxGoFyzp5QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:_FxGoFyzp5QC",
        "authors": [
            "Leon Reznik",
            "Carll Hoffman"
        ],
        "pub_source": "Workshop on Building Computational Intelligence and Machine Learning Virtual Organizations",
        "pub_date": "2008/10/24",
        "description": "The paper describes the development of the Sensor Network Anomaly Detection System (SNADS). SNADS is designated to become a framework to support signal change detection in sensor networks (SN), the backbone application of a crucial importance for design of other SN applications as well as for improving SN performance and security in general. SNADS will provide a cross-platform management of core SN operation. Although SN is built as a synergy of a variety of modules, the system centerpiece is a collection of intelligent agents realizing different computational intelligence and machine learning techniques employed for change detection in signals coming from sensors. The agents may have various levels of intelligence from a simple comparison against the thresholds through the rules system to neural networks structures distributed over the sensor network nodes. The system is written in Java and could be implemented with the JVM technology. The system composition and component design are described. Implementation details are given.",
        "citations": 5
    },
    {
        "title": "Measurement Theory and Uncertainty in Measurements: Application of Interval Analysis and Fuzzy Sets Methods",
        "id": "GX_Iau8AAAAJ:hFOr9nPyWt4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:hFOr9nPyWt4C",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Handbook of Granular Computing",
        "pub_date": "2008/7/18",
        "description": "This chapter contains sections titled:   Introduction   Measurement Science: Basic Concepts   Measurement Uncertainty Formalization: Generalized Theory and Granulation   Measurement Uncertainty Description: International and U.S. Perspectives   Measurement Procedures and Uncertainty Evaluation: Standard Definitions and Models – Probabilistic Approach   Measurement Procedures and Uncertainty Evaluation: Perspectives and Feasibility of a Fuzzy Approach   Measurement Procedures and Uncertainty Evaluation: Fuzzy Approach Implementation   Conclusion   References",
        "citations": 8
    },
    {
        "title": "Neural networks for cognitive sensor networks",
        "id": "GX_Iau8AAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Leon Reznik",
            "Gregory Von Pless"
        ],
        "pub_source": "2008 IEEE International Joint Conference on Neural Networks (IEEE World Congress on Computational Intelligence)",
        "pub_date": "2008/6/1",
        "description": "The paper puts forward a concept of cognitive sensor networks and investigates a feasibility of artificial neural networks application for its realization. It describes a design of novel hierarchical configurations imitating the structural topology of brain-like architectures. They are composed from artificial neural networks distributed over network platforms with limited resources. The paper examines a cognition idea based on its implementation through the signal change detection. The novel multilevel neural networks architectures are designed and tested in sensor networks built from Crossbow Inc. sensor kits. The results are compared against conventional multilayer perceptron structures in terms of both functional efficiency and resource consumption.",
        "citations": 24
    },
    {
        "title": "Fuzzy prediction models in measurement",
        "id": "GX_Iau8AAAAJ:3fE2CSJIrl8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:3fE2CSJIrl8C",
        "authors": [
            "Leonid Reznik",
            "Vladik Kreinovich"
        ],
        "pub_source": "IEEE Transactions on Fuzzy Systems",
        "pub_date": "2008/4/30",
        "description": "The paper investigates the feasibility of fuzzy models application in measurement procedures. It considers the problem of measurement information fusion from different sources, when one of the sources provides predictions regarding approximate values of the measured variables or their combinations. Typically, this information is given by an expert but may be mined from available data also. This information is formalized as fuzzy prediction models and is used in combination with the measurement results to improve the measurement accuracy. The properties of the modified estimates are studied in comparison with the conventional ones. The conditions when fuzzy models application can achieve a significant accuracy gain are derived, the gain value is evaluated, and the recommendations on fuzzy prediction model production and formalization in practical applications are given.",
        "citations": 4
    },
    {
        "title": "Web Services: Role Based Access Control with Single Sign-on Architecture",
        "id": "GX_Iau8AAAAJ:NJ774b8OgUMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:NJ774b8OgUMC",
        "authors": [
            "Yevgeniy Gershteyn",
            "Leon Reznik"
        ],
        "pub_source": "Rochester Institute of Technology",
        "pub_date": "2008/2/18",
        "description": "In a Modern World, Web Services have been widely used by different industries to improve business functions and productivity, integrate and automate customer support, etc. Hence, it is essential to protect the information and all other resources from unauthorized access by controlling the access via a particular system. Nowadays, large organizations are also switching their activities from host-based application platforms to network-distributed, client-server platforms that bring some difficulties for both end-users, who have multiple electronic identities for different systems, and system administrators, who manage multiple applications separately. Role-Based Access Control (RBAC) is a fairly novel access control technique that provides a centralized, dynamic, and consistent way to authorize management, specifically for the requirements of a particular industry to improve its security. Since an authentication …"
    },
    {
        "title": "Traffic Analysis Based Identification of Attacks.",
        "id": "GX_Iau8AAAAJ:M3ejUd6NZC8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:M3ejUd6NZC8C",
        "authors": [
            "Dima Novikov",
            "Roman V Yampolskiy",
            "Leon Reznik"
        ],
        "pub_source": "Int. J. Comput. Sci. Appl.",
        "pub_date": "2008/1",
        "description": "This paper is devoted to the problem of identification of network attacks via traffic analysis. Neural networks are chosen by us due to their capability to recognize an attack, to differentiate one attack from another, ie classify attacks, and, most important, to detect new attacks that were not included into the training set. Performed experiments demonstrate the advantage of our intrusion detection system compared to those created by the winner of the KDD Cup the leading data mining and knowledge discovery competition in the world. The results obtained indicate that it is possible to recognize attacks that the intrusion detection system never faced before on an acceptably high level.",
        "citations": 9
    },
    {
        "title": "Soft computing techniques to model the top-oil temperature of power transformers",
        "id": "GX_Iau8AAAAJ:blknAaTinKkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:blknAaTinKkC",
        "authors": [
            "H Nguyen",
            "GW Baxter",
            "L Reznik"
        ],
        "pub_source": "2007 International Conference on Intelligent Systems Applications to Power Systems",
        "pub_date": "2007/11/5",
        "description": "This paper presents an investigation and a comparative study of four different approaches namely ANSI/IEEE standard methods, Adaptive Neuro-Fuzzy Inference System (ANFIS), Multilayer Feedforward Neural Network (MFNN) and Elman Recurrent Neural Network (ERNN) to modeling and prediction of the top-oil temperature for the 8 MVA Oil Air (OA)-cooled and 27 MVA Forced Air (FA)-cooled class of power transformers. A comparison of the proposed techniques is presented for predicting top-oil temperature based on the historical data measured over a 35 day period for the first transformer and 4.5 days for the second transformer with either a half or a quarter hour sampling time. Comparison results indicate that hybrid neuro-fuzzy network is the best candidate for the analysis and predicting of power transformer top-oil temperature. The ANFIS demonstrated the paramount performance in temperature prediction …",
        "citations": 12
    },
    {
        "title": "Improving measurement accuracy in sensor networks by an object model generation and application",
        "id": "GX_Iau8AAAAJ:70eg2SAEIzsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:70eg2SAEIzsC",
        "authors": [
            "Leonid Reznik",
            "Kurt Alfred Kluever"
        ],
        "pub_source": "SENSORS, 2007 IEEE",
        "pub_date": "2007/10/28",
        "description": "The paper describes a novel method of calculating measurement results in sensor networks, which includes modifying the conventional measurement estimates based on the object under measurement model mined from the data collected by the sensor network itself previously and other information made available by domain experts. It is shown that the model application might produce a significant gain in measurement accuracy if the model is correct. The gain value is estimated and its dependence on various factors is studied by computer simulation and experimentation with real sensor networks built from Crossbow Telos ver. B motes. The conditions of achieving the gain versus suffering the loss are derived and the recommendations of how to shape the object model in order to achieve and maximize the gain value are provided.",
        "citations": 3
    },
    {
        "title": "An environmentally aware, intelligently controlled system for power efficient wireless sensor networks",
        "id": "GX_Iau8AAAAJ:MXK_kJrjxJIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:MXK_kJrjxJIC",
        "authors": [
            "Jody Podpora",
            "Leon Reznik"
        ],
        "pub_source": "SENSORS, 2007 IEEE",
        "pub_date": "2007/10/28",
        "description": "This paper examines the advantages of applying an ANN (artificial neural network) and other machine learning techniques to a battery-powered WSN (wireless sensor network) with the goal of extending network deployment lifetime. Preliminary experimental results have shown that through the use of these techniques that it is possible to achieve network lifetime extensions of several orders-of-magnitude versus always-on systems. (All experimental results were obtained by observing the power consumption of a \"live\" sensor network deployed using MotelV TelosB sensors in a laboratory environment.).",
        "citations": 3
    },
    {
        "title": "Fuzzy expert system shell development with computer security assessment application",
        "id": "GX_Iau8AAAAJ:YsMSGLbcyi4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:YsMSGLbcyi4C",
        "authors": [
            "Leon Reznik",
            "Robert St Jacques"
        ],
        "pub_source": "2007 IEEE International Fuzzy Systems Conference",
        "pub_date": "2007/7/23",
        "description": "The paper describes development of the universal fuzzy basic expert system shell (BESS). The goal of the Bess system is to provide a fuzzy expert system development framework that is not only language independent, but is not attached to a specific expert system shell either. An expert system that is written in Bess may be written exactly once regardless of the number of shell implementations and modifications on which it is intended to run; the only changes required in the system are the additions of new data, or the modifications of existing data. This arrangement completely separates the knowledge and data bases in an expert system from the rules engine used to make inferences. Bess is built on top of a simple, easy to use XML compliant language for describing expert systems in terms that are commonly used for this purpose. This software is used for developing an expert system for computer security evaluation.",
        "citations": 9
    },
    {
        "title": "Topology Selection for Signal Change Detection in Sensor Networks: RBF vs MLP",
        "id": "GX_Iau8AAAAJ:4DMP91E08xMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:4DMP91E08xMC",
        "authors": [
            "James L King",
            "Leon Reznik"
        ],
        "pub_source": "The 2006 IEEE International Joint Conference on Neural Network Proceedings",
        "pub_date": "2006/7/16",
        "description": "This paper documents the results of experimental simulations designed to compare the performance of Multilayer Perceptron (MLP) and Radial Basis Function (RBF) based sensor signal change detection systems. The two systems are simultaneously executed in parallel on the same input signals. Both systems share an identical implementation with the exception of the activation function used in the hidden layers of the artificial neural networks. Previous experiments have employed only Multilayer Perceptrons with sigmoidal activation functions. The results of these experiments quantitatively show the advantages and disadvantages of Radial Basis neural activation for both the function prediction and function correlation neural networks tested.",
        "citations": 4
    },
    {
        "title": "Artificial intelligence approaches for intrusion detection",
        "id": "GX_Iau8AAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Dima Novikov",
            "Roman V Yampolskiy",
            "Leon Reznik"
        ],
        "pub_source": "2006 IEEE Long Island Systems, Applications and Technology Conference",
        "pub_date": "2006/5/5",
        "description": "Recent research indicates a lot of attempts to create an intrusion detection system that is capable of learning and recognizing attacks it faces for the first time. Benchmark datasets were created by the MIT Lincoln Lab and by the International Knowledge Discovery and Data Mining group (KDD). A number of competitions were held and many systems developed as a result. The overall preference was given to expert systems that were based on decision making tree algorithms. This paper explores neural networks as means of intrusion detection. After multiple techniques and methodologies are investigated, we show that properly trained neural networks are capable of fast recognition and classification of different attacks at the level superior to previous approaches.",
        "citations": 40
    },
    {
        "title": "Anomaly detection based intrusion detection",
        "id": "GX_Iau8AAAAJ:u-x6o8ySG0sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:u-x6o8ySG0sC",
        "authors": [
            "Dima Novikov",
            "Roman V Yampolskiy",
            "Leon Reznik"
        ],
        "pub_source": "Third international conference on information technology: new generations (ITNG'06)",
        "pub_date": "2006/4/10",
        "description": "This paper is devoted to the problem of neural networks as means of intrusion detection. We show that properly trained neural networks are capable of fast recognition and classification of different attacks. The advantage of the taken approach allows us to demonstrate the superiority of the neural networks over the systems that were created by the winner of the KDD Cups competition and later researchers due to their capability to recognize an attack, to differentiate one attack from another, i.e. classify attacks, and, the most important, to detect new attacks that were not included into the training set. The results obtained through simulations indicate that it is possible to recognize attacks that the intrusion detection system never faced before on an acceptably high level",
        "citations": 69
    },
    {
        "title": "Embedding intelligent sensor signal change detection into sensor network protocols",
        "id": "GX_Iau8AAAAJ:W7OEmFMy1HYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:W7OEmFMy1HYC",
        "authors": [
            "Leon Reznik",
            "Gregory Von Pless",
            "Tayeb Al Karim"
        ],
        "pub_source": "2005 Second Annual IEEE Communications Society Conference on Sensor and Ad Hoc Communications and Networks, 2005. IEEE SECON 2005.",
        "pub_date": "2005/9/26",
        "description": "The paper develops intelligent protocols, enhancing efficiency, reliability and security based on detection of sensor signal changes, and describes their possible implementation on the lower level in sensor networks. Embedded into the communication protocols, the signal change detection will allow data compression for improving network efficiency. It might enhance reliability and security also. The protocol utilizes a neural network function prediction methodology in order to determine if the sensor signals have changed. In addition to the change detection system, a modification of a standard neural network function predictor is proposed that allows the detection system to learn quickly how to accurately predict next sensor outputs. The parameter choice and the relationship between the threshold values and false positive and negative rates are studied. The protocol is implemented and tested in real life environments with sensor networks built from Crossbow MICA-2 motes. Sensor Network Anomaly Detection Systems, which is designed to become a protocol’s core utility, is described. The test results are analyzed and recommendations on applications are provided.",
        "citations": 12
    },
    {
        "title": "Intelligent protocols based on sensor signal change detection",
        "id": "GX_Iau8AAAAJ:roLk4NBRz8UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:roLk4NBRz8UC",
        "authors": [
            "Leon Reznik",
            "Gregory Von Pless",
            "Tayeb Al Karim"
        ],
        "pub_source": "2005 Systems Communications (ICW'05, ICHSN'05, ICMCS'05, SENET'05)",
        "pub_date": "2005/8/14",
        "description": "Embedded into the communication protocols, the signal change detection will allow data compression for improving network efficiency. It enhances reliability and security also. The proposed change detector employs a neural network function prediction in order to determine if the sensor outputs have changed In addition to the change detection system, a modification to a standard neural network function predictor is proposed that allows the change detection system to quickly learn how to accurately predict next sensor outputs. The parameter choice and the relationship between the threshold values and false alarm and change missing rates are studied The protocol is implemented and tested in real life environments with sensor networks built from Crossbow MICA-2 motes. Sensor network change detection system, which is designed to become a protocol core utility, is described The test results are analyzed and …",
        "citations": 8
    },
    {
        "title": "Modified time-based multilayer perceptron for sensor networks and image processing applications",
        "id": "GX_Iau8AAAAJ:BqipwSGYUEgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:BqipwSGYUEgC",
        "authors": [
            "Gregory Von Pless",
            "Tayeb Al Karim",
            "Leonid Reznik"
        ],
        "pub_source": "Proceedings. 2005 IEEE International Joint Conference on Neural Networks, 2005.",
        "pub_date": "2005/7/31",
        "description": "The paper introduces a modified time-based multilayer perceptron (MTBMLP), which is a complex structure composed by a few time-based multilayer perceptrons. This modification reduces connections, isolates information for each function and produces knowledge about the system of functions as a whole. This neural network is applied for novelty and change detection in signals delivered by sensor networks and for edge detection in image processing. In both applications a MTBMLP is utilized for function predictions and, after a further structure development is implemented, for an error prediction also. In sensor network applications, a number of experiments with Crossbow sensor kits and the MTBMLP acting as a function predictor have been conducted and analyzed for detecting a significant change in signals of various shapes and nature. A series of experiments with Lena image have been conducted for edge …",
        "citations": 2
    },
    {
        "title": "Email communications analysis: how to use computational intelligence methods and tools?",
        "id": "GX_Iau8AAAAJ:WF5omc3nYNoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:WF5omc3nYNoC",
        "authors": [
            "Michael Negnevitsky",
            "MJ Lim",
            "Jacky Hartnett",
            "Leon Reznik"
        ],
        "pub_source": "CIHSPS 2005. Proceedings of the 2005 IEEE International Conference on Computational Intelligence for Homeland Security and Personal Safety, 2005.",
        "pub_date": "2005/3/31",
        "description": "The paper aims at investigating computational intelligence methodologies for detecting a change in communication behavioral patterns between e-mail subscribers. This change may indicate a change of social status and behavior, which could be used for early discovery of some preparation to antisocial activity, including but not limiting to terrorist attacks. The patterns in the social interactions or contacts between people by e-mail can be analyzed using social network analysis and user behavior analysis. In this paper we provide a review of the work related to the areas of dynamic modeling and link prediction of social networks, and anomaly detection for detecting changes in the behavior of e-mail usage. The feasibility of neural networks and fuzzy logic methodologies applications for a change detection system design is discussed, as well as a discussion about an e-mail simulation model currently being developed",
        "citations": 14
    },
    {
        "title": "Signal change detection in sensor networks with artificial neural network structure",
        "id": "GX_Iau8AAAAJ:zYLM7Y9cAGgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:zYLM7Y9cAGgC",
        "authors": [
            "Leon Reznik",
            "Gregory Von Pless",
            "Tayeb Al Karim"
        ],
        "pub_source": "CIHSPS 2005. Proceedings of the 2005 IEEE International Conference on Computational Intelligence for Homeland Security and Personal Safety, 2005.",
        "pub_date": "2005/3/31",
        "description": "The paper describes a design and implementation of a novel intelligent sensor network protocol enhancing reliability and security by detecting a change in sensor signals. The change could be caused by the sensor or communication unit malfunctioning or by malicious altering of a measurement result. The protocol utilizes a neural network function prediction methodology to predict sensor outputs in order to determine if the sensor outputs have changed. The parameter choice and the relationship between the threshold values and false alarm and missing attack rates are studied. The protocol is implemented and tested in real life environments with sensor networks built from Crossbow MICA motes. The test results are analyzed and recommendations on applications are provided",
        "citations": 23
    },
    {
        "title": "Time-based multi-layer perceptron for novelty detection in sensor networks",
        "id": "GX_Iau8AAAAJ:ULOm3_A8WrAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ULOm3_A8WrAC",
        "authors": [
            "Gregory Von Pless",
            "TA Karim",
            "Leon Reznik"
        ],
        "pub_source": "2004 International Conference on Machine Learning and Applications, 2004. Proceedings.",
        "pub_date": "2004/12/16",
        "description": "This paper proposes a novelty detection system for sensor networks. The system utilizes a neural network function prediction methodology to predict sensor outputs in order to determine if the sensor outputs are novel. In addition to the novelty detection system, a modification to a standard neural network function predictor is proposed that allows the novelty detection system to quickly learn to accurately predict next sensor outputs. The parameter choice and the relationship between the threshold values and false alarm and missing attack rates are studied and recommendations are provided.",
        "citations": 2
    },
    {
        "title": "Fuzzy and probabilistic models of association information in sensor networks",
        "id": "GX_Iau8AAAAJ:Y0pCki6q_DkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:Y0pCki6q_DkC",
        "authors": [
            "Leon Reznik",
            "Vladik Kreinovich"
        ],
        "pub_source": "2004 IEEE International Conference on Fuzzy Systems (IEEE Cat. No. 04CH37542)",
        "pub_date": "2004/7/25",
        "description": "The paper considers the problem of improving accuracy and reliability of measurement information acquired by sensor networks. It offers the way of integrating sensor measurement results with association information available or a priori derived at aggregating nodes. The models applied for describing both sensor results and association information are reviewed with consideration given to both neuro-fuzzy and probabilistic models and methods. The information sources, typically available in sensor systems, are classified according to the model (fuzzy or probabilistic), which seems more feasible to be applied. The integration problem is formalized as an optimization problem.",
        "citations": 21
    },
    {
        "title": "Contents based security enhancement in sensor networks protocols",
        "id": "GX_Iau8AAAAJ:LkGwnXOMwfcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:LkGwnXOMwfcC",
        "authors": [
            "L Reznik",
            "Michael Negnevitsky",
            "CB Hoffman"
        ],
        "pub_source": "Proceedings of the 2004 IEEE International Conference on Computational Intelligence for Homeland Security and Personal Safety, 2004. CIHSPS 2004.",
        "pub_date": "2004/7/22",
        "description": "Sensor networks protocols designers often consider sensor networks simply as a communication system transmitting information only in one direction from sensors to processing units. The fact that sensor networks represent a concurrent data acquisition system is rarely paid a proper attention. Sensor networks bring up a wealth of information on the object or process under measurement and the environment, and this information can as well be applied effectively for enhancing their own security and reliability. The paper proposes an investigation and development of more complex sensor network protocols with intelligent operations performed at the aggregate nodes. The protocol will compare the association information about measured variables with the current measurement results. Association information could be given a priori or generated during an application session.",
        "citations": 5
    },
    {
        "title": "Measurement models: application of intelligent methods",
        "id": "GX_Iau8AAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Leon Reznik",
            "Kishor P Dabke"
        ],
        "pub_source": "Measurement",
        "pub_date": "2004/1/1",
        "description": "The paper considers possible improvements in the methods of processing measurement results and uncertainty evaluation. It reviews the procedures currently applied for the measurement uncertainty calculation according to ISO Guide and reports on an expert system developed to teach and advise how to implement these procedures. The paper then investigates the broader problem of the feasibility of applying new emerging intelligent methods such as expert systems, fuzzy logic, neural networks and interval analysis for expression and evaluation of the measurement uncertainty. Fuzzy and interval theory models are proposed for describing some uncertainty components and two examples are presented in which a fuzzy specification of uncertainty is considered appropriate, one being the engineering measurement of sphericity and another one being measurement of computer security characteristics.",
        "citations": 40
    },
    {
        "title": "Use of fuzzy expert's information in measurement and what we can gain from its application in geophysics",
        "id": "GX_Iau8AAAAJ:Wp0gIr-vW9MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:Wp0gIr-vW9MC",
        "authors": [
            "Leon Reznik",
            "Vladik Kreinovich",
            "Scott A Starks"
        ],
        "pub_source": "The 12th IEEE International Conference on Fuzzy Systems, 2003. FUZZ'03.",
        "pub_date": "2003/5/25",
        "description": "The paper considers the problem of measurement information fusion from different sources, when one of the sources is an information about approximate values of the measured variables or their combinations. The information is given with fuzzy models and is used in combination with the measurement results. The properties of the modified estimates are studied in comparison with the conventional ones. The conditions when an expert's information application can give a high gain are derived, the gain value is estimated, the recommendations to an expert on making predictions are given. The possible gain in measurement result efficiency in geophysical applications is analyzed.",
        "citations": 2
    },
    {
        "title": "Soft computing in measurement and information acquisition",
        "id": "GX_Iau8AAAAJ:8k81kl-MbHgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:8k81kl-MbHgC",
        "authors": [
            "Leonid Reznik",
            "Vladik Kreinovich"
        ],
        "pub_source": "Springer Science & Business Media",
        "pub_date": "2003/5/9",
        "description": "The vigorous development of the internet and other information technologies have significantly expanded the amount and variety of sources of information available on decision making. This book presents the current trends of soft computing applications to the fields of measurements and information acquisition. Main topics are the production and presentation of information including multimedia, virtual environment, and computer animation as well as the improvement of decisions made on the basis of this information in various applications ranging from engineering to business. In order to make high-quality decisions, one has to fuse information of different kinds from a variety of sources with differing degrees of reliability and uncertainty. The necessity to use intelligent methodologies in the analysis of such systems is demonstrated as well as the inspiring relation of computational intelligence to its natural counterpart. This book includes several contributions demonstrating a further movement towards the interdisciplinary collaboration of the biological and computer sciences with examples from biology and robotics.",
        "citations": 17
    },
    {
        "title": "Uncertainty in measurement: Some thoughts about its expressing and processing",
        "id": "GX_Iau8AAAAJ:UebtZRa9Y70C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:UebtZRa9Y70C",
        "authors": [
            "Luca Mari",
            "Leon Reznik"
        ],
        "pub_source": "Soft computing in measurement and information acquisition",
        "pub_date": "2003",
        "description": "The paper discusses the concept of non-exactness of measurement results, and analyzes it by clearly distinguishing between: (i) the way the results are expressed to make their uncertainty explicit; (ii) the way the chosen expression is interpreted as a suitable combination of non-specificity and uncertainty; (iii) the way the interpreted results are formally dealt with. In this perspective the merits and flaws of the ISO Guide to the expression of uncertainty in measurement are highlighted.",
        "citations": 3
    },
    {
        "title": "Fuzzy system implementation through its approximation with simplified radial basis networks",
        "id": "GX_Iau8AAAAJ:zA6iFVUQeVQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:zA6iFVUQeVQC",
        "authors": [
            "Leonid Reznik"
        ],
        "pub_source": "2002 IEEE World Congress on Computational Intelligence. 2002 IEEE International Conference on Fuzzy Systems. FUZZ-IEEE'02. Proceedings (Cat. No. 02CH37291)",
        "pub_date": "2002/5/12",
        "description": "The paper investigates the method of a fuzzy system design through its approximation with neural networks. It concentrates on further simplification by replacement of a Gaussian radial basis function with its linear and piecewise linear approximation. Different approximating possibilities are tested on four controllers chosen as benchmarks."
    },
    {
        "title": "A Neuro-Fuzzy method of Power disturbances recognition and reduction",
        "id": "GX_Iau8AAAAJ:aqlVkmm33-oC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:aqlVkmm33-oC",
        "authors": [
            "Leon Reznik",
            "Michael Negnevitsky"
        ],
        "pub_source": "2002 IEEE World Congress on Computational Intelligence. 2002 IEEE International Conference on Fuzzy Systems. FUZZ-IEEE'02. Proceedings (Cat. No. 02CH37291)",
        "pub_date": "2002/5/12",
        "description": "The paper combines two major neuro-fuzzy applications in power engineering: stabilizing power systems at a generation stage and reducing disturbances at a delivery stage. It presents a neural-fuzzy classifier for recognition of power disturbances and a fuzzy excitation controller comprising both the exciter and the power system stabilizer.",
        "citations": 5
    },
    {
        "title": "Neuro-Fuzzy Control Applications: Looking for New Areas and Techniques?",
        "id": "GX_Iau8AAAAJ:M05iB0D1s5AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:M05iB0D1s5AC",
        "authors": [
            "Leonid Reznik"
        ],
        "pub_source": "Fuzzy Logic: A Framework for the New Millennium",
        "pub_date": "2002/2/26",
        "description": "Nowadays one can witness the development of fuzzy and neuro-fuzzy control systems going in two directions. The first one results in design of more sophisticated systems in traditional application areas such as home appliances, climate control, manufacturing as well as in advancement of the design theoretical knowledge. Another one constitutes an expansion of neuro-fuzzy control into new application fields in both engineering (telecommunications, first but not the least to mention) and non-engineering (business, social sciences) areas. The development of the second direction is very closely tied with an application of fuzzy methodology in data analysis and acquisition. One may note that both directions do not compete but complement each other."
    },
    {
        "title": "A Neural Fuzzy Approach to Modeling the Top Oil Temperature of Power Transformer",
        "id": "GX_Iau8AAAAJ:OU6Ihb5iCvQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:OU6Ihb5iCvQC",
        "authors": [
            "Huy Huynh Nguyen",
            "Juan Shi",
            "Leon Reznik"
        ],
        "pub_source": "Victoria University",
        "pub_date": "2002",
        "description": "This paper presents an application of a new system modeling algorithm using neural fuzzy technique. The model is intended to forecast power transformer temperature characteristics in order to predict its behaviour. The forecast accuracy is compared with the IEEE and Massachusetts Institute of Technology (MIT) models. The real data from an 8000kVA power tranformer have been used for training and testing the models. Results show that the intelligent neural fuzzy model has achieved a better prediction against the IEEE and MIT models.",
        "citations": 1
    },
    {
        "title": "Applications of Neuro-Fuzzy Systems for Recognition and Reduction of Power Disturbances",
        "id": "GX_Iau8AAAAJ:hC7cP41nSMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:hC7cP41nSMkC",
        "authors": [
            "Michael Negnevitsky",
            "LEON REZNIK"
        ],
        "pub_source": "University Of Tasmania",
        "pub_date": "2002/1/1",
        "description": "APPLICATIONS OF NEURO-FUZZY SYSTEMS FOR RECOGNITION AND REDUCTION OF \nPOWER DISTURBANCES MICHAEL NEGNEVITSKY School of Engineering University of \nTasmania GPO Box 252-65, Hobart, Tasmania 7001, Australia LEON REZNIK School of \nCommunications and Informatics Victoria University PO Box 14428 MCMC, Melbourne 8001, \nAustralia Abstract: The paper presents two applications of a neuro- fuzzy system for solving \ncomplex problems in power engineering, the recognition of power quality disturbances and \nthe stability of power generation. The neuro-fuzzy system combines the powerful capability of \nLearning Vector Quantization networks in pattern recognition with the flexibility of the Fuzzy \nAssociative Memory rule- matrix in dealing with uncertainties. The paper also describes results \nof the system evaluation, which demonstrate the high performance of the system. Key Words: …"
    },
    {
        "title": "Fuzzy models in evaluation of information uncertainty in engineering and technology applications",
        "id": "GX_Iau8AAAAJ:Tyk-4Ss8FVUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:Tyk-4Ss8FVUC",
        "authors": [
            "Leon Reznik",
            "Binh Pham"
        ],
        "pub_source": "10th IEEE International Conference on Fuzzy Systems.(Cat. No. 01CH37297)",
        "pub_date": "2001/12/2",
        "description": "The paper studies the problem of information uncertainty evaluation in modern engineering and technology applications, and especially the system design. It analyses the virtual environment design and engineering measurement. Information typical for those applications is classified according to its uncertainty types. Uncertainty sources are identified. Fuzzy theory models are proposed. Examples of their applications in characteristic problems are given.",
        "citations": 10
    },
    {
        "title": "Choice of the radial basis function approximation in neural networks used for fuzzy system implementation",
        "id": "GX_Iau8AAAAJ:NMxIlDl6LWMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:NMxIlDl6LWMC",
        "authors": [
            "Leonid Reznik",
            "A Little"
        ],
        "pub_source": "Proceedings Joint 9th IFSA World Congress and 20th NAFIPS International Conference (Cat. No. 01TH8569)",
        "pub_date": "2001/7/25",
        "description": "The paper investigates the method proposing a fuzzy system implementation through its approximation with neural networks. This method allows an easy and cheap realisation on simple general purpose microprocessors popular with the industry. This paper concentrates on further simplification of realisation by the replacement of Gaussian radius basis function in neural networks with its linear and piecewise linear approximation. Different approximating possibilities are tested on four controllers chosen as benchmarks. The analysis has identified that the Gaussian basis function can be approximated without a significant change of error if the number of neurons is not too small.",
        "citations": 3
    },
    {
        "title": "PID plus fuzzy controller structures as a design base for industrial applications",
        "id": "GX_Iau8AAAAJ:HDshCWvjkbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:HDshCWvjkbEC",
        "authors": [
            "Leonid Reznik",
            "Omar Ghanayem",
            "Anna Bourmistrov"
        ],
        "pub_source": "Engineering applications of artificial intelligence",
        "pub_date": "2000/8/1",
        "description": "This paper investigates the practical ways of designing effective combinations of classical PID controllers and emerging intelligent technologies for real-life industrial projects. It analyses the evolution of fuzzy controller (FC) design methodology. Based on the analysis, structures and methods that combine both approaches are proposed and considered. The paper is not intended to develop a mathematical theory, but to give some practical recommendations on replacing control by a human operator control with fuzzy control, and an on-line parameter tuning of FC parameters. These two main points are illustrated with two application projects, which are studied in greater detail. The first one includes the design of a FC supervising a PID control system in an automatic aircraft guidance system. The second project describes the tuning of the scaling factors of a fuzzy PID-type controller with other fuzzy systems, used in …",
        "citations": 275
    },
    {
        "title": "Implementation of fuzzy controllers with radial basis neural networks",
        "id": "GX_Iau8AAAAJ:YFjsv_pBGBYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:YFjsv_pBGBYC",
        "authors": [
            "Anthony Little",
            "Leonid Reznik"
        ],
        "pub_source": "Ninth IEEE International Conference on Fuzzy Systems. FUZZ-IEEE 2000 (Cat. No. 00CH37063)",
        "pub_date": "2000/5/7",
        "description": "Low cost microprocessors cannot always devote the resources necessary to compute a fuzzy system, and this can be a deterrent in its application. The purpose of this work is to demonstrate that neural networks are a viable form for implementing fuzzy systems in a practical cost effective application. A neural network can be trained to efficiently approximate a fuzzy control surface to a desired degree of accuracy. The paper proposes a neuro-fuzzy synergetic design procedure consisting of a fuzzy controller design and its implementation with a radial basis function neural network. The trade-offs associated with accuracy, speed and processing requirements are addressed, and the realization results are then presented and discussed.",
        "citations": 4
    },
    {
        "title": "MEASUREMENT SCIENCE",
        "id": "GX_Iau8AAAAJ:rO6llkc54NcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:rO6llkc54NcC",
        "authors": [
            "Gennadij N Solopchenko",
            "Vladik Kleinovich",
            "Leonid Reznik",
            "Sergey V Muravyov"
        ],
        "pub_source": "Measurement science: a discussion",
        "pub_date": "2000"
    },
    {
        "title": "Integrating Domain Knowledge With Data: From Crisp To Probabilistic and Fuzzy Knowledge",
        "id": "GX_Iau8AAAAJ:ldfaerwXgEUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ldfaerwXgEUC",
        "authors": [
            "Hung T Nguyen",
            "Vladik Kreinovich",
            "Leonid Reznik"
        ],
        "pub_source": "",
        "pub_date": "2000",
        "description": "It is well known that prior knowledge about the domain can improve (often drastically) the accuracy of the estimates of the physical quantities in comparison with the estimates which are solely based on the measurement results. In this paper, we show how a known method of integrating crisp domain knowledge with data can be (naturally) extended to the case when the domain knowledge is described in statistical or fuzzy terms."
    },
    {
        "title": "What is intelligent measurement?",
        "id": "GX_Iau8AAAAJ:JV2RwH3_ST0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:JV2RwH3_ST0C",
        "authors": [
            "Leonid Reznik"
        ],
        "pub_source": "Computing with Words in Information/Intelligent Systems 1: Foundations",
        "pub_date": "1999/7/16",
        "description": "This paper attempts to look at intelligent measurement as a process of transforming an initial a priori information into a final measurement result. This point of view allows to consider all sorts of information available including quantitative and qualitative (expressed in a linguistic format) and to address measurements applied in rather distant areas like engineering and social sciences. In this case the measurement can be considered as a fuzzy granulation process. The classification of all information commonly utilised in measurements is given. The paper reviews some ways of the current fuzzy logic applications in metrology and measurement technology and proposes new ways based on the development of expert system and their inclusion into measuring instruments.",
        "citations": 8
    },
    {
        "title": "Evaluation of uncertainty in measurement: A proposal for application of intelligent methods",
        "id": "GX_Iau8AAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:9yKSN-GCB0IC",
        "authors": [
            "L Reznik",
            "KP Dabke"
        ],
        "pub_source": "Measurement to Improve Quality of Life in the 21st Century, IMEKO–XV World Congress",
        "pub_date": "1999/6/13",
        "citations": 21
    },
    {
        "title": "Neuro-fuzzy forecasting of tourism to Japan",
        "id": "GX_Iau8AAAAJ:ipzZ9siozwsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ipzZ9siozwsC",
        "authors": [
            "H Fernando",
            "L Reznik",
            "L Turner"
        ],
        "pub_source": "Australian tourism and hospitality research conference, Adelaide, Australia",
        "pub_date": "1999",
        "citations": 2
    },
    {
        "title": "Collected by Didier Dubois, Henri Prade and Salvatore Sessa",
        "id": "GX_Iau8AAAAJ:35N4QoGY0k4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:35N4QoGY0k4C",
        "authors": [
            "L Reznik",
            "V Dimitrov",
            "J Kacprzyk"
        ],
        "pub_source": "Fuzzy Sets and Systems",
        "pub_date": "1999",
        "description": "FG Fernandez, V. Kreinovich, Fuzzy implication can be arbitrarily complicated: a theorem, Internat. J. Intell. Systems 13 (5)(1998) 445-451. J. Fodor, T. Calvo, Aggregation functions defined by tnorms and t-conorms, AFII, pp. 36-48. EP Klement, R. Mesiar, E. Pap, On some geometric transformation of t-norms, Mathware Soft Comput. 5 (1)(1998) 57-67."
    },
    {
        "title": "An application of fuzzy mathematical morphology to interval-valued knowledge representation: A remark",
        "id": "GX_Iau8AAAAJ:k_IJM867U9cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:k_IJM867U9cC",
        "authors": [
            "Antony T Popov",
            "Hung T Nguyen",
            "Leonid K Reznik"
        ],
        "pub_source": "Reliable Computing",
        "pub_date": "1998/8",
        "description": "Mathematical morphology is known by its useful tools for processing binary (black-and-white) and gray-tone images. Due to the success of mathematical morphology in processing binary images, there have been many successful attempts to generalize its methods to more general, i.e. gray-tone images. One of these attempts—the most intuitive one is based on replacing sets by fuzzy sets, thus defining so called fuzzy morphological operations. In this paper we show that these operations can be used successfully in nonimage applications. We can use methods developed in fuzzy mathematical morphology to compute the membership functions of different \"approximate\" statements. Also, an application to interval-valued knowledge representation is given.",
        "citations": 5
    },
    {
        "title": "Fuzzy Systems Design: Social and Engineering Applications; with 21 Tables",
        "id": "GX_Iau8AAAAJ:xtRiw3GOFMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:xtRiw3GOFMkC",
        "authors": [
            "Leonid Reznik",
            "Vladimir Dimitrov",
            "Janusz Kacprzyk"
        ],
        "pub_source": "Springer Science & Business Media",
        "pub_date": "1998/7/20",
        "description": "Fuzzy logic is a way of thinking that is responsive to human zeal to unveil uncertainty and deal with social paradoxes emerging from it. In this book a number of articles illustrate various social applications to fuzzy logic. The engineering part of the book contains a number of papers, devoted to the description of fuzzy engineering design methodologies. In order to share the experience gained we select papers describing not the application result only but the way how this result has been obtained, that is explaining the design procedures. The potential readership of this book includes researchers and students, workers and engineers in both areas of social and engineering studies. It can be used as a handbook and textbook also. The book includes some examples of real fuzzy engineering.",
        "citations": 15
    },
    {
        "title": "Intelligent sensor: an attempt to define",
        "id": "GX_Iau8AAAAJ:ZeXyd9-uunAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ZeXyd9-uunAC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "1998 Second International Conference. Knowledge-Based Intelligent Electronic Systems. Proceedings KES'98 (Cat. No. 98EX111)",
        "pub_date": "1998/4/21",
        "description": "We consider an intelligent measurement as a process of the result development based on all sorts of information which can be used with an application of intelligent technologies and methodologies. In real life systems, applied for control or testing, the measurement results compose only a part of information which is actually available and used for control purposes. An attempt to classify all the information available is given. As any measurement result incorporates some error, it can be considered as a fuzzy granule and a measurement process can be looked at as a fuzzy granulation process.",
        "citations": 2
    },
    {
        "title": "Fuzzy controller design: recommendations to the user",
        "id": "GX_Iau8AAAAJ:UeHWp8X0CEIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:UeHWp8X0CEIC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "1998 Second International Conference. Knowledge-Based Intelligent Electronic Systems. Proceedings KES'98 (Cat. No. 98EX111)",
        "pub_date": "1998/4/21",
        "description": "This paper attempts to analyse and classify different methods of fuzzy control (FC) design. It aims at providing some practical recommendations on how to design a FC and how to choose the right design method. The goal is to develop a more or less systematic procedure of a FC design which can be used as a reference. The design process can be roughly divided into two stages: an initial choice of the controller structures and parameters, and their further adjustment. Recommendations are given at the first stage regarding a choice of the structure, scaling factors, rules and membership functions, though the main attention is focused on the membership functions and scaling factors. Different methodologies, such as neural networks, genetic/evolutionary algorithms, are considered at the second stage.",
        "citations": 20
    },
    {
        "title": "Fuzzy decision making in design on the basis of the hubituality",
        "id": "GX_Iau8AAAAJ:JQOojiI6XY0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:JQOojiI6XY0C",
        "authors": [
            "AE Gorodetsky",
            "L Reznik",
            "V Dimitrov",
            "J Kasprzyk"
        ],
        "pub_source": "Fuzzy System Design, L. Reznik, V. Dimitrov, J. Kasprzyk, Physica Verlag",
        "pub_date": "1998",
        "citations": 6
    },
    {
        "title": "Fuzzy Controller Design for Different Applications: Evolution, Methods, and Practical Recommendations",
        "id": "GX_Iau8AAAAJ:u_35RYKgDlwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:u_35RYKgDlwC",
        "authors": [
            "Leonid Reznik"
        ],
        "pub_source": "Fuzzy Systems Design: Social and Engineering Applications",
        "pub_date": "1998",
        "description": "This paper attempts to classify different approaches applied in a fuzzy controller design until now and develop some general recommendations which could be useful in different applications ranging from engineering to social studies. The author’s goal is to present not a mathematical theory but a procedure explaining some aspects of FC design. The design process is roughly divided into two stages: an initial choice of a controller structure and parameters and their further tuning. At the first stage the recommendations are given regarding the choice of the structure, scaling factors, rules and membership functions, though main attention is paid to membership functions and scaling factors. Different methodologies such as neural networks, genetic/evolutionary algorithms are considered at the second stage.",
        "citations": 1
    },
    {
        "title": "A Universal Approach to Adaptive Fuzzy Logic Controller Design with an Application to a Power Generator Excitation Control",
        "id": "GX_Iau8AAAAJ:J_g5lzvAfSwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:J_g5lzvAfSwC",
        "authors": [
            "Omar Ghanayem",
            "Leonid Reznik"
        ],
        "pub_source": "Fuzzy Systems Design: Social and Engineering Applications",
        "pub_date": "1998",
        "description": "The problem of computerisation of the adaptive fuzzy logic controller design has emerged nowadays as both practical and theoretical one. This paper proposes a universal adaptive fuzzy logic controller (FLC) structure with its application to the excitation control of a synchronous generator connected to an infinite bus through a transmission line. The proposed system features an automatic learning mechanism which enables on-line updating and tuning of the global input and output ranges of the FLC as well as an implicit tuning and updating of the controller classes and rules. The on-line tuning of the controller parameters is achieved via new concepts of fuzzy logic design. These novel concepts have been developed and implemented for the purpose of improving the efficiency of fuzzy learning based on the FLC status and the system performance. The system implementing this universal design approach …"
    },
    {
        "title": "The use of fuzzy national indicators for tourism forecasting",
        "id": "GX_Iau8AAAAJ:ns9cj8rnVeAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ns9cj8rnVeAC",
        "authors": [
            "H Fernando",
            "Leonid Reznik",
            "L Turner"
        ],
        "pub_source": "CAUTHE (8th: 1998: Gold Coast, Qld.)",
        "pub_date": "1998/1",
        "citations": 1
    },
    {
        "title": "Cooperative learning is better: explanation using dynamical systems, fuzzy logic, and geometric symmetries",
        "id": "GX_Iau8AAAAJ:M3NEmzRMIkIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:M3NEmzRMIkIC",
        "authors": [
            "Vladik Kreinovich",
            "Edye Johnson-Holubec",
            "Leonid K Reznik",
            "Misha Kosheleva"
        ],
        "pub_source": "",
        "pub_date": "1998",
        "description": "Cooperative learning is e cient. It is well-known that when students help each other by studying in (well-organized and well-monitored) small groups, then they learn faster and more e ciently than when they study in a (more traditional) individual manner. Cooperative learning is widely spread in Japan, and it has been re-invented and actively used in the USA (see, eg, 4, 5] and references therein).In spite of empirical success of cooperative learning, there are few theoretical explanations. There is a lot of literature on cooperative learning. The corresponding statistics shows that cooperative learning (if properly administered) is indeed better, and provides the empirical recommendations on how to choose the optimal parameters of cooperative learning. For example:",
        "citations": 8
    },
    {
        "title": "Fuzzy controllers handbook: how to design them, how they work",
        "id": "GX_Iau8AAAAJ:u5HHmVD_uO8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:u5HHmVD_uO8C",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Elsevier",
        "pub_date": "1997/8/21",
        "description": "This book teaches you how to design a fuzzy controller and shares the author's experience of design and applications. It is the perfect book for you if you want to know something about fuzzy control and fuzzy controllers, but you are not a mathematician, so what you are really interested in is the design process. As an introduction it assumes no preliminary knowledge of fuzzy theory and technology, but starts at the root of a problem and works from there. TIf you have some experience in fuzzy controller design but are not sure how to choose the number of membership functions, how to shape them properly, or how to debug a fuzzy controller; if you are a beginner with fuzzy logic, and so you would like to know how to apply the theory; if you are researching fuzzy logic or if you need some help with a project at work-this book is for you! The text is designed for use both as a course companion for both teachers and students or for self-study. Leon Reznik has worked on fuzzy logic applications in a huge range of control situations including spacecraft launch control, microprocessor control, and metallurgical furnace control. Latterly he has been teaching in the Department of Electrical and Electronic Engineering at Victoria University of Technology, Australia. His work in the area has generated a substantial volume of papers in both Russian and English. First readable book on the subject Ideal for professionals and students alike This book takes fuzzy logic out of the ivory tower and into the workplace",
        "citations": 736
    },
    {
        "title": "Excitation control of a synchronous generator using an online adaptive fuzzy logic controller structure",
        "id": "GX_Iau8AAAAJ:isC4tDSrTZIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:isC4tDSrTZIC",
        "authors": [
            "Omar Ghanayem",
            "Leonid Reznik"
        ],
        "pub_source": "Proceedings of 6th International Fuzzy Systems Conference",
        "pub_date": "1997/7/5",
        "description": "The paper describes a universal adaptive fuzzy logic controller (FLC) structure with its application to the excitation control of a synchronous generator. The proposed system features an automatic learning mechanism which enables online updating and tuning of the global input and output ranges of the FLC as well as an implicit tuning and updating of the controller classes and rules. The online tuning of the controller parameters is achieved via new concepts of fuzzy logic design. These novel concepts have been developed and implemented for the purpose of improving the efficiency of fuzzy learning based on the fuzzy logic controller status and the system performance. The proposed system has been tested for excitation control on a laboratory setup of a synchronous generator connected to an infinite bus where it has proved efficient and robust under different conditions.",
        "citations": 9
    },
    {
        "title": "Evolution of fuzzy controller design",
        "id": "GX_Iau8AAAAJ:r0BpntZqJG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:r0BpntZqJG4C",
        "authors": [
            "Leonid Reznik"
        ],
        "pub_source": "Proceedings of 6th International Fuzzy Systems Conference",
        "pub_date": "1997/7/5",
        "description": "This paper analyses and classifies different methods of fuzzy controller (FC) design. Not attempting to develop a mathematical theory it aims at providing some practical recommendations on how to design a FC and how to choose the right design method. The goal is to develop a more or less systematic procedure of FC design which can be used as a reference. Evolution of design approaches is analysed. The design process is considered as consisting of two stages: an initial choice of a controller structure and parameters and their further tuning. At the first stage the recommendations are given regarding the choice of the structure, scaling factors, rules and membership functions, though the main attention is paid to membership functions and scaling factors. Different methodologies such as neural networks, genetic/evolutionary algorithms are considered at the second stage.",
        "citations": 23
    },
    {
        "title": "A universal adaptation procedure for fuzzy controller design with the application to power system stability control",
        "id": "GX_Iau8AAAAJ:GnPB-g6toBAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:GnPB-g6toBAC",
        "authors": [
            "Omar Ghanayem",
            "Leonid Reznik"
        ],
        "pub_source": "Proceedings of 35th IEEE Conference on Decision and Control",
        "pub_date": "1996/12/13",
        "description": "This paper proposes a universal adaptive fuzzy logic controller design procedure. This procedure provides explicit adaptation mechanism to tune and update the global input and output ranges of the fuzzy logic controller (FLC) as well as implicitly influences the rule base and the membership functions of the FLC. The adaptation is based on new concepts in evaluating the FLC performance according to some performance monitors taken from the operational environment. The proposed algorithm is tested in the design of an excitation system for a synchronous power generator in which it proved superiority when compared to a conventional excitation system.",
        "citations": 2
    },
    {
        "title": "A novel excitation control scheme: design and implementation",
        "id": "GX_Iau8AAAAJ:vV6vV6tmYwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:vV6vV6tmYwMC",
        "authors": [
            "Omar Ghanayem",
            "Leonid Reznik"
        ],
        "pub_source": "1996 Australian New Zealand Conference on Intelligent Information Systems. Proceedings. ANZIIS 96",
        "pub_date": "1996/11/18",
        "description": "The paper describes an adaptive fuzzy logic controller structure and its implementation in the excitation control of a synchronous generator. The proposed controller applies on-line adaptation and learning in order to explicitly update its global input and output ranges as well as implicitly tune its rule base. The adaptation mechanism used in this scheme is based on a novel fuzzy realisation of the proportional differential controller tailored in a simple but efficient algorithm that manipulates the data collected from the operational environment into a set of updating and tuning signals to be fed back to the plant under control. This mechanism made the proposed controller very robust to operational condition changes."
    },
    {
        "title": "Speech detection method analysis and intelligent structure development",
        "id": "GX_Iau8AAAAJ:hqOjcs7Dif8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:hqOjcs7Dif8C",
        "authors": [
            "Anthony Little",
            "Leon Reznik"
        ],
        "pub_source": "1996 Australian New Zealand Conference on Intelligent Information Systems. Proceedings. ANZIIS 96",
        "pub_date": "1996/11/18",
        "description": "Making a decision about the presence/absence of the speech signal in a noisy environment is a very important problem which must be solved in many application areas including speech recognition. The paper presents a methodology analysis of several algorithms, identifying both their advantages and disadvantages to examine their ability to detect certain properties of speech. From these results, a speech detection system is designed using algorithms which complement each other. The system includes an application of 4th order cumulants and zero crossing methods to determine the presence of speech. The system is then tested up to noise levels of -4 dB while maintaining responsive detection. An adaptive fuzzy rule base is then proposed for implementation and operation under varying environmental conditions.",
        "citations": 6
    },
    {
        "title": "Hybrid Guidance Control for a Self-Piloted Aircraft",
        "id": "GX_Iau8AAAAJ:NhqRSupF_l8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:NhqRSupF_l8C",
        "authors": [
            "A Bourmistrov",
            "L Reznik"
        ],
        "pub_source": "Proceedings for the First International Discourse on Fuzzy Logic and the Management of Complexity",
        "pub_date": "1996/1/15",
        "citations": 2
    },
    {
        "title": "Controller design: the combination of techniques",
        "id": "GX_Iau8AAAAJ:TFP_iSt0sucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:TFP_iSt0sucC",
        "authors": [
            "Leonid Reznik"
        ],
        "pub_source": "Neural Network World",
        "pub_date": "1996",
        "description": "This paper is mainly devoted to practical problems but not to the development of the mathematical theory of design. The paper briefly reviews the design methodologies applied up to date in fuzzy controller design and classifies the design approaches. The design process is roughly divided into two stages: an initial choice of a controller structure and parameters and their further tuning. At the first stage the recommendations are given regarding the choice of the structure, scaling factors, rules and membership functions. Different methodologies such as neural networks, genetic/evolutionary algorithms are considered at the second stage. The ideas about the future development in fuzzy controller design are presented in the conclusion.",
        "citations": 7
    },
    {
        "title": "Fuzzy Controller Design From a Practitioner's Point of View: The Review of Methodologies",
        "id": "GX_Iau8AAAAJ:V3AGJWp-ZtQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:V3AGJWp-ZtQC",
        "authors": [
            "L Reznik",
            "A Little"
        ],
        "pub_source": "Australian Journal of Intelligent Information Processing Systems",
        "pub_date": "1995",
        "citations": 4
    },
    {
        "title": "Fuzzy Controller Design From a Practitioner's Point of View: Membership Function Choice",
        "id": "GX_Iau8AAAAJ:SP6oXDckpogC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:SP6oXDckpogC",
        "authors": [
            "Leonid Reznik",
            "Juan Shi"
        ],
        "pub_source": "Australian Journal of Intelligent Information Processing Systems",
        "pub_date": "1995",
        "citations": 4
    },
    {
        "title": "An Intelligent Control System for Engine Testing: Which Models to Apply?",
        "id": "GX_Iau8AAAAJ:lSLTfruPkqcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:lSLTfruPkqcC",
        "authors": [
            "Michael Selesnew",
            "Leonid Reznik"
        ],
        "pub_source": "Control 95: Meeting the Challenge of Asia Pacific Growth; Preprints",
        "pub_date": "1995/1/1",
        "description": "In order to design an intelligent control system for an engine test system, a compact non-linear dynamic simulation model of the plant is needed. Suitable models of a hydraulic water brake dynamometer and a spark-ignition, four stroke engine are presented in this paper. These models can be linked to form the complete plant model suitable for control system design.  The engine model proposed in this paper allows various engines and configurations to be studied with few input parameter changes. A major advantage of this model is in the ease of implementing different engine configurations by simply specifying a single full throttle torque curve and a number of engine parameters. In this way “paper engines” can be modelled without the necessity of “real engine” tests to ascertain performance parameters."
    },
    {
        "title": "A hybrid AVR-PSS controller based on fuzzy logic technique",
        "id": "GX_Iau8AAAAJ:hMod-77fHWUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:hMod-77fHWUC",
        "authors": [
            "Omar Ghanayem",
            "Leonid Reznik"
        ],
        "pub_source": "Control 95: Meeting the Challenge of Asia Pacific Growth; Preprints",
        "pub_date": "1995/1/1",
        "description": "The paper proposes a hybrid structure for a fuzzy logic based excitation system comprising both the exciter and the power system stabiliser for a synchronous generator connected to an infinite bus through a transmission line. The combined structure is based on some new techniques of educing the most appropriate parameters that can represent the status of the machine. The system considers the speed deviation (Δω) and applies a nonlinear scaling for this parameter based on operational sectors, that can provide scaling as well as phase (sign) to Δω and associated inputs. Operational sectors are described in detail throughout the body of this paper. The terminal voltage error is another factor considered by the system. The performance of the proposed scheme was tested through computer simulation and demonstrated significant improvement over the performance of a conventional excitation system.",
        "citations": 5
    },
    {
        "title": "Fuzzy intervals as a basis for measurement theory",
        "id": "GX_Iau8AAAAJ:iH-uZ7U-co4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:iH-uZ7U-co4C",
        "authors": [
            "Gennady N Solopchenko",
            "Leonid K Reznik",
            "W Carroll Johnson"
        ],
        "pub_source": "NAFIPS/IFIS/NASA'94. Proceedings of the First International Joint Conference of The North American Fuzzy Information Processing Society Biannual Conference. The Industrial Fuzzy Control and Intellige",
        "pub_date": "1994/12/18",
        "description": "We describe the problem of error estimation for indirect measurements, one of the main problems of measurement theory. We show why statistical approach is not always adequate, why interval and fuzzy approaches have their own problem, and propose a new paradigm: using fuzzy intervals as a basis for measurement theory.< >",
        "citations": 18
    },
    {
        "title": "Hierarchical versus adaptive fuzzy logic controllers: design and performance",
        "id": "GX_Iau8AAAAJ:NaGl4SEjCO4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:NaGl4SEjCO4C",
        "authors": [
            "O Ghanayem",
            "L Reznik"
        ],
        "pub_source": "Proceedings of ANZIIS'94-Australian New Zealnd Intelligent Information Systems Conference",
        "pub_date": "1994/11/29",
        "description": "The paper compares two fuzzy logic controller structures from the view points of design difficulty and performance. The design procedures for an adaptive self tuning fuzzy logic controller and a hierarchical controller are described. The comparison between their design complications and performance has been made on two examples.< >",
        "citations": 5
    },
    {
        "title": "Mapping alpha-cut borders: classification and PID realization",
        "id": "GX_Iau8AAAAJ:SeFeTyx0c_EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:SeFeTyx0c_EC",
        "authors": [
            "L Reznik",
            "A Stoica"
        ],
        "pub_source": "Proceedings of 1994 IEEE 3rd International Fuzzy Systems Conference",
        "pub_date": "1994/6/26",
        "description": "A new method for fuzzy processing mapping alpha-cut borders was previously introduced (Stoica,1993) and demonstrated on a control problem. The authors investigate here some relations with other processing methods. Different variations of the method are discussed in terms of general properties of fuzzy controllers. The possibility of implementing classic PID, controllers with this method is demonstrated.< >",
        "citations": 5
    },
    {
        "title": "editors: Hall Larry, Ying Hao, Langari Reza, Yen John.-Proc 1994 1 Int Jt Conf NAFIPS IFIS NASA.-Сер. Proc 1994 1 Int Jt Conf NAFIPS IFIS NASA",
        "id": "GX_Iau8AAAAJ:j8SEvjWlNXcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:j8SEvjWlNXcC",
        "authors": [
            "GN Solopchenko",
            "LK Reznik",
            "WC Johnson"
        ],
        "pub_source": "",
        "pub_date": "1994"
    },
    {
        "title": "Simulation study of the choice of a membership function model for control applications",
        "id": "GX_Iau8AAAAJ:kRWSkSYxWN8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:kRWSkSYxWN8C",
        "authors": [
            "Leon Reznik",
            "Juan Shi"
        ],
        "pub_source": "Second International Conference on Modelling and Simulation: MS'93: Melbourne, Australia, 12-14 July, 1993:\" modelling and simulation: keys to technological advances\": proceedings",
        "pub_date": "1993",
        "citations": 2
    },
    {
        "title": "Some Tricks in Fuzzy Controller design",
        "id": "GX_Iau8AAAAJ:maZDTaKrznsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:maZDTaKrznsC",
        "authors": [
            "L Reznik",
            "A Stoica"
        ],
        "pub_source": "Proceedings of Australia and new Zealand Conference on Intelligent information systems,\" ANZIIS-93-IEEE conference, Perth, Western Australia",
        "pub_date": "1993",
        "citations": 7
    },
    {
        "title": "Gaussian membership functions are most adequate in representing uncertainty in measurements",
        "id": "GX_Iau8AAAAJ:R3hNpaxXUhUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:R3hNpaxXUhUC",
        "authors": [
            "V Kreinovich",
            "Ch Quintana",
            "L Reznik"
        ],
        "pub_source": "Proceedings of NAFIPS",
        "pub_date": "1992/12/15",
        "description": "In rare situations like fundamental physics we perform experiments without knowing what their results will be. In the majority of real-life measurement situations, we more or less know beforehand what kind of results we will get. Of course, this is not the precise knowledge of the type\\the result will be between a? and a+\", because in this case, we would not need any measurements at all. This is usually a knowledge that is best represented in uncertain terms, like\\perhaps (or\\most likely\", etc.) the measured value x is between a? and a+\".Traditional statistical methods neglect this additional knowledge and process only the measurement results. So it is desirable to be able to process this uncertain knowledge as well. A natural way to process it is by using fuzzy logic. But there is a problem: we can use di erent membership functions to represent the same uncertain statements, and di erent functions lead to di erent results. What membership function to choose?",
        "citations": 99
    },
    {
        "title": "Inverse problems: fuzzy representation of uncertainty generates a regularization",
        "id": "GX_Iau8AAAAJ:_Qo2XoVZTnwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:_Qo2XoVZTnwC",
        "authors": [
            "V Kreinovich",
            "Ching-Chuang Chang",
            "L Reznik",
            "GN Solopchenko"
        ],
        "pub_source": "NASA. Johnson Space Center, North American Fuzzy Logic Processing Society (NAFIPS 1992), Volume 2",
        "pub_date": "1992/12/1",
        "description": "In many applied problems (geophysics, medicine, and astronomy) we cannot directly measure the values x(t) of the desired physical quantity x in different moments of time, so we measure some related quantity y(t), and then we try to reconstruct the desired values x(t). This problem is often ill-posed in the sense that two essentially different functions x(t) are consistent with the same measurement results. So, in order to get a reasonable reconstruction, we must have some additional prior information about the desired function x(t). Methods that use this information to choose x(t) from the set of all possible solutions are called regularization methods. In some cases, we know the statistical characteristics both of x(t) and of the measurement errors, so we can apply statistical filtering methods (well-developed since the invention of a Wiener filter). In some situations, we know the properties of the desired process, e.g., we know that the derivative of x(t) is limited by some number delta, etc. In this case, we can apply standard regularization techniques (e.g., Tikhonov's regularization). In many cases, however, we have only uncertain knowledge about the values of x(t), about the rate with which the values of x(t) can change, and about the measurement errors. In these cases, usually one of the existing regularization methods is applied. There exist several heuristics that choose such a method. The problem with these heuristics is that they often lead to choosing different methods, and these methods lead to different functions x(t). Therefore, the results x(t) of applying these heuristic methods are often unreliable. We show that if we use fuzzy logic to describe this …",
        "citations": 19
    },
    {
        "title": "What non-linearity to choose? Mathematical foundations of fuzzy control",
        "id": "GX_Iau8AAAAJ:TQgYirikUcIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:TQgYirikUcIC",
        "authors": [
            "Vladik Kreinovich",
            "Chris Quintana",
            "R Lea",
            "Olac Fuentes",
            "Anatole Lokshin",
            "Sundeep Kumar",
            "Inna Boricheva",
            "Leonid Reznik"
        ],
        "pub_source": "Proceedings of the 1992 International Conference on Fuzzy Systems and Intelligent Control, Louisville, KY",
        "pub_date": "1992/3",
        "description": "Fuzzy control is a very successful way to transform the expert’s knowledge of the type “if the velocity is big and the distance from the object is small, hit the brakes and decelerate as fast as possible” into an actual control. To apply this transformation one must:1) choose fuzzy variables corresponding to words like “small”,“big”; 2) choose operations corresponding to “and” and “or”; 3) choose a method that transforms the resulting fuzzy variable for a into a single value a.",
        "citations": 78
    },
    {
        "title": "On the dynamics of fuzzy discrete-time systems",
        "id": "GX_Iau8AAAAJ:ZHo1McVdvXMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:ZHo1McVdvXMC",
        "authors": [
            "GS Britov",
            "LK Reznik"
        ],
        "pub_source": "Avtomatika i Telemekhanika",
        "pub_date": "1987",
        "description": "The dynamics of state values and fuzziness in fuzzy dynamic systems is studied. A number of conditions are proposed for straightforward stability test of fuzzy systems where the fuzziness is expressed as an approximate equality. The stability of fuzzy systems is shown to depend on the system structure."
    },
    {
        "title": "Methods and models of formalizing prior information (on the example of processing measurements results)",
        "id": "GX_Iau8AAAAJ:4JMBOYKVnBMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:4JMBOYKVnBMC",
        "authors": [
            "V Kreinovich",
            "LK Reznik"
        ],
        "pub_source": "Analysis and formalization of computer experiments, Proceedings of Mendeleev Metrology Institute, Leningrad",
        "pub_date": "1986",
        "citations": 15
    },
    {
        "title": "The use of fuzzy information for improving the accuracy of the estimation of measured quantities(Ispol'zovanie nechetkoi informatsii dlia povysheniia tochnosti otsenok …",
        "id": "GX_Iau8AAAAJ:RYcK_YlVTxYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:RYcK_YlVTxYC",
        "authors": [
            "LK REZNIK"
        ],
        "pub_source": "Avtometriia",
        "pub_date": "1985/7",
        "description": "The paper examines the problem of improving the accuracy of estimates obtained on the basis of measurements through the use of fuzzy a priori information. The formulation and solution of the problem are given; the properties of the estimates obtained are analyzed; and practical recommendations on the use of the proposed approach in computerized measurement and testing systems are presented. (B.J.)"
    },
    {
        "title": "Use of priori information on functional relations between measured quantities for improving accuracy of measurement",
        "id": "GX_Iau8AAAAJ:RHpTSmoSYBkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:RHpTSmoSYBkC",
        "authors": [
            "LK Reznik",
            "GN Solopchenko"
        ],
        "pub_source": "Measurement",
        "pub_date": "1985/7/1",
        "description": "Methods of using a priori data on the functional relationships between measured quantities are considered in order to avoid serious mistakes and improve the accuracy of measurement. Three basic forms of representation - probability theory, fuzzy set theory and well defined equations - are analysed. Basic relationships are derived and examples given.",
        "citations": 22
    },
    {
        "title": "Instrumentation for the 21 st Century",
        "id": "GX_Iau8AAAAJ:Tiz5es2fbqcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:Tiz5es2fbqcC",
        "authors": [
            "M Krauss",
            "S Nahmias",
            "ON Novoselov",
            "AF Fomin",
            "SM Persin",
            "IK Petrov",
            "LK Reznik",
            "EI Shushkov",
            "MB Tsodikov",
            "NI Seregina",
            "GN Solopchenko",
            "IB Chelpanov",
            "AN Tikhonov",
            "V Yu Arsenin",
            "MP Tsapenko",
            "H Yoshida",
            "LA Zadeh",
            "MA Zemelman"
        ],
        "pub_source": "Measurement",
        "pub_date": "1985/4",
        "description": "Organised by the Instrument Society of America, member organisation of IMEKO in the United States of America, and co-sponsored by the National Bureau of Standards of the US Department of Commerce. Held in conjunction with ISA/88, the 43rd Annual Conference and Exhibition of the Instrument Society of America. Plenary sessions, technical sessions, poster sessions and round table discussions will be held on the following topics of special interest:"
    },
    {
        "title": "Optimal control of linear fuzzy systems",
        "id": "GX_Iau8AAAAJ:bEWYMUwI8FkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:bEWYMUwI8FkC",
        "authors": [
            "GS Britov",
            "LK Reznik"
        ],
        "pub_source": "Avtomatika i Telemekhanika",
        "pub_date": "1981",
        "description": "The paper is concerned with the problem of optimal control of a fuzzy system with a fuzzy criterion of the exponential type. Fuzziness is of the type of approximate equality with a membership function of the Gaussian curve type. The solution method is illustrated by an instrument test system.",
        "citations": 9
    },
    {
        "title": "Permission-based Security Evaluation System for Android Applications",
        "id": "GX_Iau8AAAAJ:WA5NYHcadZ8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:WA5NYHcadZ8C",
        "authors": [
            "Parin Shah",
            "Leon Reznik"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "With the increasing demand of the usage of mobile applications, the threat these applications possess to the users has also increased tremendously. There are various ways through which the application tries to obtain personal information from the users without their consent. One of the way of attacking the user by permissions. When a user downloads an application, he or she has an option to either accept all or none. This project aims at finding malicious applications from the good ones and help the user decide if he or she should or should not download the application. The main concentration in this project is on Android applications. Two approaches are shown in order to obtain the desired results."
    },
    {
        "title": "Information-Theoretic Estimates of Classical and Quantum Communication and Processing at Nanoscale",
        "id": "GX_Iau8AAAAJ:dshw04ExmUIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:dshw04ExmUIC",
        "authors": [
            "SE Lyshevski",
            "L Reznik"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Nanotechnology resulted in new communication and processing paradigms. While conventional communication, computing and processing are supported by nanoscaled digital systems, quantum-centric computing, communication and processing are emerged. This paper reports fundamental, applied and experimental multidisciplinary findings in information technologies, computer science and quantum optoelectronics as applied to sensing, communication and processing. We contribute to consistent, cohesive and coherent premises of quantum-classical and quantum information theory. Our results and findings enable practical technological solutions as applied towards new sensing paradigms, communication platforms and processing schemes. We enable areas of a critical importance and significance, such as, quantum processing, image processing, biotechnology, neurophotonics, etc."
    },
    {
        "title": "TUNING WITH THE APPLICATION TO POWER SYSTEM EXCITATION CONTROL",
        "id": "GX_Iau8AAAAJ:3s1wT3WcHBgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:3s1wT3WcHBgC",
        "authors": [
            "Omar Ghanayem Leonid Reznik"
        ],
        "pub_source": "",
        "pub_date": ""
    },
    {
        "title": "Seventh IFSA World Congress, Prague 1997",
        "id": "GX_Iau8AAAAJ:HoB7MX3m0LUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:HoB7MX3m0LUC",
        "authors": [
            "FUZZY CONTROLLER DESIGN"
        ],
        "pub_source": "",
        "pub_date": ""
    },
    {
        "title": "Intelligent Signal Change Detection in Sensor Networks: Which Learning Technique Is More Efficient?",
        "id": "GX_Iau8AAAAJ:qUcmZB5y_30C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:qUcmZB5y_30C",
        "authors": [
            "James L King",
            "Leon Reznik"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The paper provides sensor network designers and engineers with recommendations on the choice of machine learning techniques, in particular based on artificial neural networks (ANN), for signal change detection, which could be used for improving sensor network efficiency and reliability. It describes the results of the experimental study that explored the performance of detection structures over a wide range of parameter variations. The rates of successful change detections and false negatives are investigated for each change detection system for various signal noise levels, network training times, and detection threshold values. The novel ANN topologies tested will aid engineers in improving sensor network efficiency by reducing the computational costs of accurate sensor signal prediction. The experiments are conducted on a base station with six simulated sensor nodes."
    },
    {
        "title": "Joshua Alan Harlow",
        "id": "GX_Iau8AAAAJ:IWHjjKOFINEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:IWHjjKOFINEC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "Rochester Institute of Technology, 0",
        "pub_date": "",
        "description": "Efficient and effective data classification is one of the most fundamental problems of computer science due to a huge number of important applications. As such, there have been many models that are capable of doing some form of data classification using a large number of varied algorithms and architectures. However, few share properties that implicitly take advantage of the distributed environment where classification has its most potential. Therefore, to resolve this dilemma in this thesis a generic classification architecture composed of mutually adaptive distributed heterogeneous agents was designed, implemented and experimentally analyzed. The system defined creates a multi-agent distributed architecture whereby individual agents cooperate and collaborate with each other to autonomously perform classification on arbitrary data using a hierarchical paradigm. The main contributions of this work are the …"
    },
    {
        "title": "Use of Fuzzy Association Information for Uncertainty Evaluation in Heterogeneous Sensor Networks",
        "id": "GX_Iau8AAAAJ:L8Ckcad2t8MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:L8Ckcad2t8MC",
        "authors": [
            "Leon Reznik"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The paper considers the problem of measurement information fusion from different sources, when one of the sources provides extra information about approximate values of the measured variables or their network associations. Fuzzy models are applied to describe information about the sensor associations and the methods of their application are considered. The properties of the modified estimates are studied in comparison with the conventional ones. The conditions when an extra information application can give a high gain are derived, the gain value is estimated, the practical recommendations are given."
    },
    {
        "title": "Security of Computer Use Practice",
        "id": "GX_Iau8AAAAJ:7PzlFSSx8tAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:7PzlFSSx8tAC",
        "authors": [
            "Leon Reznik",
            "Vincent J Buccigrossi III",
            "Justin Lewis",
            "Asif Dipon",
            "Stefanie Milstead",
            "Nathan LaFontaine",
            "Kenneth Beck",
            "Holden Silvia"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "While numerous surveys in regards to computer security are conducted by organizations in order to study the behavior of their employees and users, the most influential in determining the security of general computer environment group of ordinary users is still lacking in attention. This paper presents the survey results of more than 3,000 computer users who participated in a survey conducted in 2010-2011 by Prof. Reznik’s students at RIT. They researched the practice of home computer users including the passwords used, patching regularity, firewalls and anti-virus software application. The samples of results are analyzed and presented here. They may be utilized for improving overall computer security as well as for the education of users."
    },
    {
        "title": "Embedded Smart Controller for an Industrial Reefer Refrigeration",
        "id": "GX_Iau8AAAAJ:QIV2ME_5wuYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=GX_Iau8AAAAJ:QIV2ME_5wuYC",
        "authors": [
            "Leon Reznik",
            "Shane Spiteri"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The paper describes the development of a smart embedded fuzzy system for reefer refrigeration control. The goal of this project is twofold: to design an efficient and economically feasible intelligent industrial controller on one hand and to test and further develop a smart device design approach, which is based on design model formulation with the fuzzy rules given by an expert. Through prototyping and implementation on a generalpurpose microprocessor the system can then be tested and used to iteratively identify and control the plant until the desired control system criteria are achieved. The paper describes the design, implementation and testing of an embedded fuzzy controller as a simple, practical solution to a regulation problem in reefer refrigeration systems. By an application of the Motorola HC12 MCU with its inbuilt fuzzy logic instruction set a rapid prototype design was implemented and the application of fuzzy logic and iterative identification and control to general industrial refrigeration systems was found to be a possible economically feasible solution."
    }
]