[
    {
        "title": "Experiencing wellbeing and life satisfaction through gastronomy tourism",
        "id": "P1Zu0ZsAAAAJ:geHnlv5EZngC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:geHnlv5EZngC",
        "authors": [
            "Muhammet Kesgin"
        ],
        "pub_source": "Handbook of Tourism and Quality-of-Life Research II: Enhancing the Lives of Tourists, Residents of Host Communities and Service Providers",
        "pub_date": "2023/9/24",
        "description": "Eating, drinking and traveling experiences—also known as gastronomic, food or culinary tourism—is a popular leisure pursuit. Consumers, businesses and destinations capitalize on the benefits of this popular activity. As such, gastronomy tourism has received increasing scholarly attention during the last decade. This chapter focuses on the links between gastronomy tourism experience and wellbeing. Researchers have shown an increased interest in studying wellbeing in gastronomy tourism in recent years. The chapter provides an overview of the existing peer-reviewed literature on gastronomy tourism and wellbeing. The review summarizes the different approaches used to measure wellbeing, quality of life or life satisfaction in gastronomy tourism research. The review offers a bibliographic resource for scholarly, managerial, and policy actors interested in issues dealing with wellbeing and quality of life in …",
        "citations": 2
    },
    {
        "title": "Gastro-tourism well-being: the interplays of salient and enduring determinants",
        "id": "P1Zu0ZsAAAAJ:08ZZubdj9fEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:08ZZubdj9fEC",
        "authors": [
            "Muhammet Kesgin",
            "İrfan Önal",
            "Ihsan Kazkondu",
            "Muzaffer Uysal"
        ],
        "pub_source": "International Journal of Contemporary Hospitality Management",
        "pub_date": "2022/8/24",
        "description": "PurposeThe purpose of this study is to develop and test an integrated structural gastro-tourism wellbeing model consisting of food-related lifestyle and leisure attitude as a precursor of the consumption enjoyment of the gastro-tourism experience with satisfaction, life domain outcomes, tourism autobiographical memory and life satisfaction as outcomes of the consumption enjoyment.Design/methodology/approachThe conceptual model was assessed with quantitative data collected from tourists based on their deliberate and incidental gastro-tourism experiences (N = 617).FindingsThe findings indicated that the enjoyment of gastro-tourism consumption experience significantly influences satisfaction, life domain outcomes, life satisfaction and tourism autobiographical memory. Life domain outcomes and tourism autobiographical memory have enduring influence on life satisfaction over time. Food-related lifestyle and …",
        "citations": 22
    },
    {
        "title": "Effects of religiosity and travel desire on COVID-19 vaccination intentions",
        "id": "P1Zu0ZsAAAAJ:K3LRdlH-MEoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:K3LRdlH-MEoC",
        "authors": [
            "Muhammet Kesgin",
            "Ali Selcuk Can",
            "Dogan Gursoy",
            "Yuksel Ekinci",
            "Khaled Aldawodi"
        ],
        "pub_source": "Current Issues in Tourism",
        "pub_date": "2022/1/22",
        "description": "Despite the deadly consequences of the COVID-19 pandemic, vaccine hesitation remains a threat to public health and international travel. This study tests the effect of Muslim religiosity on belief-based attitudes (i.e. subjective norms, perceived behavioural control) and travel desire as a proxy for COVID-19 vaccination intentions. The structural model was tested using PLS-SEM with the data collected via a self-administrated survey between April and June 2021 in Saudi Arabia (N = 759). Results reveal that travel desire along with belief-based attitudes influences COVID-19 vaccination intentions. Intrinsic religiosity influences individuals’ subjective norms, directly and perceived behavioural control and COVID-19 vaccination intentions indirectly through attitudes and subjective norms. Extrinsic religiosity influences individuals’ subjective norms and travel desire directly, as well as COVID-19 vaccination intentions …",
        "citations": 13
    },
    {
        "title": "Profiling food festivals by type, name and descriptive content: A population level study",
        "id": "P1Zu0ZsAAAAJ:uWQEDVKXjbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:uWQEDVKXjbEC",
        "authors": [
            "Muhammet Kesgin",
            "Rajendran Murthy",
            "Rick Lagiewski"
        ],
        "pub_source": "British Food Journal",
        "pub_date": "2022/1/14",
        "description": "PurposeThis research aims to classify and describe food festivals and examine the patterns in food festival naming and festival descriptions in online media.Design/methodology/approachThis research represents the first population-level empirical examination of food festivals in the United States using a purpose-built dataset (N = 2,626). Methodology includes text mining to examine food festival communications.FindingsFood festival size varies across local and regional spheres within the country. Food festivals employ geographical (place-, destination-based) associations in their names. Food festivals' descriptions and online communications showcase a welcoming environment predominantly emphasizing family-oriented and live entertainment experiences. Food festivals across the country show common naming patterns based on the elements of longevity, recurrence, location name, brand name, geographic …",
        "citations": 14
    },
    {
        "title": "Brand personality of Balikesir province as a destination: Analysis of Wikipedia contents",
        "id": "P1Zu0ZsAAAAJ:vRqMK49ujn8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:vRqMK49ujn8C",
        "authors": [
            "Gizem Ozgurel",
            "Muhammet Kesgin",
            "Cevdet Avcikurt"
        ],
        "pub_source": "University of South Florida (USF) M3 Publishing",
        "pub_date": "2022",
        "description": "In tourism, it is extremely important to benefit from information technologies and web pages in order to achieve the management and marketing goals of destinations, to create awareness, information and convenience in the purchasing preferences of potential tourists who constitute the target groups. In channels with open-source features such as Wikipedia, page visitors with the potential to become tourists are provided with the opportunity to access all kinds of information about destinations and learn what destinations promise. The content created on Wikipedia is enriched with information added by users, and the perception of destination brand personality created with the support of relevant public institutions and academics offers the advantage of increasing the loyalty of tourism stakeholders, especially potential tourists. In this study, by taking into account the brand personality model of Aaker in Wikipedia, an …"
    },
    {
        "title": "A cross-country analysis of the determinants of customer recommendation intentions for over-the-top (OTT) platforms",
        "id": "P1Zu0ZsAAAAJ:KxtntwgDAa4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:KxtntwgDAa4C",
        "authors": [
            "Anish Yousaf",
            "Abhishek Mishra",
            "Babak Taheri",
            "Muhammet Kesgin"
        ],
        "pub_source": "Information & Management",
        "pub_date": "2021/12/1",
        "description": "Using data from India and the USA, this research expands the expectation–confirmation model (ECM) to include constructs like neutral confirmation, customer-to-customer (C2C) interactions and perceived content quality as antecedents to perceived enjoyment, perceived usefulness, user satisfaction, continuance, and recommendation intentions. Across both countries, except for the influence of C2C interactions on perceived enjoyment and of perceived usefulness on recommendation intentions, the remaining hypotheses are supported. There are cross-country differences in the magnitude of the paths from neutral confirmation and C2C interactions to perceived usefulness, and of paths from perceived enjoyment and satisfaction to continuance intentions.",
        "citations": 67
    },
    {
        "title": "Making memories: a consumer-based model of authenticity applied to living history sites",
        "id": "P1Zu0ZsAAAAJ:P5F9QuxV20EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:P5F9QuxV20EC",
        "authors": [
            "Muhammet Kesgin",
            "Babak Taheri",
            "Rajendran S Murthy",
            "Juilee Decker",
            "Martin Joseph Gannon"
        ],
        "pub_source": "International Journal of Contemporary Hospitality Management",
        "pub_date": "2021/10/20",
        "description": "PurposeUnderpinned by the consumer-based model of authenticity (CBA), this study aims to investigate whether leisure involvement, object-based and existential authenticity, host sincerity and engagement stimulate positive memorable visitor experiences in a distinctive commercial hospitality setting: a living history site.Design/methodology/approachQuantitative data were gathered from living history site visitors (n = 1,004), with partial least squares structural equation modeling used to test the hypothesized relationships.FindingsThe results confirm the inclusion of the hypothesized relationships between leisure involvement, sincerity and authenticity, relative to engagement and subsequent memorability. The findings suggest that engagement can be a predictor of a positive memorable experience, contingent on CBA constructs (sincerity; object-based authenticity; existential authenticity). The significant association …",
        "citations": 19
    },
    {
        "title": "RIT Digital Institutional Repositor y",
        "id": "P1Zu0ZsAAAAJ:8AbLer7MMksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:8AbLer7MMksC",
        "authors": [
            "Muhammet Kesgin",
            "Babak Taheri",
            "Rajendran S Murthy",
            "Juilee Decker",
            "Martin Joseph Gannon"
        ],
        "pub_source": "",
        "pub_date": "2021/7/25",
        "description": "Purpose–This research developed and tested an integrated structural gastro-tourism well-being model consisting of food-related lifestyle and leisure attitude as precursor of the consumption enjoyment of the gastro-tourism experience with satisfaction, life domain outcomes, tourism autobiographical memory and life satisfaction as outcomes of the consumption enjoyment.Design/methodology/approach–The conceptual model was assessed with quantitative data collected from tourists based on their deliberate and incidental gastro-tourism experiences (N= 617).Findings–Findings indicated that enjoyment of gastro-tourism consumption experience significantly influences satisfaction, life domain outcomes, life satisfaction, and tourism autobiographical memory. Life domain outcomes and tourism autobiographical memory have enduring influence on life satisfaction over time. Food-related lifestyle and leisure attitude …"
    },
    {
        "title": "Visitors’ perceived trust in sincere, authentic, and memorable heritage experiences",
        "id": "P1Zu0ZsAAAAJ:D03iK_w7-QYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:D03iK_w7-QYC",
        "authors": [
            "Babak Taheri",
            "Martin Joseph Gannon",
            "Muhammet Kesgin"
        ],
        "pub_source": "The Service Industries Journal",
        "pub_date": "2020/7/26",
        "description": "The success of cultural destinations often centres on whether consumers trust the provenance and integrity of the heritage assets, activities, and services therein. However, few studies examine whether this ‘perceived trust’ influences the authenticity, sincerity, and memorability of cultural heritage consumption. To investigate the relationships between these constructs, we surveyed 320 visitors to Iranian cultural heritage sites. The findings suggest that perceived trust positively influences visitors’ perceptions of sincerity, existential authenticity, and object-based authenticity, stimulating memorable experiences in the process. This, in turn, emphasises the antecedent importance of perceived trust in shaping consumption. In the face of increasing commercialisation within the cultural heritage sector more generally, we therefore encourage practitioners to prioritise safeguarding the integrity of their offerings, promoting …",
        "citations": 60
    },
    {
        "title": "What motivates and satisfies lodging employees in Riyadh, Saudi Arabia?",
        "id": "P1Zu0ZsAAAAJ:NhqRSupF_l8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:NhqRSupF_l8C",
        "authors": [
            "Muhammet Kesgin",
            "Yu-Chin Hsieh",
            "Abdulaziz Alqusayer"
        ],
        "pub_source": "Journal of Human Resources in Hospitality & Tourism",
        "pub_date": "2020/7/2",
        "description": "The hotel industry relies on motivated employees to deliver quality service. The diversity of the labor force employed at hotels in Saudi Arabia makes it difficult to motivate and satisfy employees. This study extends previous studies by investigating the factors that motivate and satisfy hotel employees in Riyadh, Saudi Arabia. Good wages, job security, and opportunities for advancement and development are the three most important motivators. Hotel employees in Riyadh are satisfied with their work accomplishment, location of the hotel, and work shifts but are dissatisfied with the workload and the pay they receive. Implications of the study are discussed.",
        "citations": 3
    },
    {
        "title": "Residents as destination advocates: the role of attraction familiarity on destination image",
        "id": "P1Zu0ZsAAAAJ:g5m5HwL7SMYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:g5m5HwL7SMYC",
        "authors": [
            "Muhammet Kesgin",
            "Rajendran S Murthy",
            "Linden W Pohland"
        ],
        "pub_source": "Journal of Hospitality and Tourism Insights",
        "pub_date": "2019/4/16",
        "description": "PurposeEmphasizing the role of residents as destination advocates, the purpose of this paper is to investigate the influence of residents’ familiarity with, and, favorability of attractions on destination image.Design/methodology/approachA mixed methods research strategy was employed using 15 individual in-depth interviews and a survey questionnaire with a sample of n=364. The study utilizes an attraction familiarity index to classify respondents into four groups based on high, average, and low familiarity and examines the characteristics of each in the relationship between informational familiarity, experiential familiarity, and favorability and destination image.FindingsThe study reveals resident perceptions of attractions within the tourism product assembly framework and illustrates the positive relationship between the residents’ level of familiarity with, and favorability of visitor attractions and destination image …",
        "citations": 34
    },
    {
        "title": "Consumer engagement: the role of social currency in online reviews",
        "id": "P1Zu0ZsAAAAJ:2P1L_qKh6hAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:2P1L_qKh6hAC",
        "authors": [
            "Muhammet Kesgin",
            "Rajendran S Murthy"
        ],
        "pub_source": "The Service Industries Journal",
        "pub_date": "2018/12/5",
        "description": "We explore the interplay between social currency (SC) and consumer engagement on social networks. We use text analyses based on both human coding and machine learning asisted sentiment analysis on reviews collected from Facebook pages, and we show that SC has a positive effect on ratings and visitor loyalty. First, we find that attractions have varying makeup of SC as represented in the six dimensions of SC. Second, repeat visits increase SC. Third, SC positively impacts revisit intentions even in the absence of prior experience. We also find that prior experience does not appear to yield better ratings, however, it predicts revisit intentions. This study represents the first use of SC in the tourism domain. Theoretical and practical implications alongside limitations and future research are discussed.",
        "citations": 55
    },
    {
        "title": "Hotels as critical hubs for destination disaster resilience: An analysis of hotel corporations’ CSR activities supporting disaster relief and resilience",
        "id": "P1Zu0ZsAAAAJ:vV6vV6tmYwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:vV6vV6tmYwMC",
        "authors": [
            "Sarah Dobie",
            "Jennifer Schneider",
            "Muhammet Kesgin",
            "Rick Lagiewski"
        ],
        "pub_source": "Infrastructures",
        "pub_date": "2018/10/18",
        "description": "Disaster management has begun to examine the unique role of the private sector in disaster relief. The hotel and lodging industry is an especially critical infrastructure for community disaster relief and resilience, providing many lifeline services in addition to core skills and competencies contributing to the community’s social and human capital. Social and human capital empower the community to better cope with disturbance, and companies’ efforts to build social and human capital are often tied to their corporate social responsibility (CSR) management systems. A framework was developed to evaluate the management system maturity of the hotel and lodging industry’s CSR management for disaster relief and resilience. An analysis of three hotel and lodging corporations was performed to understand the current state of the industry. While many hotel properties are engaging in CSR activities during disaster relief, the analysis revealed that corporate management systems have room for maturation and growth to support the resilience of their community.",
        "citations": 29
    },
    {
        "title": "Do Tourists Change Their International Travel Plans in Times of Terror?",
        "id": "P1Zu0ZsAAAAJ:lSLTfruPkqcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:lSLTfruPkqcC",
        "authors": [
            "Muhammet Kesgin",
            "Linden W Pohland"
        ],
        "pub_source": "",
        "pub_date": "2018",
        "description": "Tourism supply and demand is sensitive to disruptions, which can cause changes in tourist perceptions of risk, induce fear, and impact tourist behavior (Fennell, 2017; Sönmez and Graefe, 1998). The increasing number of disruptions creates concern among current and future international travelers and impacts the tourism industry. International tourism movement perhaps, more than anything else, relies on the assumptions of a predictable, safe, and good world. Although tourist movement is not free from constraints, uncertainties, worries, fear, and risks, disruptions caused by terrorist attacks have unprecedented consequences for both tourists and destinations as they inhibit tourists intending to travel to a recently terrorized destination. Within this framework, the following research questions are put forth:"
    },
    {
        "title": "Pricing determinants in hotels: The case of luxury, upscale, and mid-scale price segments",
        "id": "P1Zu0ZsAAAAJ:35N4QoGY0k4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:35N4QoGY0k4C",
        "authors": [
            "L Pohland",
            "M Kesgin"
        ],
        "pub_source": "Journal of Revenue and Pricing Management",
        "pub_date": "2017/11/10",
        "description": "Investigating the role of pricing and revenue management is a continual concern as successful businesses rely on sound financial management. This paper examines the pricing objectives, strategy determinants, and strategies employed by hotels while taking managerial concerns into account. The study determines managers’ key pricing concerns and investigates value-informed pricing strategies, making comparisons against the findings of past research to address calls for further investigations. Employing an embedded mixed methods research approach, the study used structured questionnaires and semistructured interviews to gather data from hotel managers influential in price setting. Overall, the study indicates similarities and differences in price determination factors in the hotel industry. Formality in determining prices suggests that pricing is integral to hotel management and hotels employ different …",
        "citations": 19
    },
    {
        "title": "Designing and implementing digital visitor experiences in New York State: The case of the Finger Lakes Interactive Play (FLIP) project",
        "id": "P1Zu0ZsAAAAJ:J_g5lzvAfSwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:J_g5lzvAfSwC",
        "authors": [
            "R Lagiewski",
            "M Kesgin"
        ],
        "pub_source": "Journal of Destination Marketing & Management",
        "pub_date": "2017",
        "description": "This paper provides insight into the challenges of implementing digital experiences through a marketing development project intended to generate interest and awareness in historic visitor attractions located in the Finger Lakes Region of New York State. I Love New York Empire State Development's initiative sponsored this marketing development project (FLIP) to promote historic visitor attractions in New York State. A case study is used to examine the interaction of stakeholders between destination marketing organizations and visitor attractions in implementing digital marketing strategies through the New York Path Through History initiative. The findings of this case provide understanding of the challenges related to organizational architecture and capacity in the development and implementation of an interactive visitor app to generate a digital experience for 12 historic visitor attractions located in the Finger Lakes …",
        "citations": 26
    },
    {
        "title": "10 Effects of Personal and Trip Characteristics on Holiday Choice",
        "id": "P1Zu0ZsAAAAJ:O3NaXMp0MMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:O3NaXMp0MMsC",
        "authors": [
            "Muhammet Kesgin"
        ],
        "pub_source": "Tourist behaviour: an international perspective",
        "pub_date": "2016/11/18",
        "description": "Tourism is becoming a common issue of contemporary life and the concept of tourist behaviour is central to the entire discipline of tourism (Cohen, 2004). Although much is known about the multiplicity of tourists’ motivations and the growing divergence of tourists’ behaviour/experiences at the destination, tourists are continually treated as a homogeneous group (Wang, 2000). The convergence–divergence debates can be effective in explaining why tourists are treated as a homogeneous group by some analysts and heterogeneous by others. Both convergent and divergent lenses have advantages and disadvantages. Based on market divergence, segmentation approaches recognize tourist disaggregation, rather than uniform treatments of tourists, contradicting segmentation. However, individual treatment of tourists is also impractical. A pluralist framework is needed for successful destination marketing through the identification of meaningful segments that capture common preferences and expectations among tourists, but is met with complications (Wickens, 2002). Like tourists, destinations are also treated as uniform. For example, Alanya, Turkey, is often promoted as an identikit destination that calls for fun in the sun. However, in addition to its typical Mediterranean characteristics, Alanya is a naturally beautiful tourist destination with much to offer. Tourist areas such as Alanya can benefit from destination-based studies in designing and implementing their destination marketing. An understanding of the determinants of holiday choice, therefore, has important implications for destination managers. Within this overall framework, this chapter …"
    },
    {
        "title": "Perceptual or Epistemic Curiosity: Cultural Motivations and Experiences of Visitors to Alanya Castle",
        "id": "P1Zu0ZsAAAAJ:isC4tDSrTZIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:isC4tDSrTZIC",
        "authors": [
            "Muhammet Kesgin",
            "Aydin Cevirgen"
        ],
        "pub_source": "Enhancing Customer Experience in the Service Industry: A Global Perspective",
        "pub_date": "2016"
    },
    {
        "title": "CHAPTER ELEVEN PERCEPTUAL OR EPISTEMIC CURIOSITY: CULTURAL MOTIVATIONS AND EXPERIENCES",
        "id": "P1Zu0ZsAAAAJ:tOudhMTPpwUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:tOudhMTPpwUC",
        "authors": [
            "MUHAMMET KESGIN",
            "AYDIN ÇEVIRGEN"
        ],
        "pub_source": "Enhancing Customer Experience in the Service Industry: A Global Perspective",
        "pub_date": "2015/11/25",
        "description": "This chapter provides the results of an empirical study conducted to investigate the profile, motivations and experiences of tourists visiting Alanya Castle in Alanya, Turkey. The study sought to identify the significance and nature of cultural motivations and experiences in the context of the so-called mass tourist market and to obtain insights into dimensions of curiosity. The study utilized the ATLAS Cultural Tourism Research Project standard questionnaire with some additional questions, and employed a convenience sample of 385 respondents. The results showed that coastal pleasures were of primary importance and central to respondents’ motivations and experiences. Cultural attractions and cultural tourism experiences were also of interest to respondents. Perceptual curiosity was more important than epistemic curiosity for visiting the resort area and the cultural attraction. The study suggests several courses of action for managing and marketing destinations in general and tourist attractions in particular."
    },
    {
        "title": "Travel and Tourism Education: Choosing an Innovative, Creative and Successful Career in a Global Society",
        "id": "P1Zu0ZsAAAAJ:BqipwSGYUEgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:BqipwSGYUEgC",
        "authors": [
            "M Kesgin",
            "C Whitlock"
        ],
        "pub_source": "Travel and Tourism for the Curious: Why Study Travel and Tourism Management",
        "pub_date": "2015"
    },
    {
        "title": "Being away or being there: British holidaymakers' motivations and experiences visiting Alanya, Turkey",
        "id": "P1Zu0ZsAAAAJ:u_35RYKgDlwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:u_35RYKgDlwC",
        "authors": [
            "Muhammet Kesgin"
        ],
        "pub_source": "Buckinghamshire New University",
        "pub_date": "2013",
        "description": "This thesis investigates British holidaymakers' motivations, behaviours and experiences visiting Alanya, Turkey, based on the analysis of quantitative and qualitative data gathered through structured self-administrated questionnaire and semi-structured interviews. Employing a convenience sample of 505 holidaymakers visiting a coastal holiday resort in the Mediterranean, the thesis provides a destination-based analysis of the tourist experience process in three analytical phases. Utilising qualitative and quantitative techniques, the study investigates and addresses, in particular, two specific issues: Motivators, constraints and facilitators of holiday choice; and evaluation of holiday/destination behaviour and experiences. The underlying characteristic of Alanya holiday was found to be seeking 'fun in the sun'. ‗Being away‘ was more important than ‗being there‘ as long as sunny weather and the 'right price‘ were guaranteed. Coastal pleasures dominated the holiday activity, and social and cultural contacts were also significant. Motivations, constraints and facilitators were significant determinants of holiday choice and holiday activity patterns. Supporting consumption experiences were the facilitators of peak experiences. Both peak and supporting consumption experiences were crucial in combination for holidaymakers‘ satisfaction. Preferences and perceptions indicated both similarities and differences between holidaymakers. Differences that are rather more significant were based on repeat visitation patterns. Socio-demographic characteristics were more significant for pre-and on-site experience phases. Trip characteristics were more significant …",
        "citations": 6
    },
    {
        "title": "Being away or being there? British tourists' motivations holidaying in Alanya, Turkey",
        "id": "P1Zu0ZsAAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Muhammet Kesgin",
            "Ali Bakir",
            "Eugenia Wickens"
        ],
        "pub_source": "Contemporary Tourist Experiences : Concepts and Consequences",
        "pub_date": "2012",
        "description": "Introduction Alongside the growing fascination of tourists and researchers alike with visits to  sites associated with death and atrocity (Stone and Sharpley 2008), different  terms (for example, black spots tourism, thanatourism or morbid tourism) have  been keyed in the attempt to describe, define and conceptualise this social phenomenon. Scholars have commonly adopted the term ‘dark tourism’, first coined  by Foley and Lennon (1996) (see for example, Cohen 2010; Mowatt and Chancellor 2011). Nevertheless, the common usage of this term does not suggest the  existence of an accepted definition of this social phenomenon. Moreover, there  is a general agreement that dark tourism still remains ‘theoretically fragile’  (Stone and Sharpley 2008: 575) and ‘poorly conceptualized’ (Jamal and Lelo  2011: 31). In line with Seaton and Lennon’s (2004) observation that there are  more questions than answers in relation to …",
        "citations": 6
    },
    {
        "title": "British Tourist’s Holiday Experience in Alanya, Turkey: A Mixed Methods Research",
        "id": "P1Zu0ZsAAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Muhammet Kesgin"
        ],
        "pub_source": "Academy of Marketing 2011 Conference",
        "pub_date": "2011",
        "description": "7th Biennial Symposium of Consumer Psychology of Tourism, Hospitality and Leisure, Thailand, 24-27 May 2011"
    },
    {
        "title": "International Tourism Conference 2008: Cultural and Event Tourism",
        "id": "P1Zu0ZsAAAAJ:RHpTSmoSYBkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:RHpTSmoSYBkC",
        "authors": [
            "Ahmet Aktas",
            "Eugenia Wickens",
            "Muhammet Kesgin",
            "Emre Cengiz",
            "Erdal Yenialp"
        ],
        "pub_source": "",
        "pub_date": "2008"
    },
    {
        "title": "The Effects of Service Quality Perceptions on Visitor Satisfaction: An Empirical Study in Alanya Castle",
        "id": "P1Zu0ZsAAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:9yKSN-GCB0IC",
        "authors": [
            "Aydın Cevirgen",
            "Muhammet Kesgin",
            "Ismet Kaya"
        ],
        "pub_source": "Proceedings of the International Tourism Conference 2008 ”Cultural and Event Tourism: Issues & Debates”, In: Aktas, A., Kesgin, M., Cengiz, E. and Yenialp, E. (eds),  20-26 November 2006, Alanya, Turkey",
        "pub_date": "2008",
        "description": "Cultural/heritage tourism is very important issue for both visitors and managers since trends show that there is an increasing demand for these types of tourism for the reasons related to intensified competitiveness versus anxieties of conservation of these destinations. Attractions of these destinations motivate visitors to travel but are not enough alone because visitors also take into account high service quality delivered for adequate satisfaction. Therefore, service quality and its perceptions in cultural/heritage places have primary importance and they need investigation. This study attempts to determine the perceptions and satisfactions of visitors to Alanya Castle which is considered as an open-airmuseum. The study was conducted in the Alanya Castle in Antalya with a total of 410 respondents. In order to analyse the data gathered in the survey, a scale was used by adapting similiar studies such as HISTOQUAL and …",
        "citations": 4
    },
    {
        "title": "1. Ulusal Gastronomi Sempozyumu ve Sanatsal Etkinlikler",
        "id": "P1Zu0ZsAAAAJ:dfsIfKJdRG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:dfsIfKJdRG4C",
        "authors": [
            ""
        ],
        "pub_source": "",
        "pub_date": "2007"
    },
    {
        "title": "Local authorities' and NGOs' perceptions of tourism development and urbanization in Alanya",
        "id": "P1Zu0ZsAAAAJ:u5HHmVD_uO8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:u5HHmVD_uO8C",
        "authors": [
            "Aydın Çevirgen",
            "Muhammet Kesgin"
        ],
        "pub_source": "Tourism",
        "pub_date": "2007",
        "description": "Tourism development and urbanization have economic, socio-cultural and environmental impacts on host destinations. With the recognition of the importance of these impacts on host perceptions and attitudes, numerous studies have been conducted towards tourism development. However, resident’s perceptions studies of tourism development are superfluous; there are a few empirical studies on local authorities’ and non-governmental organizations’(NGOs) perceptions of tourism development. In this regard, this study aims to determine the local authorities’ and NGOs’ perceptions of tourism development and urbanization in Alanya with an empirical study. The major findings have shown that both local authorities and NGOs strongly agree that tourism certainly improves the quality of life in the region, the establishment of an integrated management approach is essential and that the tourism development should be promoted in qualitative perspective. The findings indicated that the planning of further tourism development and urbanization should be encouraged within the aim to offer a higher quality of life for hosts and guests.",
        "citations": 29
    },
    {
        "title": "THE PROCEEDINGS BOOK I",
        "id": "P1Zu0ZsAAAAJ:xtRiw3GOFMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:xtRiw3GOFMkC",
        "authors": [
            "Ahmet AKTAS"
        ],
        "pub_source": "",
        "pub_date": "2006/11/20",
        "description": "The marketing of areas as tourism destinations is becoming increasingly competitive (Palmer l998: 185). Thus, the success of the destination in world markets is affected by its relative competition power (Enright and Newton 2004: 777). Many markets are saturated leading to increasing competition between brands (Raaij, Strazzieri and Woodside 2001: 59). As a result of this, the competition dimension between destination brands decreased to local level (Taskin and Giiven 2003: 55). Now, there is a need to “develop a marketing communication strategy” for each destination brand in such a way that provides standing out with its own unique difference. In this study, we analyzed practically the relation between success achieving of a destination brand and development of a marketing communication strategy in compliance with its nature. In the application part of the study we studied on “Comana Cappodociae …"
    },
    {
        "title": "Turk-Kazakh International Tourism Conference",
        "id": "P1Zu0ZsAAAAJ:4JMBOYKVnBMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:4JMBOYKVnBMC",
        "authors": [
            "Ahmet. Aktas",
            "Muhammet. Kesgin",
            "Emre. Cengiz",
            "Erdal. Yenialp"
        ],
        "pub_source": "Turk-Kazakh International Tourism Conference 2006",
        "pub_date": "2006"
    },
    {
        "title": "Outsourcing Tendencies in Five Star Hotels: A Comparative Study of Management Perceptions of Antalya & Canary Island",
        "id": "P1Zu0ZsAAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Rüya Ehtiyar",
            "Muhammet Kesgin"
        ],
        "pub_source": "Turk-Kazakh International Tourism Conference 2006",
        "pub_date": "2006"
    },
    {
        "title": "Outsourcing in Hotel Enterprises: A Research on the 4 and 5 Star Active Hotels in Antalya",
        "id": "P1Zu0ZsAAAAJ:GnPB-g6toBAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:GnPB-g6toBAC",
        "authors": [
            "Muhammet Kesgin"
        ],
        "pub_source": "Postgraduate Thesis, Akdeniz University, Institute of Social Sciences, Antalya",
        "pub_date": "2005"
    },
    {
        "title": "Otel İşletmelerinde Dış Kaynak Kullanımı: Antalya’da Faaliyette Bulunan 4 ve 5 Yıldızlı Otellerde Bir Araştırma",
        "id": "P1Zu0ZsAAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:qjMakFHDy7sC",
        "authors": [
            "Muhammet Kesgin"
        ],
        "pub_source": "Akdeniz Üniversitesi  Sosyal Bilimler Enstitüsü",
        "pub_date": "2005",
        "description": "Çağımız rekabet çağıdır. şletmeler bu rekabet çağında sürdürülebilirliklerini sağlamak içinbütün yolları denemektedirler. Outsourcing (dış kaynak kullanımı) bu yollarından sadecebiridir ve son yıllarda çok tartışılmakta, üzerinde araştırmalar yapılmaktadır. Aslındaişletmelerce çeşitli şekillerde yıllardır uygulanan bu kavram son 15 yıldan beri farklı birşekilde tanımlanarak uygulanmaktadır. Bugün ulaştığı boyutuyla neredeyse girmediği sektörve işletme kalmamış durumdadır.Otelcilik sektörü de bu gelişmelerden etkilenmektedir. Oteller, geleneksel olarak daha öncekendi verdikleri dış kaynak kullanımı hizmetini satın alan durumuna dönüşmüşlerdir. Buçalışmada, otellerin hangi faaliyetlerini dış kaynaklardan sağladıkları ve bu konuyla ilgilieğilimleri araştırılmıştır. Araştırma kısmında Antalya'da faaliyette bulunan otellerin dışkaynak kullanma düzeyleri ve eğilimleri tespit edilmiştir. Otellerin, hizmetlerini kendilerigerçekleştirmek yerine dış kaynaklı işletmelerden alma konusundaki tutumları tespit edilmeyeçalışılmıştır.",
        "citations": 36
    },
    {
        "title": "The effect of employer branding on job-seeking intention: Insights from hospitality students",
        "id": "P1Zu0ZsAAAAJ:5Ul4iDaHHb8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=P1Zu0ZsAAAAJ:5Ul4iDaHHb8C",
        "authors": [
            "Li Ding",
            "Angel F González",
            "Muhammet Kesgin"
        ],
        "pub_source": "Conflict and Hostility in Hotels, Restaurants, and Bars",
        "pub_date": "",
        "description": "The increasing tension between employers and employees in the hospitality industry may give hospitality-major students a first impression of this industry. As one of the service-based industries, the hospitality industry has the general characteristics of intangibility, perishability, unstable demand, and heterogeneity. Working in the hospitality industry, entry-level employees usually suffer from a heavy workload, long working hours, and low pay. The frontline employees, such as hotel receptionists and restaurant servers, are required to have a higher level of emotional intelligence to present friendliness and empathy to the guests. The employees at the management level have high work stress of sustaining the business success in financial and non-financial aspects in the fierce market competition. Therefore, the high job turnover rate is one of the well-known features of the hospitality industry."
    }
]