[
    {
        "title": "Community Needs and Assets: A Computational Analysis of Community Conversations",
        "id": "DOTolnIAAAAJ:8d8msizDQcsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:8d8msizDQcsC",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Naveen Sharma",
            "Ashiqur R KhudaBukhsh"
        ],
        "pub_source": "Proceedings of the International AAAI Conference on Web and Social Media",
        "pub_date": "2024/5/28",
        "description": "A community needs assessment is a tool used by non-profits and government agencies to quantify the strengths and issues of a community, allowing them to allocate their resources better. Such approaches are transitioning towards leveraging social media conversations to analyze the needs of communities and the assets already present within them. However, manual analysis of exponentially increasing social media conversations is challenging. There is a gap in the present literature in computationally analyzing how community members discuss the strengths and needs of the community. To address this gap, we introduce the task of identifying, extracting, and categorizing community needs and assets from conversational data using sophisticated natural language processing methods. To facilitate this task, we introduce the first dataset about community needs and assets consisting of 3,511 conversations from Reddit, annotated using crowdsourced workers. Using this dataset, we evaluate an utterance-level classification model compared to sentiment classification and a popular large language model (in a zero-shot setting), where we find that our model outperforms both baselines at an F1 score of 94% compared to 49% and 61% respectively. Furthermore, we observe through our study that conversations about needs have negative sentiments and emotions, while conversations about assets focus on location and entities."
    },
    {
        "title": "Community Needs and Assets: A Computational Analysis of Community Conversations",
        "id": "DOTolnIAAAAJ:LO7wyVUgiFcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:LO7wyVUgiFcC",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Naveen Sharma",
            "Ashiqur R KhudaBukhsh"
        ],
        "pub_source": "arXiv e-prints",
        "pub_date": "2024/3",
        "description": "A community needs assessment is a tool used by non-profits and government agencies to quantify the strengths and issues of a community, allowing them to allocate their resources better. Such approaches are transitioning towards leveraging social media conversations to analyze the needs of communities and the assets already present within them. However, manual analysis of exponentially increasing social media conversations is challenging. There is a gap in the present literature in computationally analyzing how community members discuss the strengths and needs of the community. To address this gap, we introduce the task of identifying, extracting, and categorizing community needs and assets from conversational data using sophisticated natural language processing methods. To facilitate this task, we introduce the first dataset about community needs and assets consisting of 3,511 conversations from …"
    },
    {
        "title": "Infrastructure Ombudsman: Mining Future Failure Concerns from Structural Disaster Response",
        "id": "DOTolnIAAAAJ:4fGpz3EwCPoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:4fGpz3EwCPoC",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Soumyajit Datta",
            "Naveen Sharma",
            "Ashiqur R KhudaBukhsh"
        ],
        "pub_source": "arXiv preprint arXiv:2402.13528",
        "pub_date": "2024/2/21",
        "description": "Current research concentrates on studying discussions on social media related to structural failures to improve disaster response strategies. However, detecting social web posts discussing concerns about anticipatory failures is under-explored. If such concerns are channeled to the appropriate authorities, it can aid in the prevention and mitigation of potential infrastructural failures. In this paper, we develop an infrastructure ombudsman -- that automatically detects specific infrastructure concerns. Our work considers several recent structural failures in the US. We present a first-of-its-kind dataset of 2,662 social web instances for this novel task mined from Reddit and YouTube.",
        "citations": 1
    },
    {
        "title": "Infrastructure Ombudsman: Mining Future Failure Concerns from Structural Disaster Response",
        "id": "DOTolnIAAAAJ:9pM33mqn1YgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:9pM33mqn1YgC",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Soumyajit Datta",
            "Naveen Sharma",
            "Ashiqur R KhudaBukhsh"
        ],
        "pub_source": "arXiv e-prints",
        "pub_date": "2024/2",
        "description": "Current research concentrates on studying discussions on social media related to structural failures to improve disaster response strategies. However, detecting social web posts discussing concerns about anticipatory failures is under-explored. If such concerns are channeled to the appropriate authorities, it can aid in the prevention and mitigation of potential infrastructural failures. In this paper, we develop an infrastructure ombudsman--that automatically detects specific infrastructure concerns. Our work considers several recent structural failures in the US. We present a first-of-its-kind dataset of 2,662 social web instances for this novel task mined from Reddit and YouTube."
    },
    {
        "title": "Third-party software library migration at the method-level using multi-objective evolutionary search",
        "id": "DOTolnIAAAAJ:_axFR9aDTf0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:_axFR9aDTf0C",
        "authors": [
            "Niranjana Deshpande",
            "Mohamed Wiem Mkaouer",
            "Ali Ouni",
            "Naveen Sharma"
        ],
        "pub_source": "Swarm and Evolutionary Computation",
        "pub_date": "2024/2/1",
        "description": "Software developers commonly use third-party software libraries to reduce implementation efforts and mitigate errors in their source code while building high-quality and reliable software. To support software evolution, newer libraries are released periodically with added features, improvements in performance as well as critical updates such as bug fixes. Hence, older, existing (source) libraries need to be replaced with their newer, updated (target) counterparts, in a process known as library migration. Typically, library migration is a time-consuming, manual, and error-prone process that requires developers to analyze the source and target library code and its documentation. Specifically, developers examine Application Programming Interface (API) implementations and documentation to replace each source API with a target API without modifying the underlying software functionality. While recent works have used …"
    },
    {
        "title": "Community Asset Ontology for Modeling Community Data using Information Extraction",
        "id": "DOTolnIAAAAJ:HbR8gkJAVGIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:HbR8gkJAVGIC",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Naveen Sharma"
        ],
        "pub_source": "Proceedings of the 2022 6th International Conference on Natural Language Processing and Information Retrieval",
        "pub_date": "2022/12/16",
        "description": "In this paper, we analyze some data-related challenges to building resilient and sustainable communities, particularly how to computationally model the social and economical dynamic that exists within a community. To that end, we propose the Community Asset Ontology (CAO) for a knowledge graph that can encapsulate community data as modeled in existing social science literature. We utilize existing information extraction paradigms to map natural language community data to CAO and evaluate the usefulness of such an ontology-based approach compared to a baseline open information extraction approach.",
        "citations": 1
    },
    {
        "title": "Community Learning: Understanding A Community Through NLP for Positive Impact",
        "id": "DOTolnIAAAAJ:L7CI7m0gUJcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:L7CI7m0gUJcC",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Naveen Sharma"
        ],
        "pub_source": "arXiv preprint arXiv:2210.00590",
        "pub_date": "2022/10/2",
        "description": "A post-pandemic world resulted in economic upheaval, particularly for the cities' communities. While significant work in NLP4PI focuses on national and international events, there is a gap in bringing such state-of-the-art methods into the community development field. In order to help with community development, we must learn about the communities we develop. To that end, we propose the task of community learning as a computational task of extracting natural language data about the community, transforming and loading it into a suitable knowledge graph structure for further downstream applications. We study two particular cases of homelessness and education in showing the visualization capabilities of a knowledge graph, and also discuss other usefulness such a model can provide."
    },
    {
        "title": "Community Learning: Understanding A Community Through NLP for Positive Impact",
        "id": "DOTolnIAAAAJ:GtLg2Ama23sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:GtLg2Ama23sC",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Naveen Sharma"
        ],
        "pub_source": "arXiv e-prints",
        "pub_date": "2022/10",
        "description": "A post-pandemic world resulted in economic upheaval, particularly for the cities' communities. While significant work in NLP4PI focuses on national and international events, there is a gap in bringing such state-of-the-art methods into the community development field. In order to help with community development, we must learn about the communities we develop. To that end, we propose the task of community learning as a computational task of extracting natural language data about the community, transforming and loading it into a suitable knowledge graph structure for further downstream applications. We study two particular cases of homelessness and education in showing the visualization capabilities of a knowledge graph, and also discuss other usefulness such a model can provide."
    },
    {
        "title": "Online Learning Using Incomplete Execution Data for Self-Adaptive Service-Oriented Systems",
        "id": "DOTolnIAAAAJ:EYYDruWGBe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:EYYDruWGBe4C",
        "authors": [
            "Niranjana Deshpande",
            "Naveen Sharma",
            "Qi Yu",
            "Daniel E Krutz"
        ],
        "pub_source": "2022 IEEE International Conference on Web Services (ICWS)",
        "pub_date": "2022/7/10",
        "description": "Service composition algorithms support the construction of complex applications by combining various web services to fulfill diverse functional and Quality of Service (QoS) requirements. Moreover, composition algorithms must fulfill diverse user requirements while adhering to constraints such as limited computational resources. Recent research has demonstrated that using online learning to select different algorithms for specific tasks of a problem domain outperforms approaches that use a single algorithm for all tasks, in terms of computational resource usage and solution quality. Problematically, existing work in service composition does not leverage these advances, leading to multiple inefficient compositions. To address these challenges, we propose online composition algorithm selection using contextual multi-armed bandits to select an algorithm for each composition task at runtime. Our evaluations …"
    },
    {
        "title": "Search-based third-party library migration at the method-level",
        "id": "DOTolnIAAAAJ:ML0RJ9NH7IQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ML0RJ9NH7IQC",
        "authors": [
            "Niranjana Deshpande",
            "Mohamed Wiem Mkaouer",
            "Ali Ouni",
            "Naveen Sharma"
        ],
        "pub_source": "International Conference on the Applications of Evolutionary Computation (Part of EvoStar)",
        "pub_date": "2022/4/15",
        "description": "In software development, third-party libraries are commonly used to reduce implementation efforts and errors, while delivering high-quality, reliable and secure software. To support software evolution, newer libraries are continuously released to offer added features, and critical updates such as bug and vulnerability fixes. As a result, old (source) libraries and their methods must be replaced with their newer, updated counterparts (target libraries) during the library migration process. This is known to be a time-consuming and error-prone process as developers need to analyze both the source and target library’s Application Programming Interface (API) documentation and implementation to replace every source API with target API(s). Recent studies have utilized various techniques to recommend the appropriate target library for replacement, but do not provide generalizable guidelines on how to replace each source …",
        "citations": 4
    },
    {
        "title": "LotRec: A Recommender for Urban Vacant Lot Conversion",
        "id": "DOTolnIAAAAJ:BUYA1_V_uYcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:BUYA1_V_uYcC",
        "authors": [
            "Md Towhidul A Chowdhury",
            "Naveen Sharma"
        ],
        "pub_source": "arXiv preprint arXiv:2202.02481",
        "pub_date": "2022/2/5",
        "description": "Vacant lots are neglected properties in a city that lead to environmental hazards and poor standard of living for the community. Thus, reclaiming vacant lots and putting them to productive use is an important consideration for many cities. Given a large number of vacant lots and resource constraints for conversion, two key questions for a city are (1) whether to convert a vacant lot or not; and (2) what to convert a vacant lot as. We seek to provide computational support to answer these questions. To this end, we identify the determinants of a vacant lot conversion and build a recommender based on those determinants. We evaluate our models on real-world vacant lot datasets from the US cities of Philadelphia,PA and Baltimore, MD. Our results indicate that our recommender yields mean F-measures of (1) 90% in predicting whether a vacant lot should be converted or not within a single city, (2) 91% in predicting what a vacant lot should be converted to, within a single city and, (3) 85% in predicting whether a vacant lot should be converted or not across two cities.",
        "citations": 2
    },
    {
        "title": "Citizenly: A platform to encourage data-driven decision making for the community by the community",
        "id": "DOTolnIAAAAJ:URolC5Kub84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:URolC5Kub84C",
        "authors": [
            "Md Towhidul Absar Chowdhury",
            "Naveen Sharma"
        ],
        "pub_source": "2021 IEEE International Conferences on Internet of Things (iThings) and IEEE Green Computing & Communications (GreenCom) and IEEE Cyber, Physical & Social Computing (CPSCom) and IEEE Smart Data (SmartData) and IEEE Congress on Cybermatics (Cybermatics)",
        "pub_date": "2021/12/6",
        "description": "As open datasets at the global, national, state and municipal levels become more available, data-driven decision-making is seeing widespread adoption at such levels. But there is a lack of such an approach at the community and neighborhood level. To foster the usage of such data-driven decision-making, we need to encourage community engagement with local data and improve data literacy in communities. Access to a one-stop-shop for all the data generated by the community regarding their neighborhood allows citizens to engage in productive participation. In this paper, we introduce Citizenly, a smart cyber-infrastructure and an easy-to-use application that provides a single access interface for the synthesis of both open datasets and local community data generated by the residents. The goal of Citizenly is to empower the democratization of data science for local community residents to use in applications …",
        "citations": 3
    },
    {
        "title": "R-CASS: Using algorithm selection for self-adaptive service oriented systems",
        "id": "DOTolnIAAAAJ:0KyAp5RtaNEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:0KyAp5RtaNEC",
        "authors": [
            "Niranjana Deshpande",
            "Naveen Sharma",
            "Qi Yu",
            "Daniel E Krutz"
        ],
        "pub_source": "2021 IEEE International Conference on Web Services (ICWS)",
        "pub_date": "2021/9/5",
        "description": "In service composition, complex applications are built by combining web services to fulfill user Quality of Service (QoS) and business requirements. To meet these requirements, applications are composed by evaluating all possible web service combinations using search algorithms. These algorithms need to be accurate and inexpensive to evaluate a large number of possible service combinations and services' fluctuating QoS attributes while meeting the constraints of limited computational resources. Recent research has shown that different search algorithms can outperform others on specific instances of a problem domain, in terms of solution quality and computational resource usage. Problematically, current service composition approaches ignore this property, leading to inefficient compositions. To address these limitations, we propose a composition algorithm selection framework which selects an algorithm …",
        "citations": 3
    },
    {
        "title": "Algorithm selection using transfer learning",
        "id": "DOTolnIAAAAJ:yB1At4FlUx8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:yB1At4FlUx8C",
        "authors": [
            "Niranjana Deshpande",
            "Naveen Sharma"
        ],
        "pub_source": "Proceedings of the Genetic and Evolutionary Computation Conference Companion",
        "pub_date": "2021/7/7",
        "description": "Per-instance algorithm selection has been shown to achieve state of the art performance in solving Travelling Salesman Problems (TSP). By selecting optimization algorithms for each TSP instance, significant time savings have been achieved. In this work, we highlight how recent algorithm selection techniques apply to service composition; which is posed as a TSP problem. However, the service composition environment is highly dynamic, which poses unique challenges for algorithm selection. Chief amongst those is the availability of training data for all algorithms on unseen tasks, which is infeasible to obtain. To address this problem, we propose the use of transfer learning techniques to improve classification accuracy in dynamic settings such as service composition."
    },
    {
        "title": "Creating an Inclusive, Vibrant Learning Environment within a Large Software Engineering Program–Experiential Learning Experiences Created for Students, Faculty, and Senior …",
        "id": "DOTolnIAAAAJ:uWiczbcajpAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:uWiczbcajpAC",
        "authors": [
            "Margaret B Bailey",
            "Naveen Sharma",
            "Lana Verschage",
            "Timothy T Conlon"
        ],
        "pub_source": "2021 CoNECD",
        "pub_date": "2021/1/24",
        "description": "This presentation describes several initiatives currently underway within a large software engineering (SE) department at a private university within the northeast US to positively affect levels of inclusiveness within the department’s learning environment. Information gathered from faculty, staff, student interviews and focus group discussions, as well as a department goal to improve female freshmen retention in the SE major motivated the SE department chair, departmental academic advisors and faculty, and the college’s women in computing director to launch this set of aligned activities in collaboration with the NSF ADVANCE funded program (NSF# 1209115) at the university level. The resulting activities ideally enhance diversity and inclusion for students from all underrepresented groups in the program with a focus on groups based on gender.",
        "citations": 1
    },
    {
        "title": "Composition algorithm adaptation in service oriented systems",
        "id": "DOTolnIAAAAJ:vRqMK49ujn8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:vRqMK49ujn8C",
        "authors": [
            "Niranjana Deshpande",
            "Naveen Sharma"
        ],
        "pub_source": "European Conference on Software Architecture",
        "pub_date": "2020/9/7",
        "description": "Architecting and constructing software systems using Service Oriented Architecture (SOA) is a widely employed paradigm. Application functionality is commonly delivered by composing Internet communicable software components or services. Using SOA, applications are constructed by a well-defined composition process that implements composition logic to meet an application’s functional and non-functional requirements. Various composition techniques have been proposed in the literature, with varying performance guarantees and resource usage. Service composition also has to adapt to unanticipated conditions posed by a highly dynamic environment due to changing services, evolving architectures, and user requirements. Current adaptive methodologies determine a composition technique at design time and adapt selection and binding of service at runtime. In this paper, we propose adaptation of …",
        "citations": 8
    },
    {
        "title": "Effects of GA4+ 7+ BA and CPPU on russeting and fruit quality in apple (Malus Ã—domestica)",
        "id": "DOTolnIAAAAJ:kh2fBNsKQNwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:kh2fBNsKQNwC",
        "authors": [
            "Sajan Sharma",
            "N Sharma",
            "DP Sharma",
            "Neena Chauhan"
        ],
        "pub_source": "The Indian Journal of Agricultural Sciences",
        "pub_date": "2020/8/25",
        "description": "Apple (Malus × domestica Borkh.) production is now being affected by the changing climate which has led to reduction in quality thereby, these fruits command low returns in the market. As it is the most important temperate fruit crop of Himachal Pradesh, it still requires a great improvisation in quality. The present study was conducted in 2017-18 with various plant growth regulator practices on eight year old apple trees cv. ‘Scarlet Spur II’. Application of GA4+7+BA at 2.5 and 5 ppm when given at petal fall and two times later at 10 days interval recorded minimum russet formation (Score:1.17), increased fruit length (68.93 mm) as well as increased L/D ratio (1.07), TSS and sugar content in apple. However, CPPU at 10 ppm when applied at petal fall stage recorded higher fruit diameter (70.89 mm), fruit weight (155.56 g), fruit volume (102.94 cc), TSS (10.72 ºBrix), total sugars (9.11%) and reducing sugars (4.87%)."
    },
    {
        "title": "Impact of small and medium enterprises on employment generation in Kaduna State Nigeria",
        "id": "DOTolnIAAAAJ:lmc2jWPfTJgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:lmc2jWPfTJgC",
        "authors": [
            "M Shettima",
            "N Sharma",
            "P Banerji"
        ],
        "pub_source": "Indian Journal of Science and Technology",
        "pub_date": "2020/6/27",
        "description": "Aim/objectives: To examine the impact small and medium enterprises have on employment generation in Kaduna state, Nigeria and devise new ways in boosting employment generation by enterprises. Methods/Statistical analysis: Primary data is utilised with the help of a questionnaire; a survey is carried out from 5 selected SMEs having a sample size of 1,000 respondents with 200 respondents in each of the 5 selected SMEs. The variables in concerned were analysed using the Kaiser Varimax Rotation for factor analysis to show the correlation and level of significance exhibited. The SPSS software version 20 was used for this purpose. Findings: Findings in the study showed that there are disparities in the employment generation trends among the selected SMEs which are as a result of inequity in finance, policy discontinuity, insecurity, lack of awareness, ineffective market linkages, among others. The correlation matrix shows that the variables are seen to correlate at the minimum significance level thus proving our hypothesis of how significant the impact SMEs have on employment generation. Also the extraction values of all the variables are quite high indicating that they are good extraction values and as the acceptable cumulative% value is 60%, our eight variables used have been reduced to four factors which explain our total variance at a cumulative% of 69%; this clearly shown that 69% of the variance is explained by four (4) distinct factors. The result however showed that all the variables exhibit good relationship among each other which also implies that they have great impact on employment generation as their factor loading is very …",
        "citations": 1
    },
    {
        "title": "Evaluation of Parent Support Program on Attention-Deficit/Hyperactivity Disorder Symptoms in Young Children: a randomized controlled trial",
        "id": "DOTolnIAAAAJ:kz9GbA2Ns4gC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:kz9GbA2Ns4gC",
        "authors": [
            "N Sharma",
            "S Sharma",
            "D Singh",
            "N Krishnamurthy"
        ],
        "pub_source": "EUROPEAN JOURNAL OF NEUROLOGY",
        "pub_date": "2020/5/1"
    },
    {
        "title": "Influence of chemical fruit thinning on thinning level, fruit yield and quality in nectarine cv. may fire",
        "id": "DOTolnIAAAAJ:PVjk1bu6vJQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:PVjk1bu6vJQC",
        "authors": [
            "N Sharma"
        ],
        "pub_source": "Indian Journal of Ecology",
        "pub_date": "2020",
        "description": "The present investigations were carried out on 12-year old trees of nectarine cultivar May Fire raised on wild peach seedling rootstocks during 2014 and 2015. Experimental trees were subjected to nine different treatments NAAat 40 and 60 ppm; Ethrel at 200 and 300 ppm applied one and two week after petal fall at 40 ppm when applied two weeks after petal fall resulted insignificantly higher thinning, decreased yield and increased fruit size and weight over the control. Fruit TSS, and total sugar contents were higher and fruit acidity and firmness were lower in the fruits from trees treated with NAA at 60 ppm when applied two weeks after petal fall. Fruit surface colouration was higher in fruits from trees treated with Ethrelat 300 ppm, two weeks after petal fall Fruit thinning percentage, yield, fruit size, fruit weight, fruit colouration, fruit TSS and total sugar contents were significantly lower and fruit firmness higher in control …"
    },
    {
        "title": "Predicting the influence of urban vacant lots on neighborhood property values",
        "id": "DOTolnIAAAAJ:dshw04ExmUIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:dshw04ExmUIC",
        "authors": [
            "Muhammad Fazalul Rahman",
            "Pradeep Murukannaiah",
            "Naveen Sharma"
        ],
        "pub_source": "CEUR Workshop Proceedings",
        "pub_date": "2020",
        "description": "Vacant lots are municipally-owned land parcels which were acquired post-abandonment or due to tax foreclosures. With time, failure to sell or find alternate uses for vacant lots results in them causing adverse effects on the health and safety of residents, and cost the city both directly and indirectly. Although existing research has tried to define these impacts, cities need quantifiable evidence from within the city to make planning decisions based on these studies. Moreover, trying to understand the impact of vacant lots in an uncontrolled setting makes it difficult to perform A key problem with existing methodologies is that they tend to look at the city as a whole, while ignoring the diverse socioeconomic factors at play. Altogether, city planners are left with little or no actionable information to prioritize conversion of vacant lots. In contrast, for our research we try to model the city as blocks, census tracts and neighborhoods while using relevant features to capture key demographic, economic and geographic characteristics. In addition, we build a deep learning model to quantify the impact of vacant lots on changing property values so as to recommend conversions that yields the maximum benefit through property value tax increase. Our results indicate that our model is able to capture the relationship between vacant lots and property values better than conventionally used algorithms and data models. Further, our model specifically caters to small and mid size cities, which are often neglected in the mainstream urban computing research.",
        "citations": 1
    },
    {
        "title": "Effect of Soil Working Techniques on Moisture Conservation, Growth, Yield and Fruit Cracking of Pomegranate (Punica granatum L.) cv. Kandhari",
        "id": "DOTolnIAAAAJ:Ri6SYOTghG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:Ri6SYOTghG4C",
        "authors": [
            "Prativa Sahu",
            "N Sharma"
        ],
        "pub_source": "Int. J. Curr. Microbiol. App. Sci",
        "pub_date": "2019",
        "description": "Pomegranate (Punica granatum L.) is one of the most historic fruits and considered as a symbol of fertility and often quoted in the theological texts (Mars, 2000). Its fruit has wide consumer preference for its attractive, juicy, sweet-acidic and refreshing arils. Though pomegranate was originally adapted to Mediterranean climate, but it has also"
    },
    {
        "title": "Perﬂuoroalkyl substances (PFASs) uptake by willow plants and effects on photosynthesis",
        "id": "DOTolnIAAAAJ:hCrLmN-GePgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:hCrLmN-GePgC",
        "authors": [
            "Inisa Shrestha",
            "G Barion",
            "N Sharma",
            "AR Trentin",
            "T Vamerali",
            "A Masi",
            "R Ghisi"
        ],
        "pub_source": "Atti del convegno SICA",
        "pub_date": "2018",
        "description": "The purpose of this research was to evaluate the ability of willow to remove PFASs (PFBS, PFBA, PFPeA, PFHxA, PFHpA, PFOA, PFOS, PFNA, PFDA, PFDoA, PFUnA) from the growth medium through LC-MS-MS analysis of the nutrient solution during a one-week experiment, and to study the effects of PFASs on this species through measurements of photosynthetic parameters at the end of the trial. Results of analysis of the nutrient solutions reveal a declining concentration of all the analysed PFASs, suggesting that they were taken up or were adsorbed by the roots, and with different effciency depending upon the compound chain length and functional group. Regarding the effects of the willow plants exposure to PFASs, analysis of photosynthetic parameters reveals that these pollutants seem to exert a positive effect on photosynthesis, so suggesting that willow species can be good candidates for phytoremediation of PFASs. However, further analysis are needed to clarify the results obtained and to verify the effects of these pollutants in long-term experiments."
    },
    {
        "title": "Plant treatment with Perfluoroalkyl Substances (PFASs): Uptake and effects on growth and morphology",
        "id": "DOTolnIAAAAJ:ClCfbGk0d_YC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ClCfbGk0d_YC",
        "authors": [
            "Shilpi Misra",
            "N Sharma",
            "P Magnabosco",
            "S De Vecchi",
            "S Millan",
            "AR Trentin",
            "T Vamerali",
            "R Ghisi",
            "A Masi"
        ],
        "pub_source": "Atti del XXXV Convegno SICA “La ricerca in chimica agraria. Integrazione dello studio dei sistemi suolo, pianta e ambiente\"",
        "pub_date": "2017",
        "description": "Plant treatment with Perfluoroalkyl Substances (PFASs): Uptake and effects on growth and \nmorphology IRIS IRIS Home Sfoglia Macrotipologie & tipologie Autore Titolo Riviste Serie IT \nItaliano Italiano English English LOGIN 1.IRIS 2.Catalogo Ricerca UNIPD 3.04 \nCONTRIBUTO IN ATTO DI CONVEGNO 4.04.02 - Abstract in atti di convegno Plant \ntreatment with Perfluoroalkyl Substances (PFASs): Uptake and effects on growth and \nmorphology MISRA, SHILPI;Sharma N.; Millan S;Trentin AR;Vamerali T.;Ghisi R.;Masi A. \n2017 Scheda breve Scheda completa Scheda completa (DC) SFX Query Titolo del Libro \nAtti del XXXV Convegno SICA “La ricerca in chimica agraria. Integrazione dello studio dei \nsistemi suolo, pianta e ambiente\" Appare nelle tipologie: 04.02 - Abstract in atti di convegno \nFile in questo prodotto: Non ci sono file associati a questo prodotto. Pubblicazioni \nconsigliate Caricamento pubblicazioni consigliate I …"
    },
    {
        "title": "Effect of growth regulators and pruning on, fruit size and quality of nectarine.",
        "id": "DOTolnIAAAAJ:Dip1O2bNi0gC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:Dip1O2bNi0gC",
        "authors": [
            "N Sharma"
        ],
        "pub_source": "Indian Journal of Ecology",
        "pub_date": "2017",
        "description": "In this study experimental trees were subjected to seventeen different treatments pertaining to alternative approach to chemical thinning, chemical thinner were more effective in reducing the crop load directly by pruning or indirectly by GA3 treatments. Treatments with NAA at 40 ppm when applied two weeks after petal fall reduced the crop load to the greatest extent and improved fruit size, fruit volume, fruit quality and pulp to stone ratio. Ethrel 300 ppm when applied two weeks after petal fall increased fruit colouration, total sugar, reducing sugar and decreased titratable acidity and firmness of fruits. However, effect of chemical were less pronounced on trees subjected to severe pruning. Thinning treatment with NAA at 40 ppm when applied two weeks after petal fall reduced the crop load (50.42%) to the greatest extent and improved fruit size (5.00, 4.85 cm), volume (72.00 cc) fruit quality and pulp to stone ratio. Ethrel 300 ppm when applied two weeks after petal fall increased fruit colouration, total sugar, reducing sugar and decreased titratable acidity and firmness of fruits."
    },
    {
        "title": "Plants treatment with Perfluoroalkyl Substances (PFASs): uptake and effects on growth and morphology",
        "id": "DOTolnIAAAAJ:SpbeaW3--B0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:SpbeaW3--B0C",
        "authors": [
            "N Sharma",
            "S Mishra",
            "P Magnabosco",
            "Silvia Millan",
            "Ar Trentin",
            "R Ghisi",
            "A Masi"
        ],
        "pub_source": "Proceedings 7th International Contaminated Site Remediation Conference",
        "pub_date": "2017",
        "description": "Plants treatment with Perfluoroalkyl Substances (PFASs): uptake and effects on growth and \nmorphology IRIS IRIS Home Sfoglia Macrotipologie & tipologie Autore Titolo Riviste Serie IT \nItaliano Italiano English English LOGIN 1.IRIS 2.Catalogo Ricerca UNIPD 3.04 CONTRIBUTO IN \nATTO DI CONVEGNO 4.04.01 - Contributo in atti di convegno Plants treatment with Perfluoroalkyl \nSubstances (PFASs): uptake and effects on growth and morphology Sharma N; MILLAN, \nSILVIA;Trentin AR;Ghisi R;Masi A. 2017 Scheda breve Scheda completa Scheda completa \n(DC) SFX Query Anno 2017 Titolo del Libro Proceedings 7th International Contaminated \nSite Remediation Conference Codice ISBN 9781921431586 Appare nelle tipologie: 04.01 - \nContributo in atti di convegno File in questo prodotto: Non ci sono file associati a questo \nprodotto. Pubblicazioni consigliate I documenti in IRIS sono protetti da copyright e tutti i diritti …"
    },
    {
        "title": "Biochemical and proteomic analyses in Arabidopsis thaliana plants treated with sulfadiazine",
        "id": "DOTolnIAAAAJ:i2xiXl-TujoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:i2xiXl-TujoC",
        "authors": [
            "N Sharma",
            "G Arrigoni",
            "Ar Trentin",
            "C Franchin",
            "S Giaretta",
            "A Masi",
            "R Ghisi"
        ],
        "pub_source": "Atti del XXXV Convegno SICA “La ricerca in chimica agraria. Integrazione dello studio dei sistemi suolo, pianta e ambiente\"",
        "pub_date": "2017",
        "description": "Biochemical and proteomic analyses in Arabidopsis thaliana plants treated with sulfadiazine \nIRIS IRIS Home Sfoglia Macrotipologie & tipologie Autore Titolo Riviste Serie IT Italiano Italiano \nEnglish English LOGIN 1.IRIS 2.Catalogo Ricerca UNIPD 3.04 CONTRIBUTO IN ATTO DI \nCONVEGNO 4.04.02 - Abstract in atti di convegno Biochemical and proteomic analyses in \nArabidopsis thaliana plants treated with sulfadiazine Sharma N;Arrigoni G;Trentin AR;Franchin \nC;Giaretta S;Masi A;Ghisi R 2017 Scheda breve Scheda completa Scheda completa (DC) SFX \nQuery Titolo del Libro Atti del XXXV Convegno SICA “La ricerca in chimica agraria. Integrazione \ndello studio dei sistemi suolo, pianta e ambiente\" Codice Scopus 2-s2.0-85026780674 \nAppare nelle tipologie: 04.02 - Abstract in atti di convegno File in questo prodotto: Non ci \nsono file associati a questo prodotto. Pubblicazioni consigliate Caricamento pubblicazioni …"
    },
    {
        "title": "System and method to control on-demand marketing campaigns and personalized trajectories in hyper-local domains",
        "id": "DOTolnIAAAAJ:RHpTSmoSYBkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:RHpTSmoSYBkC",
        "authors": [
            "S Gnasasambandam",
            "MR Furst",
            "N Sharma"
        ],
        "pub_source": "US Patent App. 14/666,810",
        "pub_date": "2015/7/16",
        "description": "A method of providing targeted communications within a hyper-local domain from a first user to a second user, the method including receiving a communication from a first device, the first communication related to the hyper-local domain, receiving an input from a second device, comparing the input to the communication, and transmitting the communication to the second device, a third device, or combinations thereof, based on the comparing of the input to the communication.",
        "citations": 1
    },
    {
        "title": "Apparatus and method for dispensing medications",
        "id": "DOTolnIAAAAJ:ZfRJV9d4-WMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ZfRJV9d4-WMC",
        "authors": [
            "LC Hoover",
            "PR Austin",
            "SR Moore",
            "WL Kibler",
            "DL Fletcher",
            "N Sharma"
        ],
        "pub_source": "US Patent App. 14/095,190",
        "pub_date": "2015/6/4",
        "description": "A computer-based apparatus including: a cassette including a plurality of compartments for storing medications; and a dispenser including a processor and memory storing computer readable instructions and information for a plurality of medications, the information including dosages and schedules for the medications. The processor is configured to extract a medication from the plurality of medications from a compartment according to the information. The processor is configured to: receive, from a second computer remote from the apparatus, an input including a modification to the information; or create a modification to the information. The processor is configured to determine that a medication stored in the compartment is the same as the medication in the plurality of medications and extract, using the dispenser, a quantity of the stored medication from the compartment according to the modification; or terminate …",
        "citations": 1
    },
    {
        "title": "System and method to control on-demand marketing campaigns and personalized trajectories in hyper-local domains",
        "id": "DOTolnIAAAAJ:ZeXyd9-uunAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ZeXyd9-uunAC",
        "authors": [
            "S Gnanasambandam",
            "MR Furst",
            "N Sharma"
        ],
        "pub_source": "US Patent 9,020,834",
        "pub_date": "2015/4/28",
        "description": "BACKGROUNDMethods of advertising are well known in the art. Commer cials are played between television or radio programs; news papers, magazines, and other publications include printed advertisements; flyers or coupons are mailed directly to con Sumers’ homes; popup and banner ads are present on the internet, and so on. The revenue for this advertising is often derived from how many people receive or view an advertisement or advertising campaign. For example, television advertising costs are based on the popularity of the event during which the advertise ments are run, ie, advertisements run during the Super Bowl are more expensive than advertisements run during the local news. Revenue from direct mail advertising campaigns or published print ads are based on the number of mailings or issues of the printed publication sold, and on the number of coupons contained in these mailings which are …",
        "citations": 28
    },
    {
        "title": "Two-level structured overlay design for cluster management in a peer-to-peer network",
        "id": "DOTolnIAAAAJ:e5wmG9Sq2KIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:e5wmG9Sq2KIC",
        "authors": [
            "J Ni",
            "J Lin",
            "SJ Harrington",
            "N Sharma"
        ],
        "pub_source": "US Patent 9,015,342",
        "pub_date": "2015/4/21",
        "description": "A method and system for designing file replication schemes in file sharing systems consider node storage constraints and node up/down statistics, file storage costs, and file transfer costs among the nodes, user request rates for the files, and user specified file availability requirements. Based on these considerations, a systematic method for designing file replication schemes can be implemented. The method first determines the number of copies of the files to be stored in the system to achieve the desired goal (eg, to satisfy file availability requirements, or to maximize the system hit rate), and then selects the nodes at which to store the file copies to minimize the total expected cost. The file replication scheme for a peer-to-peer file sharing system in a distributed and adaptive manner can scale to a large number of nodes and files and can handle changes in the user request pattern over time.",
        "citations": 64
    },
    {
        "title": "Development and characterization of novel gastroretentive raft forming floating film of atenolol",
        "id": "DOTolnIAAAAJ:YohjEiUPhakC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:YohjEiUPhakC",
        "authors": [
            "N Sharma",
            "R Awasthi"
        ],
        "pub_source": "Indian Drugs",
        "pub_date": "2015/3",
        "description": "The aim of present work was to develop a gastroretentive floating raft forming film of atenolol using solvent casting technique. The films were characterized in terms of drug-excipient compatibility by FTIR, drug content, swelling, folding endurance, thermal behaviour by DSC, effect of processing parameters on drug state (amorphous or crystalline) by X-ray diffraction (XRD), and in vitro drug release profiles. The results confirm that there was no interaction between the drug-polymers and fusion of drug crystals within the polymer matrix. Results of XRD indicate partial dissolution of drug within the polymer matrix and suggested it was partly distributed in amorphous form throughout the film. The weight variation, thickness and folding endurance of films were in the range of 2.170±0.05 to 2.444±0.23 gm, 1.120±0.032 to 1.125±0.011 mm and 200±5 to 400±5, respectively. The pH values of the different films were between 6.8 to 7.21. After 24 h, the best selected film shows 75% and 90% of drug release in 0.1 N HCl (pH 1.2) and in phosphate buffer (pH 6.8), respectively. Based on these results it is suggested that the incorporation of drug into the hydrophilic floating film may be an appropriate strategy to improve the dissolution profile and oral bioavailability of the drug.",
        "citations": 4
    },
    {
        "title": "System and method for cloud capability estimation for user application in black-box environments using benchmark-based approximation",
        "id": "DOTolnIAAAAJ:QIV2ME_5wuYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:QIV2ME_5wuYC",
        "authors": [
            "G Jung",
            "N Sharma",
            "T Mukherjee",
            "FM Goetz"
        ],
        "pub_source": "US Patent App. 13/940,318",
        "pub_date": "2015/1/15",
        "description": "(57) ABSTRACT A system and method for providing cloud performance capa bility estimation and Supporting recommender systems by simulating bottleneck and its migration for any given com plex application in a cost-efficient way are provided. To do this, first, the system and method builds an abstract perfor mance model for an application based on the resource usage pattern of the application in an in-house test-bed (ie, a white box environment). Second, it computes relative performance scores of many different cloud configurations given from black-boxed clouds using a cloud metering system. Third, it applies the collected performance scores into the abstract performance model to estimate performance capabilities and potential bottleneck situations of those cloud configurations. Finally, using the model, it can Support recommender systems by providing performance estimates and simulations of bottlenecks …",
        "citations": 36
    },
    {
        "title": "System and method for generating and verifying targeted advertisements delivered via a printer device",
        "id": "DOTolnIAAAAJ:_kc_bZDykSQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:_kc_bZDykSQC",
        "authors": [
            "SN Gnanasambandam",
            "SJ Harrington",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,886,556",
        "pub_date": "2014/11/11",
        "description": "A system and method is provided for providing targeted advertising to a user of a printer assembly having at least one printer device and having data communication capabilities. The printer assembly may include a grid which includes a plurality of printers that share resources and workloads. The aggregator server includes a processor for receiving and storing ad generation criteria from at least one advertiser, receiving target information from at least one printer assembly, and executing a series of programmable instructions. The instructions provide for matching the received target information with stored ad generation criteria, generating ads when a match is found, and delivering ads to the printer assembly for output to a user. Delivery or use of the ad may be verified. Charges may be levied on the advertiser for verified ads and the printer assembly may be credited accordingly, eg, for subsidizing operating costs …",
        "citations": 27
    },
    {
        "title": "Performance comparison of distance and density based clustering algorithm (ddcsa) v/s normal technique to analyze power consumption and network lifetime of wireless sensor networks",
        "id": "DOTolnIAAAAJ:TFP_iSt0sucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:TFP_iSt0sucC",
        "authors": [
            "Naveen Sharma",
            "Malti Rani",
            "Anand Nayyar"
        ],
        "pub_source": "Int J Curr Eng Technol",
        "pub_date": "2014/6",
        "description": "Aggregating data of several nodes in a wireless sensor networks allows us to accurately monitor a remote environment. However, low-cost battery-powered nodes are often used to implement such networks, resulting in tight energy and communication bandwidth constraints. We have found that sensor node distances and densities are key factors in clustering. The aim of this paper is to introduce a new protocol to reduce overall power consumption, extend network life time in wireless sensor networks. In this paper, Normal Technique and Distance and Density based Clustering Algorithm (DDCSA) technique is compared on various parameters. Simulation results show a better performance of DDCSA as compared to Normal Technique",
        "citations": 4
    },
    {
        "title": "Cloud Testing: A Review Article",
        "id": "DOTolnIAAAAJ:hqOjcs7Dif8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:hqOjcs7Dif8C",
        "authors": [
            "Radhika Batra",
            "Naveen Sharma"
        ],
        "pub_source": "International Journal of Computer Science and Mobile Computing 3 (6), 314-319",
        "pub_date": "2014/6",
        "description": "Today Cloud computing is emerging as a new technology in corporate world and organization. Cloud testing is a form of software testing in which web applications use cloud computing environments (ie a\" cloud\") to handle with real-world user traffic by using various cloud technologies and solutions. Cloud computing leads an opportunity in offering testing as a service (TaaS) for SaaS and clouds. But at the same time, it causes new issues, challenges and needs in software testing, particular in the field of 1) testing clouds and 2) cloud-based applications. In this paper we discus some basic concepts of cloud testing, its type and major issues and challenges comes in this field. The paper also gives light on the benefits of cloud testing over conventional software testing.",
        "citations": 4
    },
    {
        "title": "System and method for burstiness-aware scheduling and capacity assessment on a network of electronic devices",
        "id": "DOTolnIAAAAJ:9ZlFYXVOiuMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:9ZlFYXVOiuMC",
        "authors": [
            "S Gnanasambandam",
            "N Sharma",
            "R Nagarajan"
        ],
        "pub_source": "US Patent 8,705,090",
        "pub_date": "2014/4/22",
        "description": "A system and method for establishing a burstiness metric is presented including at least one processor and a computer-readable storage medium in communication with the at least one processor, wherein the computer-readable storage medium comprises one or more programming instructions for performing the steps of: receiving information related to a plurality of tasks performed by a plurality of electronic devices based on input received from one or more users; analyzing the received information; employing an availability model to the information analyzed; and generating a schedule based on the information analyzed and the availability model by redistributing at least one task of the plurality of tasks between the plurality of electronic devices in accordance with electronic device availability and computational loads. Also, an assessment is made based on the information analyzed to determine a proportion of the …",
        "citations": 8
    },
    {
        "title": "Automated method for generating a web service composition",
        "id": "DOTolnIAAAAJ:4TOpqqG69KYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:4TOpqqG69KYC",
        "authors": [
            "K Ponnavaikko",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,700,737",
        "pub_date": "2014/4/15",
        "description": "The disclosed embodiments relate to creating a web service composition from a plurality of web services. For creating the web service composition, an augmented definition of the plurality of web services is created. Based on the augmented definition and a user request, a task listing the required inputs for the plurality of web services, the required outputs of the plurality of the web services, the mapping between the output of one service to the input of the second service is computed. The task of identifying the required inputs for the plurality of web services, the required outputs of the plurality of the web services, and the mapping between the output of one service to the input of the second service is crowd sourced to crowd workers who submit their responses to an online crowd sourcing platform. The collected responses are used to generate the desired web service composition.",
        "citations": 2
    },
    {
        "title": "System and method for decentralized job scheduling and distributed execution in a network of multifunction devices",
        "id": "DOTolnIAAAAJ:hFOr9nPyWt4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:hFOr9nPyWt4C",
        "authors": [
            "SN Gnanasambandam",
            "RJS Jacques",
            "H Liu",
            "BC Lyon",
            "MP Kehoe",
            "..."
        ],
        "pub_source": "US Patent 8,661,129",
        "pub_date": "2014/2/25",
        "description": "BACKGROUNDThe present disclosure relates generally to job scheduling and distributed execution in a network of multi-functional devices (MFDs). In particular, the present disclosure relates to decentralized job Scheduling and distributed execution in a network of MFDs using historical information based on a local view and/or a global view of several device or network related attributes (such as performance of nodes, reliability, configuration, etc.) of the MFD grid. Some jobs submitted to an MFD, such as large optical character recognition (OCR) jobs, are very resource and time consuming and often take several minutes to complete, par ticularly for complex documents. The MFD receiving the job may not have the best resources to complete the job relative to other MFDs that it is networked to. In some environments, users initiate large OCR jobs and simply walk away, returning several minutes later to see if the job …",
        "citations": 12
    },
    {
        "title": "Method and system for collaborative self-organization of devices",
        "id": "DOTolnIAAAAJ:mVmsd5A6BfQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:mVmsd5A6BfQC",
        "authors": [
            "SN Gnanasambandam",
            "TE Thieret",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,645,514",
        "pub_date": "2014/2/4",
        "description": "Methods and systems for automatically organizing devices in a network are disclosed. Information may be collected for a plurality of devices in a predetermined area over a predetermined period of time. The information may include device location information and device information for one or more user groups. Each user group may include one or more users. An average preference for each user group may be determined for each device based on the device usage information. The plurality of devices may be organized automatically into a plurality of clusters based on at least the determined average preferences. Each cluster may include one or more devices.",
        "citations": 49
    },
    {
        "title": "Method and system for generating a workflow to produce a dimensional document",
        "id": "DOTolnIAAAAJ:4DMP91E08xMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:4DMP91E08xMC",
        "authors": [
            "FM Goetz",
            "LC Moore",
            "M Sampath",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,643,874",
        "pub_date": "2014/2/4",
        "description": "A method and system generate a workflow for the production of a three-dimensional document. A knowledge base contains production rules for several dimensional documents. The production rules relate to a plurality of jobs, ie, units of work involved in the production of a dimensional document. The rules also identify human and/or mechanical resources required to complete each job. The system receives, from multiple service providers, capability information corresponding to each service provider's available resources. The capability information is associated with the production rules and stored in the knowledge base. When a user selects a dimensional document to be produced, the system selects appropriate production rules for the document, accesses the associated capability information, and automatically generates a workflow for the document. The system distributes various jobs in the workflow among at …"
    },
    {
        "title": "A comprehensive review of distance and density based cluster head selection schemes",
        "id": "DOTolnIAAAAJ:bEWYMUwI8FkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:bEWYMUwI8FkC",
        "authors": [
            "Naveen Sharma",
            "A Nayyar"
        ],
        "pub_source": "International Journal of Computer Science and Mobile Computing 3, 204-211",
        "pub_date": "2014",
        "description": "One of the most important consideration in designing sensor nodes in a wireless sensor network for prolonging the network lifetime by minimizing energy consumption. The number of cluster and the distribution of cluster heads (CHs) always make a major impact on the network performance. Distance and Density based clustering algorithm can greatly improve energy efficiency of WSNs because it adopts a multi-hop communication in each cluster. Besides, the neighborhood of the sink node (SN) will perform direct transmission to relieve the workload of CHs. Load balancing and scalability are very crucial factors which plays important role in the selection of Cluster head. In this paper we present the study of different distance and density based cluster head selection algorithms for wireless sensor networks and compared them on various parameters.",
        "citations": 5
    },
    {
        "title": "Fault management for a printing system",
        "id": "DOTolnIAAAAJ:KlAtU1dfN6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:KlAtU1dfN6UC",
        "authors": [
            "M Sampath",
            "MPJ Fromherz",
            "DG Lysy",
            "RS Minhas",
            "N Sharma",
            "..."
        ],
        "pub_source": "US Patent 8,607,102",
        "pub_date": "2013/12/10",
        "description": "A printing system includes a plurality of print media processing modules which transfer print media therebetween during printing and a fault management agent associated with each of the modules for acquiring fault-related data from the respective processing module. A fault management system is in communication with the fault management agents and receives fault-related data from the fault management agents. The fault management system processes the fault related data to identify faults in the system, such as when a first of the processing modules is a cause of fault-related data acquired in a second of the processing modules. When a fault is identified, a reconfiguration agent may reconfigure the printing system to mitigate an impact of at least one of the identified faults.",
        "citations": 32
    },
    {
        "title": "Systems and methods for distributing work among a plurality of workers",
        "id": "DOTolnIAAAAJ:dhFuZR0502QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:dhFuZR0502QC",
        "authors": [
            "WL Kibler",
            "YA Sun",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,583,721",
        "pub_date": "2013/11/12",
        "description": "Systems and methods for distributing work among a plurality of workers in a distributed environment using a granularity determinator module to determine a desired granularity of a data to be worked-on whereby each one of a plurality of document subcomponents individually maintains a level of security based on a security policy. The data is separated out into a plurality of subcomponents which are transmitted to respective workers. A consolidator module can be used to consolidate subcomponents worked on by the respective workers into one worked-on document or file for validation purposes. The system and methods provide an efficient and cost effective way to distribute confidential work to workers without compromising the confidentiality of the information contained in the document or file being worked on.",
        "citations": 8
    },
    {
        "title": "System and method for automated handling of document processing workload",
        "id": "DOTolnIAAAAJ:qxL8FJ1GzNcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:qxL8FJ1GzNcC",
        "authors": [
            "S Gnanasambandam",
            "N Sharma",
            "S Kailasam"
        ],
        "pub_source": "US Patent 8,493,598",
        "pub_date": "2013/7/23",
        "description": "A system for controlling flow of a plurality of raw print jobs from at least one user to at least one printer in a print-shop, the system including: a print job queue adapted to received the plurality of raw print jobs; a controller adapted to monitor the plurality of raw print jobs; an estimation module comprising at least one of an estimated execution time module and an estimated network overhead module, wherein the estimation module is adapted to estimate a time to process each of the plurality of raw print jobs and the estimated network overhead module is adapted to estimate a time to transmit each of the plurality of raw print jobs to an external cloud and receive each of the plurality of raw print jobs from the external cloud; a scheduler adapted to transmit each of the plurality of raw print jobs to the external cloud or the internal cloud based upon at least one of the time to process each of the plurality of raw print jobs and the …"
    },
    {
        "title": "Cloud capability estimation and recommendation in black-box environments using benchmark-based approximation",
        "id": "DOTolnIAAAAJ:eQOLeE2rZwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:eQOLeE2rZwMC",
        "authors": [
            "Gueyoung Jung",
            "Naveen Sharma",
            "Frank Goetz",
            "Tridib Mukherjee"
        ],
        "pub_source": "2013 IEEE Sixth International Conference on Cloud Computing",
        "pub_date": "2013/6/28",
        "description": "As cloud computing has become popular and the number of cloud providers has proliferated over time, the first barrier to cloud users will be how to accurately estimate performance capabilities of many different clouds and then, select a right one for given complex workload based on estimates. Such cloud capability estimation and selection can be a big challenge since most clouds can be considered as black-boxes to cloud users by abstracting underlying infrastructures and technologies. This paper describes a cloud recommender system to recommend an optimal cloud configuration to users based on accurate estimates. To achieve this, our system generates the capability vector that consists of relative performance scores of resource types (e.g., CPU, memory, and disk) estimated for given user workload using benchmarks. Then, a search algorithm has been developed to identify an optimal cloud configuration …",
        "citations": 9
    },
    {
        "title": "Cloudadvisor: A recommendation-as-a-service platform for cloud configuration and pricing",
        "id": "DOTolnIAAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Gueyoung Jung",
            "Tridib Mukherjee",
            "Shruti Kunde",
            "Hyunjoo Kim",
            "Naveen Sharma",
            "Frank Goetz"
        ],
        "pub_source": "2013 IEEE Ninth World Congress on Services",
        "pub_date": "2013/6/28",
        "description": "The proliferation of cloud computing can imply a barrier to cloud users. When deploying their complex workloads into clouds, cloud users are typically overwhelmed by too many technical choices. Moreover, underlying technologies and pricing mechanisms of clouds vary and are not transparent to them. Consequently, it is hard for cloud users to capture the monetary and performance implications of their workload deployments. This paper introduces a cloud recommendation platform, referred to as Cloud Advisor. It allows cloud users to explore various cloud configurations recommended based on user preferences such as budget, performance expectation, and energy saving for given workload. Then, it allows cloud users to compare offered price and performance with other clouds' offerings for the workload. By providing transparent comparisons, it can also support cloud provider to develop a competitive pricing …",
        "citations": 69
    },
    {
        "title": "System and method for policy-driven file segmentation and inter-cloud file storage and retrieval",
        "id": "DOTolnIAAAAJ:UebtZRa9Y70C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:UebtZRa9Y70C",
        "authors": [
            "SN Gnanasambandam",
            "N Sharma",
            "WL Kibler"
        ],
        "pub_source": "US Patent 8,464,075",
        "pub_date": "2013/6/11",
        "description": "According to an embodiment of the present disclosure, a file storage system includes one or more document input devices and a processor communicating with both a memory 35 and the one or more document input devices. The processor executes a software application stored on the memory to separate a sensitive portion of a document from an insensitive portion of a document. A first type of cloud storage includes one or more storage devices in operable communication with 40 the one or more document input devices. The first type of cloud storage is configured to store one or both of the sepa rated portions with a level of encryption agreed upon by a user. A second type of cloud storage includes one or more storage devices in operable communication with the one or 45 more document input devices. The second type of cloud Stor age is configured to store the insensitive portion of a docu ment based on a …",
        "citations": 49
    },
    {
        "title": "Optimizing ordered throughput using autonomic cloud bursting schedulers",
        "id": "DOTolnIAAAAJ:zYLM7Y9cAGgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:zYLM7Y9cAGgC",
        "authors": [
            "Sriram Kailasam",
            "Nathan Gnanasambandam",
            "Janakiram Dharanipragada",
            "Naveen Sharma"
        ],
        "pub_source": "IEEE Transactions on Software Engineering",
        "pub_date": "2013/5/27",
        "description": "Optimizing ordered throughput not only improves the system efficiency but also makes cloud bursting transparent to the user. This is critical from the perspective of user fairness in customer-facing systems, correctness in stream processing systems, and so on. In this paper, we consider optimizing ordered throughput for near real-time, data-intensive, independent computations using cloud bursting. Intercloud computation of data-intensive applications is a challenge due to large data transfer requirements, low intercloud bandwidth, and best-effort traffic on the Internet. The system model we consider is comprised of two processing stages. The first stage uses cloud bursting opportunistically for parallel processing, while the second stage (sequential) expects the output of the first stage to be in the same order as the arrival sequence. We propose three scheduling heuristics as part of an autonomic cloud bursting …",
        "citations": 32
    },
    {
        "title": "Method and system for automatic sharing and custom user interface features in a fleet of multi-function devices",
        "id": "DOTolnIAAAAJ:Zph67rFs4hoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:Zph67rFs4hoC",
        "authors": [
            "WL Kibler",
            "AM Lorenzo",
            "RJS Jacques",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,411,304",
        "pub_date": "2013/4/2",
        "description": "A method and system for enabling automatic service sharing and custom user interface features in a fleet of multi-function devices. EIP (Extensible Interface Platform) services can be registered via a peer-to-peer discovery subsystem associated with a multi-function device grid infrastructure. EIP service registration information can be submitted and stored in the grid infrastructure. The multi-function devices can be equipped with an enterprise EIP client, which can query the discovery subsystem and apply a corporate policy. The discovery subsystem detects the optimal instance of the service based on loading and availability factors and then returns a reference with respect to the services that allows access to enhanced services. Such an approach enables a fleet of multi-function devices to dynamically discover EIP services and auto populate service options to provide increased capability, reduced complexity, and …",
        "citations": 3
    },
    {
        "title": "Iron deficiency without anaemia: Do not wait for the haemoglobin to drop?",
        "id": "DOTolnIAAAAJ:eq2jaN3J8jMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:eq2jaN3J8jMC",
        "authors": [
            "Deepa Rattehalli",
            "Lucy Pickard",
            "Chris Tselepis",
            "Naveen Sharma",
            "Tariq H Iqbal"
        ],
        "pub_source": "Health Policy and Technology 2 (1), 45-58",
        "pub_date": "2013/3/1",
        "description": "Iron is the most common metal in the earth's crust yet iron deficiency is the most common nutritional deficiency found in humans. The clinical causes and consequences of iron deficiency anaemia are well established. However, iron deficiency without anaemia is a less well described phenomenon. Here we review the available literature examining the deleterious effects of iron deficiency without anaemia on cognitive development and physical performance. We go on to summarise the available evidence for the effects of iron supplementation on cognition and performance with emphasis of a beneficial effect on performance in heart failure patients.",
        "citations": 16
    },
    {
        "title": "Method and system for a distributed file system based on user behaviors and user locales",
        "id": "DOTolnIAAAAJ:3fE2CSJIrl8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:3fE2CSJIrl8C",
        "authors": [
            "SN Gnanasambandam",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,364,728",
        "pub_date": "2013/1/29",
        "description": "A method and system including a plurality of multifunction devices (MFDs), the method and system further including a storage station having geographically separated MFDs for permitting users to store information generated by the plurality of MFDs in operable communication with the locale aware DFS; wherein the information is stored on a plurality of storage stations based on a weighted undirected graph generated from a plurality of dynamically monitored user behaviors, required level of replications, and selection rules to pick the points of storage.",
        "citations": 14
    },
    {
        "title": "Personalization of event participation in mobile neighborhoods",
        "id": "DOTolnIAAAAJ:aqlVkmm33-oC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:aqlVkmm33-oC",
        "authors": [
            "AM Lorenzo",
            "H Liu",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,344,892",
        "pub_date": "2013/1/1",
        "description": "According to aspects illustrated herein, there is provided a method for personalization of event participation. The method includes determining when a visitor enters a first one of a plurality of defined wireless areas in response to a detec tion of an identifier associated with a personal portable wire less device by a first communication node in the first one of the plurality of defined wireless areas. The portable wireless device is associated with the visitor. The method also includes recording user activities of the visitor within the first one of the plurality of defined wireless areas using the first commu nication node and determining an interest of the visitor in response to the user activities in the first one of the plurality of defined wireless areas. The interest is used to customize the event for the visitor.According to other aspects illustrated herein, there is pro vided a system for personalizing event participation. The system …"
    },
    {
        "title": "System and method for communicating with a network of printers using a mobile device",
        "id": "DOTolnIAAAAJ:kNdYIx-mwKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:kNdYIx-mwKoC",
        "authors": [
            "H Liu",
            "A Lorenzo",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,341,214",
        "pub_date": "2012/12/25",
        "description": "A mobile client coupled to a network and a method for the mobile client to interact with nodes, including printer devices, which are coupled to the network, are provided. One or more respective nodes includes a software application executable by a host processor associated with the respective node on a software platform executed by the host processor. The application can interact with one of the printer devices to cause the printer device to perform a function. The mobile client includes an software platform executable by its processor for discovering the applications. The discovering of an application includes ascertaining that the application is available for execution and having the ability to activate the application.",
        "citations": 13
    },
    {
        "title": "Method and system for automatically providing for multi-point document storing, access, and retrieval",
        "id": "DOTolnIAAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:qjMakFHDy7sC",
        "authors": [
            "RJS Jacques",
            "H Liu",
            "SN Gnanasambandam",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,339,639",
        "pub_date": "2012/12/25",
        "description": "2. Background of the Related Art In general, a multifunction device (MFD) operates as a plurality of different imaging devices, including, but not lim ited to, a printer, copier, fax machine, and/or scanner. In recent years the basic office copier has evolved into what can be referred to as a MFD. With digital technology, a machine with the basic outward appearance of a traditional copier can perform at least the additional functions of printing docu ments Submitted in digital form over a network, sending and receiving messages via facsimile, recording hard-copy origi nal images in digital form and sending the resulting data over a network, Such as in electronic mail and/or recording hard copy original images in digital form on a compact disc or equivalent medium.In the area of digital printing and copying, there has been a growth in demand for MFDs. Such MFD devices may assume the form of an arrangement in which a …",
        "citations": 13
    },
    {
        "title": "Applications of artificial neural network in solar thermal systems: a review",
        "id": "DOTolnIAAAAJ:q3CdL3IzO_QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:q3CdL3IzO_QC",
        "authors": [
            "Naveen Sharma",
            "Manish Kumar Chauhan",
            "Rajesh Kumar"
        ],
        "pub_source": "Proc. of the National Conference on Trends and Advances in Mechanical …",
        "pub_date": "2012/10/19",
        "description": "Artificial intelligence (AI) techniques offer an alternative way to tackle complex and ill-defined problems to conventional techniques. They have biologically inspired computer programs design to simulate in such a way as human brain processes information. They can congregate acquaintance by identifying the patterns and relationships in data and learn through experience and able to handle noisy, incomplete data, non linear problems and prediction of data. ANNs have been the potential of combining and incorporating both literaturebased and experimental data to solve complicated practical problems. They have been found application in various areas like control, forecasting, medicine, pattern recognition, manufacturing, optimization, signal processing and social/psychological sciences and are becoming more and more popular nowadays. The current review work throw light on the application of the AI-techniques in solar energy systems; for modelling and design of mainly solar air heater, solar water heater and solar radiation estimation. Published literature incorporated in this review work shows the potential of ANNs as a design tool for the optimal solar energy systems.",
        "citations": 5
    },
    {
        "title": "System and method providing for resource exclusivity guarantees in a network of multifunctional devices with preemptive scheduling capabilities",
        "id": "DOTolnIAAAAJ:7PzlFSSx8tAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:7PzlFSSx8tAC",
        "authors": [
            "SN Gnanasambandam",
            "WL Kibler",
            "N Sharma"
        ],
        "pub_source": "US Patent 8,281,312",
        "pub_date": "2012/10/2",
        "description": "A system and method for enabling automated task preemption, including a plurality of multifunctional devices having a plurality of functional capabilities; and a processing module configured to:(i) separate the tasks requiring the plurality of functional capabilities into the tasks requiring a first category of capabilities and the tasks requiring a second category of capabilities, where the tasks requiring the first category of capabilities has a higher processing priority than the tasks requiring the second category of capabilities; and (ii) selectively process the tasks requiring the first category of capabilities before the tasks requiring the second category of capabilities regardless of arrival times of the tasks requiring the plurality of capabilities; wherein the tasks requiring the second category of capabilities that are preempted by the tasks requiring the first category of capabilities are rescheduled to be completed within a …",
        "citations": 6
    },
    {
        "title": "Design and evaluation of decentralized online clustering",
        "id": "DOTolnIAAAAJ:UeHWp8X0CEIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:UeHWp8X0CEIC",
        "authors": [
            "Andres Quiroz",
            "Manish Parashar",
            "Nathan Gnanasambandam",
            "Naveen Sharma"
        ],
        "pub_source": "ACM Transactions on Autonomous and Adaptive Systems (TAAS)",
        "pub_date": "2012/10/1",
        "description": "Ensuring the efficient and robust operation of distributed computational infrastructures is critical, given that their scale and overall complexity is growing at an alarming rate and that their management is rapidly exceeding human capability. Clustering analysis can be used to find patterns and trends in system operational data, as well as highlight deviations from these patterns. Such analysis can be essential for verifying the correctness and efficiency of the operation of the system, as well as for discovering specific situations of interest, such as anomalies or faults, that require appropriate management actions. This work analyzes the automated application of clustering for online system management, from the point of view of the suitability of different clustering approaches for the online analysis of system data in a distributed environment, with minimal prior knowledge and within a timeframe that allows the timely …",
        "citations": 17
    },
    {
        "title": "Performance Comparison of Wireless Mobile Ad-Hoc Networks on the basis of Various Simulation Parameters",
        "id": "DOTolnIAAAAJ:u_35RYKgDlwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:u_35RYKgDlwC",
        "authors": [
            "Bharti Vermani",
            "Naveen Sharma",
            "Bhupender Yadav"
        ],
        "pub_source": "International Journal of Latest trebds in Engineering and technology",
        "pub_date": "2012/7",
        "description": "There are new challenges for routing protocols in mobile ad hoc networks (MANET) since traditional routing protocols may not be suitable for MANETs. As such, some assumptions used by these protocols are not valid in MANETs or some protocols cannot efficiently handle topology changes. The Efficient routing protocols can provide significant benefits to mobile ad hoc networks, in terms of both performance and reliability. The most popular Routing protocols are Optimized Link State Protocol (OLSR) Dynamic MANET On-demand (DYMO), Location-Aided Routing (LAR), Landmark Ad-hoc Routing Protocol (LANMAR). Despite the popularity of those protocols, research efforts have not focused much in evaluating their performance when applied to variable bit rate (VBR). In this paper we present our observations regarding the performance comparison of the above protocols in terms of packet delivery, throughput, jitter and end-to-end delay in mobile ad hoc networks. Additional analysis of other proposed protocols WRP, GPSR and FSR.",
        "citations": 3
    },
    {
        "title": "Towards simplifying and automating business process lifecycle management in hybrid clouds",
        "id": "DOTolnIAAAAJ:Se3iqnhoufwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:Se3iqnhoufwC",
        "authors": [
            "Hua Liu",
            "Yasmine Charif",
            "Gueyoung Jung",
            "Andres Quiroz",
            "Frank Goetz",
            "Naveen Sharma"
        ],
        "pub_source": "2012 IEEE 19th International Conference on Web Services",
        "pub_date": "2012/6/24",
        "description": "Business Process Management (BPM) software provides visibility into business processes in organizations of all sizes and helps increase process efficiency continuously. However, the time and effort involved in modeling, deploying and executing a business process is tremendous and as a result organizations struggle to agilely adapt business processes to dynamic business requirements. On the other hand, the growing popularity of cloud computing poses opportunities and challenges on how business processes can leverage resource outsourcing and elasticity. In light of the above, this paper presents a business process management platform that assists business analysts lacking necessary programming expertise by automating manual steps and providing guidance and recommendations to quickly and efficiently design, implement, deploy and execute business processes in a hybrid cloud environment.",
        "citations": 7
    },
    {
        "title": "Apparatus for low cost embedded platform for device-side, distributed services enablement",
        "id": "DOTolnIAAAAJ:8k81kl-MbHgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:8k81kl-MbHgC",
        "authors": [
            "MR Furst",
            "L Whitfield",
            "N Sharma",
            "RM Rockwell",
            "TE Thieret",
            "CS Fillion",
            "..."
        ],
        "pub_source": "US Patent 8,194,275",
        "pub_date": "2012/6/5",
        "description": "5,384,620 5,574,848 5,612.884 5,887,216 5,893,008 5,960, 167 6,003,065 6,167,448 6,226,097 6,233,409 6,317,748 6.427, 168 6.463, 078 6,486,966 6,496,858 6,631.407 6,782.345 6,871,163 6,922,684 6,931,546 6,947, 161 6,947,903 6,947,949 6,965,928 6,965,931 6,970,257 6,970,885 6,970,902 6,976,262 6,982,804 7,003,560 7,013,092 7,043.738 7,065,740 7,096, 194 7,111,304 7,123,608 7,126,716 7,131,124 7,146,413 7,152,039 7,187.459 7,200,601 7,213,046 7,213,231 7.219, 124 7,239,413 7,240,109 7,254,601 7,260,623 7,287,085 7,337,242 7,376,725 7,392,307 7,428,723 7.463, 373 7.466, 442 7.468, 804 7.487, 112 7,508,533 7,528,980 7,533,333 7,715,039 2001/OO27469",
        "citations": 17
    },
    {
        "title": "Apparatus for low cost embedded platform for device-side, distributed services enablement",
        "id": "DOTolnIAAAAJ:MXK_kJrjxJIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:MXK_kJrjxJIC",
        "authors": [
            "MR Furst",
            "L Whitfield",
            "N Sharma",
            "RM Rockwell",
            "TE Thieret",
            "CS Fillion",
            "..."
        ],
        "pub_source": "US Patent 8,154,741",
        "pub_date": "2012/4/10",
        "description": "A class of add-on system components providing functionality of devices, management of self-help, customization and enhancement of services for devices, and remote monitoring at significantly reduced cost. It reduces the cost of UI and greatly enhances ease-of-use by realizing that the networked system can be headless and use a browser-based UI for its platform. It embeds a Device Model Agent (DMA) and connects to the Device-Centric Services platform to offer services. Additionally, it offers customized diagnostic access for customer representatives to enable self-help service actions to be performed, unifies and manages multiple access needs to several disparate data access mechanisms, and uses largely COTS PC hardware rather than customized PWBs.",
        "citations": 45
    },
    {
        "title": "Preventing Direct Communication between a Sensor and Sink Node with the Help of Hybrid Network Topology for Energy Conservation in Wireless Sensor Network",
        "id": "DOTolnIAAAAJ:iH-uZ7U-co4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:iH-uZ7U-co4C",
        "authors": [
            "Srishti Singal",
            "Naveen Sharma"
        ],
        "pub_source": "International Journal of Computer Applications",
        "pub_date": "2012/1/1",
        "description": "Wireless Sensor Networks (WSNs) are paving a way of miniaturization of sensors and actuators by proving a way of boost in the wireless communications by constructing small sized, low power and inexpensive sensor devices that posses high-speed sensing, computational, and communication capabilities. This paper presents the combination of Hybrid Hierarchical Network Topology and Use of different Communication Techniques like Sleep & Wait: Transmission of Data and Low Power Listening: Reception/Listening. This paper proposes a system in which the setup of intermediate nodes (Parent nodes) is done to prevent direct communication between a Sensor and Sink node, which in a nutshell prevents large wait times for transmission."
    },
    {
        "title": "System and Methods to use context graphs for targeting communications",
        "id": "DOTolnIAAAAJ:ufrVoPGSRksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ufrVoPGSRksC",
        "authors": [
            "SN Gnanasambandam",
            "SJ Harrington",
            "N Sharma",
            "JN Staddon"
        ],
        "pub_source": "US Patent App. 13/109,277",
        "pub_date": "2011/11/17",
        "description": "This disclosure provides a system and method to use context graphs for targeting communications to a user of an image rendering device. According to one exemplary embodiment, the method provides targeted communications generated as a function of one or more attributes associated with a user requested printed document. The attributes are provided by accessing a context graph including a plurality of links between a plurality of entities.",
        "citations": 11
    },
    {
        "title": "Method and system for determining an average walk distance to a service",
        "id": "DOTolnIAAAAJ:LkGwnXOMwfcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:LkGwnXOMwfcC",
        "authors": [
            "SN Gnanasambandam",
            "VG Rao",
            "N Sharma"
        ],
        "pub_source": "US Patent 7,987,051",
        "pub_date": "2011/7/26",
        "description": "(54) METHOD AND SYSTEM FOR DETERMINING OTHER PUBLICATIONS ANAVERAGE WALK DISTANCE TO A Rao, VG, et al.,“Encapsulated Path Planning for Abstraction-based SERVICE Control of Multi-Vehicle Systems'. American Controls Conference,",
        "citations": 17
    },
    {
        "title": "Dimensional document production method and system",
        "id": "DOTolnIAAAAJ:W7OEmFMy1HYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:W7OEmFMy1HYC",
        "authors": [
            "FM Goetz",
            "LC Moore",
            "M Sampath",
            "N Sharma"
        ],
        "pub_source": "US Patent App. 12/642,397",
        "pub_date": "2011/6/23",
        "description": "BACKGROUND0001. The creation of a dimensional document can be a labor-intensive process. The widespread production of dimensional documents such as pop-out greeting cards, cut and-fold paper boxes, and other printed Substrates that are foldable into three-dimensional structures would increase if barriers to production were reduced. The design of a dimen sional document can require a high degree of skill, thus mak ing widespread consumer adoption difficult. On the produc tion side, print shops and other document production facilities cannot easily implement new technologies or train personnel to create and execute workflows that leverage appropriate resources to create a final piece. 0002. In addition, many print shops may not have all equipment needed to complete the production of a dimen sional document. Such facilities often need to sub-contract portions of the job to different service providers …",
        "citations": 21
    },
    {
        "title": "EFFECT OF HORIZONTAL RETENTION GROOVES ON TOOTH DENTURE BASE BOND: IN-VITRO STUDY.",
        "id": "DOTolnIAAAAJ:P5F9QuxV20EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:P5F9QuxV20EC",
        "authors": [
            "RP Luthra",
            "Renu Gupta",
            "Divy Vashisht",
            "Naveen Sharma",
            "Ranjan Gupta"
        ],
        "pub_source": "Indian Journal of Dental Sciences",
        "pub_date": "2011/6/1",
        "description": "The detachment of anterior acrylic resin teeth from maxillary dentures is an all too frequent occurrence. This detachment is commonly found at the tooth-denture base resin interface. The present study was conducted to compare & evaluate the effect of horizontal retention grooves placed on the ridge lap area of acrylic resin teeth on tooth-denture base bond. 80 maxillary central incisors of acrylic resin were selected for the study & divided into two groups of 40 each. Group-A served as a control group where no mechanical preparation of the tooth was done. In group B-horizontal groove was cut into the ridge lap area of the tooth. These teeth were attached to the wax mold & processed in standard denture base resin. Maximum force causing fracture at the interface was noted by using Universal Instron Machine. The result show that the horizontal grooves prepared on the ridge lap area of acrylic resin teeth provide …",
        "citations": 1
    },
    {
        "title": "Paper interface to an electronic record system",
        "id": "DOTolnIAAAAJ:roLk4NBRz8UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:roLk4NBRz8UC",
        "authors": [
            "NG Martin",
            "N Sharma",
            "MP Kehoe",
            "RS Jacques"
        ],
        "pub_source": "US Patent 7,936,925",
        "pub_date": "2011/5/3",
        "description": "After markings have been placed on a pre-printed form by a user who interacted with an entity, the form is scanned to produce a scan file. The scan file is analyzed to identify whether user added markings are present on machine readable selection items. The method can take a number of automated actions, depending upon which pre-printed machine readable selection items were checked by the user. For example, in response to checkbox selections, the method can obtain (read) some form of electronically storable data relating to the entity based on which of the machine readable selection items the user checked. Alternatively, in response to other checkbox selections, the method can ignore the user added markings on the machine readable selection items. In addition, in response to the checkmarks, the system can maintain only an image of the user added handwritten text. Alternatively, the system can be …",
        "citations": 14
    },
    {
        "title": "Inter-Country Variations in Economic Welfare and Economic Costs and their Relation with Economic Development: Some Evidence from 58 Countries",
        "id": "DOTolnIAAAAJ:hMsQuOkrut0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:hMsQuOkrut0C",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "Journal of Income & Wealth (The)",
        "pub_date": "2011",
        "description": "This paper aims to derive both MEW and MEC for 58 countries from their GDP figures for the year 1980 with an aim to derive inferences about: (i) inter-country variations in MEW and MEC in the countries considered; and (ii) the relation with economic development (which is always associated with increase in the level of economic activity or the GDP per capita) on the one hand and MEW and MEC on the other to answer the question “Is Growth Obsolete?”"
    },
    {
        "title": "Problems of Inefficient Routes in Network Mobility in Wireless Multihop Gateway Networks and their Resolution",
        "id": "DOTolnIAAAAJ:j3f4tGmQtD8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:j3f4tGmQtD8C",
        "authors": [
            "Neeraj Sharma",
            "Naveen Sharma",
            "Dimple Malik"
        ],
        "pub_source": "International Journal of Electronics Engineering",
        "pub_date": "2011",
        "description": "In the modern world wireless technology increasingly most popular such as in mobile phone, laptops and wireless data cards and in another types of devices. The main problem in using wireless devices is that when we move outside the range of that wireless network then we have handle the mobility. It is concept used in wireless network when wireless devices moves from one network to another network while maintaining a permanent IP addresses. There are various problems evolves in network mobility in multihop network such as handoff latency, inefficient route, power consumption etc. In this paper we are discussing inefficient route problem and their resolution also.",
        "citations": 4
    },
    {
        "title": "Optimizing service level agreements for autonomic cloud bursting schedulers",
        "id": "DOTolnIAAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Sriram Kailasam",
            "Nathan Gnanasambandam",
            "Janakiram Dharanipragada",
            "Naveen Sharma"
        ],
        "pub_source": "2010 39th International Conference on Parallel Processing Workshops",
        "pub_date": "2010/9/13",
        "description": "The practice of computing across two or more data centers separated by the Internet is growing in popularity due to an explosion in scalable computing demands and pay-as-you-go schemes offered on the cloud. While cloud-bursting is addressing this process of scaling up and down across data centers (i.e. between private and public clouds), offering service level guarantees, is a challenge for inter-cloud computation, particularly for best-effort traffic and large files. The parallel workload we address is real-time and involves inter-cloud processing and analysis of images and documents. In our production printing domain, dedicated processing/network resources are cost-prohibitive. Further, the problem is exacerbated by data intensive computing - we encounter huge file sizes atypical of intercloud parallel processing. To address these problems we propose three flavors of autonomic cloud-bursting schedulers that …",
        "citations": 51
    },
    {
        "title": "Serverless distributed monitoring and anomaly detection for a service oriented architecture",
        "id": "DOTolnIAAAAJ:Y0pCki6q_DkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:Y0pCki6q_DkC",
        "authors": [
            "S Gnanasambandam",
            "N Sharma"
        ],
        "pub_source": "US Patent 7,792,992",
        "pub_date": "2010/9/7",
        "description": "A system and method for serverless distributed monitoring anomaly detection for a service oriented architecture is pro vided. The method includes selecting a number of nodes, eg Super peers, to form an overlay network which is configured to facilitate bidirectional information flow creating a peer-to peer monitoring framework through replication chains. The method continues with mapping the overlay network to data by assigning each of the selected nodes to a data region related to its surroundings. The method continues with dis tributing the data regions among the nodes via the aforemen tioned replication chain, where each replication chain is sen sitive to the type of application that requests data duplication in monitoring the data by collecting information from each of those nodes that correspond to an assigned or distributed data region. This method may also include taking corrective action if the node detects …",
        "citations": 21
    },
    {
        "title": "Toward high performance computing in unconventional computing environments",
        "id": "DOTolnIAAAAJ:YOwf2qJgpHMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:YOwf2qJgpHMC",
        "authors": [
            "Brent Rood",
            "Nathan Gnanasambandam",
            "Michael J Lewis",
            "Naveen Sharma"
        ],
        "pub_source": "Proceedings of the 19th ACM International Symposium on High Performance Distributed Computing",
        "pub_date": "2010/6/21",
        "description": "Parallel computing on volatile distributed resources requires schedulers that consider job and resource characteristics. We study unconventional computing environments containing devices spread throughout a single large organization. The devices are not necessarily typical general purpose machines; instead, they could be processors dedicated to special purpose tasks (for example printing and document processing), but capable of being leveraged for distributed computations. Harvesting their idle cycles can simultaneously help resources cooperate to perform their primary task and enable additional functionality and services. A new burstiness metric characterizes the volatility of the high-priority native tasks. A burstiness-aware scheduling heuristic opportunistically introduces grid jobs (a lower priority workload class) to avoid the higher-priority native applications, and effectively harvests idle cycles …",
        "citations": 1
    },
    {
        "title": "Device model agent",
        "id": "DOTolnIAAAAJ:ULOm3_A8WrAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ULOm3_A8WrAC",
        "authors": [
            "N Sharma",
            "MR Furst",
            "CS Fillion",
            "W Huang",
            "MP Kehoe",
            "AM Lorenzo",
            "..."
        ],
        "pub_source": "US Patent 7,734,749",
        "pub_date": "2010/6/8",
        "description": "The Device Model Agent (DMA), the device side technology module in Device Centric Services (DCS) system, is the main focus of this invention. DMA is a thin, efficient applications/services execution environment. DMA provides an embedded services platform for enabling system management applications and services. This allows a flexible, extensible, dynamic services management module allowing networked services to be designed, added, and managed within the system without modifications to devices, DCS system, or DMA itself. While this invention specifically describes the integration of benefits from DMA into document system devices, the concepts are equally applicable in other domains. The DMA runtime environment is a thin software interface layer that resides on a document system device between the Java runtime environment and embedded web server.",
        "citations": 83
    },
    {
        "title": "Autonomic policy adaptation using decentralized online clustering",
        "id": "DOTolnIAAAAJ:WF5omc3nYNoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:WF5omc3nYNoC",
        "authors": [
            "Andres Quiroz",
            "Manish Parashar",
            "Nathan Gnanasambandam",
            "Naveen Sharma"
        ],
        "pub_source": "Proceedings of the 7th international conference on Autonomic computing",
        "pub_date": "2010/6/7",
        "description": "Policies are a powerful means of expressing high-level, goal oriented parameters to manage the behavior of systems and users, and are thus valuable tools for autonomic management. However, the autonomic management of policies is in itself a challenging problem. Particularly, their applicability is typically limited in situations where management actions depend on dynamic system properties, which require adapting policy application thresholds and parameters without modifying absolute policy definition constraints. In this paper, we propose a novel policy definition framework that enables autonomic policy adaptation and proactive policy application, based on the online analysis and characterization of system operation and feedback events. Our approach is supported by a decentralized clustering mechanism and scalable distributed communication platform that together enable the online analysis of events and …",
        "citations": 13
    },
    {
        "title": "Device model agent",
        "id": "DOTolnIAAAAJ:Tyk-4Ss8FVUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:Tyk-4Ss8FVUC",
        "authors": [
            "N Sharma",
            "MR Furst",
            "CS Fillion",
            "W Huang",
            "MP Kehoe",
            "AM Lorenzo",
            "..."
        ],
        "pub_source": "US Patent 7,647,392",
        "pub_date": "2010/1/12",
        "description": "The Device Model Agent (DMA), the device side technology module in Device Centric Services (DCS) system, is the main focus of this invention. DMA is a thin, efficient applications/services execution environment. DMA provides an embedded services platform for enabling system management applications and services. This allows a flexible, extensible, dynamic services management module allowing networked services to be designed, added, and managed within the system without modifications to devices, DCS system, or DMA itself. While this invention specifically describes the integration of benefits from DMA into document system devices, the concepts are equally applicable in other domains. The DMA runtime environment is a thin software interface layer that resides on a document system device between the Java runtime environment and embedded web server.",
        "citations": 59
    },
    {
        "title": "Physiotherapy in the management of diabetes mellitus: utility and benefits",
        "id": "DOTolnIAAAAJ:XoXfffV-tXoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:XoXfffV-tXoC",
        "authors": [
            "S Kalra",
            "B Kalra",
            "N Sharma",
            "S Sharma"
        ],
        "pub_source": "The Internet Journal of Pain, Symptom Control and Palliative Care",
        "pub_date": "2010",
        "description": "RESULTSThe maximum number of patients was aged 51-60 years (25.87%) and 41-50 years (22.37%). Female patients who presented to the clinic were younger than male subjects.The commonest presentations were neuropathic pain (43.39%), cervical symptoms (13.21%), low backache (11.05%), and knee pain (7.55%). 4.58% persons requested advice for weight and waist reduction. An almost equal number of patients (4.31%) sought counseling about exercises for increase in height (weight bearing exercises). 2.96% patients were given the treatment for general debility.",
        "citations": 7
    },
    {
        "title": "OVSF Code Assignment Schemes at the Forward Link of wcdm a Systems",
        "id": "DOTolnIAAAAJ:S16KYo8Pm5AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:S16KYo8Pm5AC",
        "authors": [
            "DS Saini",
            "N Sharma"
        ],
        "pub_source": "International Journal of Computers and Applications",
        "pub_date": "2010/1/1",
        "description": "In this paper we discuss code assignment schemes in wideband code division multiple access (WCDMA) systems based on orthogonal variable spreading factor (OVSF) codes. The OVSF codes are the limited resources in the forward link and their usage is critical for higher efficiency. The paper describes single code and multi code schemes for different requirements. In single code assignment category, adaptive code assignment (ADA) uses arrival distribution to reduce the number of code searches prior to finding a vacant candidate code. The time multiplexing in single code design makes code blocking zero with additional time slot management requirement. It provides additional benefit of handling non-quantized data rates. The next code precedence high (NCPH) scheme uses precedence numbers to make code assignment compact. The multi code scheme uses multiple codes to handle each call. Two multi …"
    },
    {
        "title": "Towards autonomic workload provisioning for enterprise grids and clouds",
        "id": "DOTolnIAAAAJ:u5HHmVD_uO8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:u5HHmVD_uO8C",
        "authors": [
            "Andres Quiroz",
            "Hyunjoo Kim",
            "Manish Parashar",
            "Nathan Gnanasambandam",
            "Naveen Sharma"
        ],
        "pub_source": "2009 10th IEEE/ACM International Conference on Grid Computing",
        "pub_date": "2009/10/13",
        "description": "This paper explores autonomic approaches for optimizing provisioning for heterogeneous workloads on enterprise grids and clouds. Specifically, this paper presents a decentralized, robust online clustering approach that addresses the distributed nature of these environments, and can be used to detect patterns and trends, and use this information to optimize provisioning of virtual (VM) resources. It then presents a model-based approach for estimating application service time using long-term application performance monitoring, to provide feedback about the appropriateness of requested resources as well as the system's ability to meet QoS constraints and SLAs. Specifically for high-performance computing workloads, the use of a quadratic response surface model (QRSM) is justified with respect to traditional models, demonstrating the need for application-specific modeling. The proposed approaches are …",
        "citations": 252
    },
    {
        "title": "Robust clustering analysis for the management of self-monitoring distributed systems",
        "id": "DOTolnIAAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:9yKSN-GCB0IC",
        "authors": [
            "Andres Quiroz",
            "Nathan Gnanasambandam",
            "Manish Parashar",
            "Naveen Sharma"
        ],
        "pub_source": "Cluster Computing",
        "pub_date": "2009/3",
        "description": "We present a decentralized algorithm for online clustering analysis used for anomaly detection in self-monitoring distributed systems. In particular, we demonstrate the monitoring of a network of printing devices that can perform the analysis without the use of external computing resources (i.e. in-network analysis). We also show how to ensure the robustness of the algorithm, in terms of anomaly detection accuracy, in the face of failures of the network infrastructure on which the algorithm runs. Further, we evaluate the tradeoff in terms of overhead necessary for ensuring this robustness and present a method to reduce this overhead while maintaining the detection accuracy of the algorithm.",
        "citations": 32
    },
    {
        "title": "Clustering analysis for the management of self-monitoring device networks",
        "id": "DOTolnIAAAAJ:YsMSGLbcyi4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:YsMSGLbcyi4C",
        "authors": [
            "Andres Quiroz",
            "Manish Parashar",
            "Nathan Gnanasambandam",
            "Naveen Sharma"
        ],
        "pub_source": "2008 International Conference on Autonomic Computing",
        "pub_date": "2008/6/2",
        "description": "The increasing computing and communication capabilities of multi-function devices (MFDs) have enabled networks of such devices to provide value-added services. This has placed stringent QoS requirements on the operations of these device networks. This paper investigates how the computational capabilities of the devices in the network can be harnessed to achieve self-monitoring and QoS management. Specifically, the paper investigates the application of clustering analysis for detecting anomalies and trends in events generated during device operation, and presents a novel decentralized cluster and anomaly detection algorithm. The paper also describes how the algorithm can be implemented within a device overlay network, and demonstrates its performance and utility using simulated as well as real workloads.",
        "citations": 10
    },
    {
        "title": "Designing file replication schemes for peer-to-peer file sharing systems",
        "id": "DOTolnIAAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Jian Ni",
            "Jie Lin",
            "Steven J Harrington",
            "Naveen Sharma"
        ],
        "pub_source": "2008 IEEE International Conference on Communications",
        "pub_date": "2008/5/19",
        "description": "Peer-to-peer (P2P) file sharing systems are becoming increasingly popular due to their flexibility and scalability. We propose a new model to design file replication schemes for P2P file sharing systems. The model introduces expected costs for serving user requests for the files which are computed from node up/down statistics. Based on the model we introduce and develop several methods to determine the sets of nodes to store copies of the files in order to optimize certain performance metrics (e.g., maximize the system hit rate, minimize the total expected cost). We verify the effectiveness of the file replication schemes via simulation. We also outline a framework to implement the file replication schemes for P2P file sharing systems in a distributed and adaptive manner. The framework scales to a large number of nodes and files and can handle user request pattern change via file migration.",
        "citations": 15
    },
    {
        "title": "Effect of plant growth regulators on fruit set, yield and fruit quality in pear cv. Baggugosha.",
        "id": "DOTolnIAAAAJ:_FM0Bhl9EiAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:_FM0Bhl9EiAC",
        "authors": [
            "N Sharma",
            "Singh Karan"
        ],
        "pub_source": "Asian Journal of Horticulture",
        "pub_date": "2008",
        "description": "This study was conducted during 2002 and 2003 in Solan, Himachal Pradesh, India. Treatments with growth regulators, ie T 1 (10 ppm GA 3), T 2 (20 ppm GA 3), T 3 (5 ppm BA), T 4 (10 ppm BA), T 5 (250 ppm promalin [BA+ GA 4+ 7]), T 6 (500 ppm promalin), T 7 (10 ppm GA 3+ 5 ppm BA), T 8 (20 ppm GA 3+ 500 ppm promalin), T 9 (10 ppm GA 3+ 250 ppm promalin), T 10 (20 ppm GA 3+ 500 ppm promalin) and T 11 (untreated control), were applied either once at full bloom or twice at full bloom and petal fall stage on Baggugosha pear trees. Combined treatment of 20 ppm GA 3+ 10 ppm BA, 10 ppm GA 3+ 5 ppm BA and 10 ppm GA 3+ 250 ppm promalin, when applied as single spray at full bloom, increased fruit set, fruit retention, yield efficiency and fruit quality. GA 3 applied alone increased fruit set but decreased fruit retention, yield efficiency and fruit size. However, there was no clear advantage of giving repeat application of growth regulator treatments at petal fall.",
        "citations": 5
    },
    {
        "title": "Intelligent system network interface architecture for document processing devices",
        "id": "DOTolnIAAAAJ:L8Ckcad2t8MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:L8Ckcad2t8MC",
        "authors": [
            "TE Thieret",
            "SP Hoover",
            "WJ Hannaway",
            "N Sharma"
        ],
        "pub_source": "US Patent 7,301,650",
        "pub_date": "2007/11/27",
        "description": "A method and apparatus is provided for operating a network based assembly for document processing when the assembly includes an intelligent Network Interface Controller (iNIC), a Document Processing Device (DPS) and a Digital Front End (DFE) for the DPS. Job data and control data communicated to the assembly through the network are communicated solely through the iNIC functioning as a threshold to the DPS assembly. The iNIC segregates any such data to identify job data that needs to be communicated to the DFE from other data that can be directly communicated to the DPS. Enhanced communication efficiency results from directly communicating control data to the DPS to avoid bottleneck communication of all data through the DFE.",
        "citations": 4
    },
    {
        "title": "Reclamation of ash ponds and cultivation of Jatropha curcas using arbuscular mycorrhiza fungi as technology demonstration for biofuel production and environmental cleaning in …",
        "id": "DOTolnIAAAAJ:9Nmd_mFXekcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:9Nmd_mFXekcC",
        "authors": [
            "N Sharma"
        ],
        "pub_source": "Expert seminar on Jatropha curcas L. Agronomy and genetics",
        "pub_date": "2007/3",
        "citations": 7
    },
    {
        "title": "Effect on germination on raised bed and sunken bed nursery in different provenances of Jatropha curcas L",
        "id": "DOTolnIAAAAJ:XD-gHx7UXLsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:XD-gHx7UXLsC",
        "authors": [
            "N Sharma"
        ],
        "pub_source": "Expert seminar on Jatropha curcas L. Agronomy and genetics",
        "pub_date": "2007/3",
        "citations": 12
    },
    {
        "title": "Agronomy: Jatropha pruning/flowering induction",
        "id": "DOTolnIAAAAJ:z_wVstp3MssC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:z_wVstp3MssC",
        "authors": [
            "N Sharma",
            "A Sarraf"
        ],
        "pub_source": "Expert seminar on Jatropha curcas L. Agronomy and genetics",
        "pub_date": "2007/3",
        "citations": 10
    },
    {
        "title": "Plantation management: activities/labour costs",
        "id": "DOTolnIAAAAJ:VLnqNzywnoUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:VLnqNzywnoUC",
        "authors": [
            "Naveen Sharma",
            "A Sarraf"
        ],
        "pub_source": "Expert seminar on Jatropha curcas L. Agronomy and genetics",
        "pub_date": "2007/3",
        "citations": 9
    },
    {
        "title": "Collaborative Self-Organization by devices providing document services-a Multi-Agent perspective",
        "id": "DOTolnIAAAAJ:0EnyYjriUFMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:0EnyYjriUFMC",
        "authors": [
            "Nathan Gnanasambandam",
            "Naveen Sharma",
            "Soundar RT Kumara",
            "Hua Liu"
        ],
        "pub_source": "2006 IEEE International Conference on Autonomic Computing",
        "pub_date": "2006/6/12",
        "description": "In a service oriented environment such as the realm of document services, the conventional notion is that of a multi-function device interacting individually with customer applications and the service-provider's offerings. Counter to this view, the key emerging idea is that of a network of Multi-Function Devices 1 (MFD) providing service as a collaborative system. This idea enables the service provider to define additional services over the collection of devices. By assuming a multi-agent perspective of this service-oriented environment, we propose an autonomic mechanism through which the collection of devices can self-organize. The self-organization is carried out in two steps - firstly, the devices assemble themselves in to a meaningful structure and subsequently configure themselves by assuming suitable roles in the distributed multi-agent system. Upon self-organization, devices may exhibit better immunity to …",
        "citations": 2
    },
    {
        "title": "Deriving inter-country welfare inferences from national income estimates: Some methodological aspects",
        "id": "DOTolnIAAAAJ:KUbvn5osdkgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:KUbvn5osdkgC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "The Journal of Income and Wealth",
        "pub_date": "2006",
        "description": "National income estimates are not reliable indicators for welfare measurement in general and for making inter-country welfare comparisons. In line with the effort of Nordhaus and Tobin the present study aims to suggest an alternative method based upon human needs to derive comparable measure of economic welfare and of economic cost by making some adjustments, modifications and supplementations to the national income estimates.",
        "citations": 3
    },
    {
        "title": "The Journal of income and wealth, Vol. 28, No. 1, January-June 2006 DERIVING INTER-COUNTRY WELFARE INFERENCES FROM NATIONAL INCOME ESTIMATES: SOME METHODOLOGICAL ASPECTS",
        "id": "DOTolnIAAAAJ:g3aElNc5_aQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:g3aElNc5_aQC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "The Journal of Income and Wealth",
        "pub_date": "2006",
        "description": "National income estimates are not reliable indicators for welfare measurement in general and for making inter-country welfare comparisons. In line with the effort of Nordhaus and Tobin the present study aims to suggest an alternative method based upon human needs to derive comparable measure of economic welfare and of economic cost by making some adjustments, modifications and supplementations to the national income estimates."
    },
    {
        "title": "Prevalence and control of pathogenic contamination in some sewage irrigated vegetable, forage and grain crops",
        "id": "DOTolnIAAAAJ:epqYDVWIO7EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:epqYDVWIO7EC",
        "authors": [
            "RK Yadav",
            "PS Minhas",
            "N Sharma",
            "PK Joshi"
        ],
        "pub_source": "Not Available",
        "pub_date": "2006",
        "description": "A total of 344 samples comprising of different vegetables, fodder and grain crops were obtained from a long-term experiment under sewage irrigation. The aerobic bacterial plate counts for vegetables, fodder and grain crops ranged between 2 · 106 and 3.5 · 107, 6 · 106 and 3 · 108, 2 · 105 and 3.8 · 1010, respectively, while the corresponding Faecal coliform ranged between <2 and 9 · 105, 9 · 102 and 2 · 105 and <2, indicating that the pathogenic loads got reduced below permissible level in the produce that was harvested after sun drying in the field itself, whereas the parts coming in direct contact were the most severely contaminated. The health hazards could be markedly lowered with adoption of some of the low cost practices such as repeated washings, exposure of the produce to sunlight and raising the crops on beds. The coliform counts in vegetables were within permissible limits by two washings with water, exposing these to sunlight for about 4 h and removing the two outmost leaves of cabbage. Also, cutting above some height from ground level (0.10 m) in sorghum reduced the pollution load in fodder crops."
    },
    {
        "title": "A Multi Agent System Framework for. NET",
        "id": "DOTolnIAAAAJ:SdhP9T11ey4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:SdhP9T11ey4C",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "University of Canberra.",
        "pub_date": "2006",
        "description": "This thesis presents an approach to modeling Multi Agent Systems (MAS). A framework and its implementation are presented as an extension to .NET. A number of definitions of agents are evaluated for the purpose of a broad understanding of the term software agent. Software agent has been defined in MAS context and its characteristics are identified and implemented. Motivation factors for building framework for MAS have been discussed. A number of existing technologies are discussed and evaluated. A number of agent systems previously developed are also being discussed in the middle part of the thesis. A model software agent has been defined and its characteristics are divided in two basic categories essential and optional. Its implementation has been distributed into different components throughout the MAS framework. Some of these characteristics are jointly implemented by a number of components …",
        "citations": 1
    },
    {
        "title": "Collaborative Self-Organization by Devices in a Service-Oriented Environment",
        "id": "DOTolnIAAAAJ:M3ejUd6NZC8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:M3ejUd6NZC8C",
        "authors": [
            "Nathan Gnanasambandam",
            "Naveen Sharma"
        ],
        "pub_source": "IIE Annual Conference. Proceedings",
        "pub_date": "2006",
        "description": "While the conventional notion of devices providing document services encompasses those that interact individually with the customer applications and the service provider's offerings, the emerging idea is that of a network of devices providing service as a collaborative system. The systemic view enables a document service to be defined over a collection of devices with some quality of service (QoS) guarantees while delivering utility to the customer. For devices to act as a collaborative system, we propose an autonomic self-organization mechanism that is based on the users' proximity to devices and their preferences.[PUBLICATION ABSTRACT]"
    },
    {
        "title": "A Multi-agent Framework for. NET",
        "id": "DOTolnIAAAAJ:NJ774b8OgUMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:NJ774b8OgUMC",
        "authors": [
            "Naveen Sharma",
            "Dharmendra Sharma"
        ],
        "pub_source": "International Conference on Knowledge-Based and Intelligent Information and Engineering Systems",
        "pub_date": "2005/9/14",
        "description": "In this paper an approach is presented to modeling Multi Agent Systems (MAS) as a framework and its implementation as an extension to .NET. The MAS characteristics are identified in the context of the proposed MAS framework. The framework is developed and implemented in VB.NET language based applications. The relevant .NET-based technologies (i.e. Remoting, Services, and Web Services) are assessed for the implementation. A prototype application for dynamic truck scheduling is presented to test theproposed MAS framework and some future research and development work is outlined.",
        "citations": 1
    },
    {
        "title": "Detection of Phytophthora ramorum in camellia leaves by isolation, ELISA, nested and real-time PCR",
        "id": "DOTolnIAAAAJ:FPJr55Dyh1AC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:FPJr55Dyh1AC",
        "authors": [
            "R Bulluck",
            "G Parra",
            "P Shiel",
            "P Berger",
            "D Kaplan",
            "W Li",
            "K Zeller",
            "L Levy",
            "J Keller",
            "M Reddy",
            "N Sharma",
            "M Dennis",
            "J Stack",
            "J Pierzynski"
        ],
        "pub_source": "Phytopathology",
        "pub_date": "2005/6",
        "description": "Phytophthora ramorum (Pr) is an invasive pathogen of more than 50 species of ornamental and forest trees and shrubs in USA, Europe, and Canada. Because the pathogen infects nursery stock, quarantine measures are currently used to prevent the spread of Pr based on detection using immunological assays such as ELISA, molecular diagnosis using PCR, and isolation onto Phytophothora-selective media. To compare the performance of these assays, a block of 300 camellia plants was chosen at a California nursery known to be infested with Pr. Disease symptoms, such as foliar lesions and leaf drop were recorded for each plant (as was the presence of moss) prior to foliar and potting medium sampling. Four-seven leaves and 500 ml medium were collected from each plant. Healthy camellia leaves were used as bait to isolate Pr from the potting medium of each plant. Leaf discs removed with a sterile paper …"
    },
    {
        "title": "Seasonal variation of clinically important blood biochemical constituents of lambs.",
        "id": "DOTolnIAAAAJ:p2g8aNsByqUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:p2g8aNsByqUC",
        "authors": [
            "PC Behera",
            "N Sharma",
            "PC Bisoi"
        ],
        "pub_source": "",
        "pub_date": "2005/5/4",
        "description": "Clinically important blood biochemical constituents were estimated in the blood of male and female sheep under one year of age during the different seasons. Animals under study were divided into 2 groups in each season and comprised of 6 lambs each: Group I- rams within the age of 6 months to one year and Group II- ewes within the age group of 6 months to one year. Significantly higher values were recorded for blood glucose in rainy and winter seasons, as well as for serum protein in rainy and summer seasons and serum creatinine in winter and summer seasons. Although higher values were obtained for cholesterol during summer, urea during winter and summer, and calcium during winter, the variations were insignificant. Sex did not have any significant influence on any of the biochemical constituents.",
        "citations": 5
    },
    {
        "title": "Strawberry scrotum",
        "id": "DOTolnIAAAAJ:b1wdh0AR-JQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:b1wdh0AR-JQC",
        "authors": [
            "Iqbal Singh",
            "Nain Singh",
            "Naveen Sharma",
            "Sarla Agarwal",
            "R Tandon"
        ],
        "pub_source": "Medknow Publications on behalf of Association of Surgeons of India",
        "pub_date": "2005/5/1",
        "description": "A 35-year-old man presented with painful scrotal swellings for the last 8 years and local itching with occasional discharge of whitish chalky material. Local examination revealed multiple diffuse nodular swellings [Figure 1] about 6 x 8 cm, arising from the anterior scrotal skin covered with multiple white, hard, stippled chalk-like excrescences (strawberry). The external genitalia and groin did not show any abnormality. Under local anesthesia, he underwent en-bloc excision of the anterior scrotal skin and primary skin closure. Histopathology revealed scrotal dermal calcinosis with areas of dystrophic calcification, epitheloid cells, foreign body giant cells, sclerosis, and partial coalescence of calcified nodules without any inflammatory reaction. Scrotal calcinosis (SC) or calcinosis cutis is the presence of calcified masses within the scrotal skin or dermis. Though commonly idiopathic [1] recent reports suggest that the basic …"
    },
    {
        "title": "The role of tumour necrosis factor-alpha in iron metabolism",
        "id": "DOTolnIAAAAJ:PELIpwtuRlgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:PELIpwtuRlgC",
        "authors": [
            "C Tselepis",
            "A Laftah",
            "MJ Brookes",
            "N Sharma",
            "S Hughes",
            "TH Iqbal"
        ],
        "pub_source": "GASTROENTEROLOGY",
        "pub_date": "2005/4/1"
    },
    {
        "title": "A role for TNF-alpha in iron metabolism",
        "id": "DOTolnIAAAAJ:eJXPG6dFmWUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:eJXPG6dFmWUC",
        "authors": [
            "A Laftah",
            "N Sharma",
            "MJ Brookes",
            "S Hughes",
            "T Iqbal",
            "C Tselepis"
        ],
        "pub_source": "GUT",
        "pub_date": "2005/4/1"
    },
    {
        "title": "Method and apparatus for enabling distributed subscription services, supplies maintenance, and device-independent service implementation",
        "id": "DOTolnIAAAAJ:u-x6o8ySG0sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:u-x6o8ySG0sC",
        "authors": [
            "M Furst",
            "R Rockwell",
            "N Sharma",
            "C Fillion",
            "RS Jacques",
            "W Huang",
            "..."
        ],
        "pub_source": "US Patent App. 10/686,751",
        "pub_date": "2004/7/1",
        "description": "Subscribe to and run device-centric Services. A device model agent allows the devices to interact with Service hosts of Service providers to automate Supplies maintenance, user help, and Services Subscription and deployment. The device model agent can be embedded in the devices, can be deployed in an add-on component connected to the device, or can be run by a separate machine as a proxy. The device model agent provides a run time environment for Services available to the device, but with a common interface and a common Structure So that Services can be written once and run in the device model agent in Virtually any deployment.",
        "citations": 79
    },
    {
        "title": "Method for low cost embedded platform for device-side distributed services enablement",
        "id": "DOTolnIAAAAJ:qUcmZB5y_30C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:qUcmZB5y_30C",
        "authors": [
            "M Furst",
            "L Whitfield",
            "N Sharma",
            "R Rockwell",
            "T Thieret",
            "C Fillion",
            "W Huang",
            "..."
        ],
        "pub_source": "US Patent App. 10/686,824",
        "pub_date": "2004/6/10",
        "description": "A class of add-on system components providing functionality of devices, management of self-help, customization and enhancement of services for devices, and remote monitoring at significantly reduced cost. It reduces the cost of UI and greatly enhances ease-of-use by realizing that the networked system can be headless and use a browser-based UI for its platform. It embeds a Device Model Agent (DMA) and connects to the Device-Centric Services platform to offer services. Additionally, it offers customized diagnostic access for customer representatives to enable self-help service actions to be performed, unifies and manages multiple access needs to several disparate data access mechanisms, and uses largely COTS PC hardware rather than customized PWBs.",
        "citations": 25
    },
    {
        "title": "Selective depopulation and/or repopulation of a full color image forming device",
        "id": "DOTolnIAAAAJ:5nxA0vEk-isC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:5nxA0vEk-isC",
        "authors": [
            "HM Grenek",
            "NG Sharma",
            "DG Wilcox"
        ],
        "pub_source": "US Patent 6,671,479",
        "pub_date": "2003/12/30",
        "description": "The selective depopulation and/or repopulation of a full color image-next-to-image or image-on-image print engine for generating monochrome and/or highlight color images, utilizing a multiplicity of functionally-equivalent substations in tandem to compensate for the increase in printing speed.",
        "citations": 5
    },
    {
        "title": "Hematospermia (ejaculatory duct calculus)–an unusual cause",
        "id": "DOTolnIAAAAJ:tuHXwOkdijsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:tuHXwOkdijsC",
        "authors": [
            "Iqbal Singh",
            "Naveen Sharma",
            "Nain Singh",
            "Rajesh Gangas"
        ],
        "pub_source": "International urology and nephrology",
        "pub_date": "2003/12",
        "description": "Hematospermia is a common harmless condition that invokes a lot of anxiety to the patient.Calculous obstruction of the ejaculatory ductis an unusual cause of hematospermia. Wereport one such case of hemospermia due toan ejaculatory duct calculus that was diagnosedwith TRUS. An endoscopic approach should beattempted to manage all such cases.",
        "citations": 17
    },
    {
        "title": "Effect of anticoagulants on the blood enzymes of the Black Bengal goat.",
        "id": "DOTolnIAAAAJ:u9iWguZQMMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:u9iWguZQMMsC",
        "authors": [
            "H Pattnaik",
            "PC Bisoi",
            "PC Behera",
            "N Sharma"
        ],
        "pub_source": "",
        "pub_date": "2003/11/26",
        "description": "Blood samples were collected from healthy female Black Bengal goats, and stored in 5 different vials containing different anticoagulants. In the first group (group I), blood was allowed to clot at room temperature and clear serum was collected. Groups II, III, IV and V consisted of heparinized plasma, EDTA plasma, citrate plasma and oxalate plasma. Results showed that the use of anticoagulants resulted in minor to major alterations in the activities of alanine aminotransferase (ALAT), aspartate aminotransferase (ASAT), alkaline phosphatase (ALP), acid phosphatase (ACP) and lactate dehydrogenase (LDH). Significant inhibitions in the activities of ALAT, ALP and LDH by the anticoagulants EDTA, citrate and oxalate were observed. On the other hand, the use of EDTA and oxalate resulted in a significant increase in the ACP activity. Heparin produced minor alterations to enzyme activities."
    },
    {
        "title": "FULL & FREE DOWNLOAD LINK IS AVAILABLE FROM:-",
        "id": "DOTolnIAAAAJ:VaXvl8Fpj5cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:VaXvl8Fpj5cC",
        "authors": [
            "I Singh",
            "Naveen Sharma",
            "Nain Singh"
        ],
        "pub_source": "J Urol",
        "pub_date": "2003/8",
        "description": "FULL FREE DOWNLOAD LINK IS AVAILABLE FROM:- http://link.springer.com/content/pdf/10.1023%2FA%3A1015230510 \n071 Page 1 FULL FREE DOWNLOAD LINK IS AVAILABLE FROM:http://link.springer.com/content/pdf/10.1023%2FA%3A1015230510 \n071 Comment in Efficacy and outcome of surgical intervention in patients with \nnephrolithiasis and chronic renal failure. [J Urol. 2003] J Urol. 2003 Aug;170(2 Pt 1):685-6. \nEfficacy and outcome of surgical intervention in patients with nephrolithiasis and chronic \nrenal failure. Clayman RV. Comment on : Efficacy and outcome of surgical intervention in \npatients with nephrolithiasis and chronic renal failure. [Int Urol Nephrol. 2001] PMID: \n14601588 [PubMed] Scholarly articles for Efficacy and outcome of surgical intervention in \npatients with nephrolithiasis and chronic renal failure. … of surgical intervention in patients \nwith nephrolithiasis … - Singh - Cited by 13 Efficacy …"
    },
    {
        "title": "Upregulation of duodenal protein expression of divalent metal transporter 1 protein in untreated coeliac disease may be due to a switch to a more mature mucosal epithelial …",
        "id": "DOTolnIAAAAJ:JoZmwDi-zQgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:JoZmwDi-zQgC",
        "authors": [
            "Jeffrey R Butterworth",
            "Judy Bastin",
            "Alain Townsend",
            "Naveen Sharma",
            "Christopher Tselepis",
            "Brian Cooper",
            "Tariq Iqbal"
        ],
        "pub_source": "Gastroenterology",
        "pub_date": "2003",
        "description": "Upregulation of duodenal protein expression of divalent metal transporter 1 protein in untreated \ncoeliac disease may be due to a switch to a more mature mucosal epithelial phenotype × \nClose The Infona portal uses cookies, ie strings of text saved by a browser on the user's \ndevice. The portal can access those files and use them to remember the user's data, such as \ntheir chosen settings (screen view, interface language, etc.), or their login data. By using the \nInfona portal the user accepts automatic saving and using this information for portal operation \npurposes. More information on the subject can be found in the Privacy Policy and Terms of \nService. By closing this window the user confirms that they have read the information on \ncookie usage, and they accept the privacy policy and the way cookies are used by the portal. \nYou can change the cookie settings in your browser. I accept Polski English Login or register …"
    },
    {
        "title": "How best to assess symptomatic outcomes of therapy in gastro-oesophageal reflux disease trials: A systematic review",
        "id": "DOTolnIAAAAJ:5ugPr518TE4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:5ugPr518TE4C",
        "authors": [
            "Naveen Sharma",
            "Clare Donnellan",
            "Cathy Preston",
            "Brendan Delaney",
            "G Duckett",
            "Paul Moayyedi"
        ],
        "pub_source": "",
        "pub_date": "2003/1/1",
        "description": "How best to assess symptomatic outcomes of therapy in gastro-oesophageal reflux disease \ntrials: a systematic review — University of Birmingham Skip to main navigation Skip to search \nSkip to main content University of Birmingham Home University of Birmingham Logo Help & \nFAQ Home Research output Profiles Research units Projects Activities Datasets Equipment \nPrizes Press/Media Search by expertise, name or affiliation How best to assess symptomatic \noutcomes of therapy in gastro-oesophageal reflux disease trials: a systematic review N \nSharma, C Donnellan, C Preston, Brendan Delaney, G Duckett, Paul Moayyedi Research \noutput: Contribution to conference (unpublished) › Abstract Overview Original language English \nPages A45 Publication status Published - 1 Jan 2003 Cite this APA Author BIBTEX Harvard \nStandard RIS Vancouver Powered by Pure, Scopus & Elsevier Fingerprint Engine™ © 2023 …"
    },
    {
        "title": "Influence of chemical and hand thinning on maturity, quality and colour of fruits in Redhaven peaches.",
        "id": "DOTolnIAAAAJ:FAceZFleit8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:FAceZFleit8C",
        "authors": [
            "N Sharma",
            "Bir Singh Bir Singh",
            "RP Singh"
        ],
        "pub_source": "",
        "pub_date": "2001",
        "description": "In experiments conducted during 1996/97 in Sirmour, Himachal Pradesh, India, 6-year-old trees of peach cv. Redhaven were subjected to chemical thinning, with NAA (20, 40 and 60 ppm) and ethrel [ethephon] (100, 200 and 300 ppm) and to hand thinning at 3, 4, 5 and 6 fruitlets per shoot at the 14- to 15-mm fruitlet stage to enhance the maturity and quality of fruits. Hand thinning at 3, 4 and 5 fruitlets per shoot and chemical thinning with ethrel at 200 and 300 ppm markedly affected thinning. All concentrations of ethrel advanced fruit harvesting by 3 days. The size, weight and volume of fruits were higher from trees hand-thinned at 3-5 fruitlets per shoot and from trees chemically thinned with ethrel at 200-300 ppm and NAA at 60 ppm. Fruit firmness was, however, highest in the unthinned control. High pulp:stone ratio in fruits was observed with hand thinning at 3, 4 and 5 fruitlets per shoot and chemical thinning …",
        "citations": 4
    },
    {
        "title": "Abstract Device Platform",
        "id": "DOTolnIAAAAJ:IWHjjKOFINEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:IWHjjKOFINEC",
        "authors": [
            "Naveen Sharma",
            "Xin Xu",
            "Dipak Pravin"
        ],
        "pub_source": "Research Challenges, Academia/Industry Working Conference on",
        "pub_date": "2000/4/1",
        "description": "Abstract Device PlatformNaveen Sharma, Xin Xu, and Dipak PravinNaveen. Sharma@ crt. xerox. com, Xxu@ parc. xerox. com, Dipak. Pravin@ usa. xerox. comXerox Corporation, Mail Stop 147-17A, 800 Phillips RoadWebster NY 14580EXTENDED ABSTRACTThere is a rapid growth in mobile computing whichallows mobile applications to access and manipulateinformation from anywhere at any time. In our viewthis growth is primarily driven by two factors: 1. the evolution of mobile hardware such as mobilephones, laptops, and pagers, and2. the explosion of Internet and emerging wirelessnetwork infrastructureFor businesses it is now conceivable to deliver aplethora of value-added services and applications eitherremotely on demand or by deploying them within thecustomer’s Intranet. However, for businesses theadoption of remote service and application deploymentis more attractive for several reasons. First, it …"
    },
    {
        "title": "Quality changes in buffalo meat and liver during storage in ice pack",
        "id": "DOTolnIAAAAJ:b0M2c_1WBrUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:b0M2c_1WBrUC",
        "authors": [
            "N Sharma",
            "AR Sen"
        ],
        "pub_source": "Indian Veterinary Journal (India)",
        "pub_date": "2000",
        "description": "Buffalo meat has vast potential to cope up with increasing demand of meat for internal consumption as well as for export since good market for buffalo meat exists in gulf countries. Depending on the type of trade and length of journey, meat is transported by road in insulated or refrigerated vechicles. Usually dressed carcasses and offals are packed with ice and transported to processing plants. Various factors are responsible for changes in sensory and microbial quality of fresh meat during transporation. Lanier (1978) revealed that discoloration of insufficiently chilled beef occurring in transit. Bell and Garout (1994) conducted transport and storage trials of vaccum packaged beef carcasses and observed that beef of normal pH can be preserved upto 90 days. Sharma (1994) reported on quality changes in buffalo meat transportation under ice and changes due to repeated freezing and thawing of meat. The Present study was conducted to study the physio-chemical, microbial and sensory changes of buffalo meat and liver during storage in ice pack.",
        "citations": 1
    },
    {
        "title": "Effect of plane of nutrition on nutrient utilization in pregnant buffalo heifers.",
        "id": "DOTolnIAAAAJ:a0OBvERweLwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:a0OBvERweLwC",
        "authors": [
            "TR Chauhan",
            "ND Sharma",
            "SS Dahiya",
            "BS Punia",
            "OK Hooda",
            "D Lall"
        ],
        "pub_source": "Buffalo Journal",
        "pub_date": "2000",
        "description": "Fifteen pregnant buffalo heifers (6-9 months) were divided into 3 groups: control, T1 and T2. In the control group heifers were fed on oat silage ad libitum+ 10 kg green berseem+ 3-5 kg ammoniated wheat straw+ concentrate mixture. In the T1 and T2 groups all the feed ingredients were the same as in the control and only concentrate allowance was 15 and 30% higher than in the control. All the experimental animals were fed for 90 days and a digestion cum-metabolic trial was conducted before parturition. There was an increasing trend in the digestibility of DM, OM, CF, CP and N-free extract in both treatment groups, but within the treatments, no difference was observed. All experimental pregnant heifers maintained a fairly good nitrogen balance and 50% of the absorbed nitrogen was retained. Liveweight gain of pregnant heifers (6-9 months) was 340, 453 and 487 g/head/d in the control, T1 and T2 groups, respectively. Weight gain was significantly higher than control in the two treatment groups but within the treatments it was not significant. It may be inferred from the results that buffalo heifers may be fed 20% higher nutrients in the later part of pregnancy so that they can attain a body weight upto 500 kg before calving in their first lactation.",
        "citations": 5
    },
    {
        "title": "Effect of plane of nutrition on milk yield, composition and nutrient utilization in lactating buffaloes in their early lactation.",
        "id": "DOTolnIAAAAJ:cFHS6HbyZ2cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:cFHS6HbyZ2cC",
        "authors": [
            "TR Chauhan",
            "ND Sharma",
            "SS Dahiya",
            "R Gupta",
            "U Arora",
            "D Lall"
        ],
        "pub_source": "Buffalo Journal",
        "pub_date": "2000",
        "description": "The present study was conducted on 15 buffalo cows in early lactation to determine the effects of the plane of nutrition on nutrient utilization, milk production and maintenance of body weight in their early lactation. The animals were grouped into 3 where group 1 (control) were given sorghum forage ad libitum+ ammoniated wheat straw+ concentrate mixture, group 2 were given the same feed control+ 15% concentrate and group 3 were given same feed as control+ 30% concentrate. The chemical composition of diet illustrated that crude protein in wheat straw was increased from 2.70-6.90% due to ammoniation process. The apparent digestibilities of DM, OM, CP, CF and NFE were similar in all groups indicating uniformity of various feed ingredients consumed by the buffaloes. Voluntary DM intake was significantly higher (P< 0.05) in 2 treatment groups as compared to control. The milk yield and composition remained unaffected and the differences in overall milk yield was nonsignificant. There was an increasing trend in milk yield due to the supplementation of 15 and 30% concentrate. The chemical composition of milk showed no difference in the 2 treatment groups. Cost of milk increase due to the addition of concentrate supplement in the diet, but results were still statistically nonsignificant.",
        "citations": 3
    },
    {
        "title": "A new method of pruning peach on fruiting nodes basis.",
        "id": "DOTolnIAAAAJ:rmuvC79q63oC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:rmuvC79q63oC",
        "authors": [
            "N Sharma",
            "RP Awasthi",
            "JS Chauhan"
        ],
        "pub_source": "",
        "pub_date": "1997",
        "description": "Skip the header click to show the menu Menu Cart Login Login/Register Institutional Access \nAccess Options Enter words / phrases / DOI / ISBN / keywords / authors / etc Search Advanced \nsearch Search and Discover CAB Abstracts CABI Scientific Outputs Database Subsets Global \nAgricultural Research Archive Global Health CABI Thesaurus searchRxiv Knowledge and \nData Bioprotection Portal CABI Compendium Descriptions of Fungi and Bacteria Distribution \nMaps of Plant Diseases Distribution Maps of Plant Pests Horizon Scanning Tool Pest Risk \nAnalysis Tool Collections One Health Knowledge Bank PlantwisePlus Knowledge Bank \nAnimal Science Collection Environmental Impact Collection Forest Science Collection Leisure \nTourism Collection Nutrition and Food Science Collection VetMed Resource Journals and \nResearch CABI Agriculture and Bioscience CABI One Health CABI Reviews Human-Animal …"
    },
    {
        "title": "Design and experimental investigation of high speed squirrel cage induction motor",
        "id": "DOTolnIAAAAJ:1sJd4Hv_s6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:1sJd4Hv_s6UC",
        "authors": [
            "R Anbarasu",
            "RK Gupta",
            "ND Sharma",
            "G Gauthaman",
            "AK Wankhede",
            "PH Chavda",
            "J Nataraj",
            "B Bhattacharjee"
        ],
        "pub_source": "Proceedings of International Conference on Power Electronics, Drives and Energy Systems for Industrial Growth",
        "pub_date": "1996/1/8",
        "description": "In this paper the experimental investigation of high speed squirrel cage induction motor (750 Hz, 2 pole) has been presented. Measurement of the equivalent circuit parameters has been discussed in detail. For no-load, stand still test was used instead of light running test. A numerical technique was used for the computation of bridge leakage reactance of the closed rotor slot for various values of rotor bar current. The computed values were compared with the measured one. For evaluation of performance of the motor, equivalent circuit approach was adopted taking into account the nonlinearity of various parameters. Stress distribution in the rotor lamination was also computed using the finite element method for various rotor slot-bridge heights.",
        "citations": 9
    },
    {
        "title": "Experimental investigations on high speed solid and composite rotor induction motor",
        "id": "DOTolnIAAAAJ:NhqRSupF_l8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:NhqRSupF_l8C",
        "authors": [
            "ND Sharma",
            "R Anbarasu",
            "J Nataraj",
            "AY Dangore",
            "B Bhattacharjee"
        ],
        "pub_source": "Proceedings of International Conference on Power Electronics, Drives and Energy Systems for Industrial Growth",
        "pub_date": "1996/1/8",
        "description": "To improve upon the performance of high speed solid rotor induction motor, composite rotors were constructed by depositing the layers of Cu+(Fe-Co) and Cu+(Fe-Ni), in few tens of microns. Performance was evaluated through the equivalent circuit approach, the parameters of which were determined only by no load and blocked rotor tests on the machines at 400 Hz. The torque and the torque per unit current increases significantly on the composite rotors. All the computed performance characteristics at 400 Hz have been presented in this paper. The complex dependency of the rotor parameters on slip has been clearly brought out. The improvement of overall performance of the composite rotor induction motor has been predicted.",
        "citations": 26
    },
    {
        "title": "Experimental investigations on high speed solid and composite rotor induction motor",
        "id": "DOTolnIAAAAJ:CHSYGLWDkRkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:CHSYGLWDkRkC",
        "authors": [
            "ND Sharma",
            "R Anbarasu",
            "J Nataraj",
            "AY Dangore",
            "B Bhattacharjee"
        ],
        "pub_source": "Institute of Electrical and Electronics Engineers, Inc., Piscataway, NJ …",
        "pub_date": "1995/12/31",
        "description": "To improve upon the performance of high speed solid rotor induction motor, composite rotors were constructed by depositing the layers of Cu + (Fe-CO) and Cu + (Fe-Ni), in few tens of microns. Performance was evaluated through equivalent circuit approach, the parameters of which were determined only by no load and blocked rotor tests on the machines at 400 Hz. The torque and the torque per unit current increases significantly on the composite rotors. All the computed performance characteristics at 400 Hz have been presented in this paper. The complex dependency of the rotor parameters on slip has been clearly brought out. The improvement of overall performance of the composite rotor induction motor has been predicted.",
        "citations": 1
    },
    {
        "title": "Regulation of growth, fruiting and fruit quality in Santa Rosa plum with pruning.",
        "id": "DOTolnIAAAAJ:bz8QjSJIRt4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:bz8QjSJIRt4C",
        "authors": [
            "N Sharma",
            "JS Chauhan",
            "RP Awasthi"
        ],
        "pub_source": "",
        "pub_date": "1995/11/9",
        "description": "Twelve-year-old trees of Prunus salicina cv. Santa Rosa were thinned between 1990 and 1994 by removing 30% of 1-year-old shoots plus heading back the shoot tip by 1/3, 1/2, 2/3 or 3/4. With increasing pruning intensity, annual shoot extension growth increased and canopy volume and fruit yield, size and weight decreased. The yield from thinning without heading back was significantly higher than with the most severe heading back. In 1990 and 1991, fruit firmness decreased with increasing pruning intensity and TSS peaked with 1/2 and 2/3 heading back. There was no consistent trend in fruit acidity.",
        "citations": 2
    },
    {
        "title": "Synthesis of sequential and parallel programs for finite element analysis.",
        "id": "DOTolnIAAAAJ:mvPsJ3kp5DgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:mvPsJ3kp5DgC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "",
        "pub_date": "1994",
        "description": "In this thesis, I develop a coupled symbolic-numeric approach to solve PDE-based mathematical models. Existing software packages to solve these models are written in F scORTRAN and provide facilities for frequently used local formulations and numerical solution procedures. These\" canned\" packages can not be used where new formulations, new solution procedures, or parallel execution is required. The present research work is concerned with design and development of a program synthesizer for computationally intensive and problem formulation, dependent phases of the solution method. The emphasis is on the finite element analysis (FEA) method of solution although the techniques developed are applicable for other methods of solution.The idea is to employ methods from computer algebra to derive element formulations like shape functions, element stiffness matrices, etc. for more than one formulation …",
        "citations": 6
    },
    {
        "title": "The PIER Parallel FEA Program Generator",
        "id": "DOTolnIAAAAJ:fQNAKQ3IYiAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:fQNAKQ3IYiAC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "13th Annual ASME International Computers in Engineering Conference",
        "pub_date": "1993",
        "description": "In this paper we describe a coupled symbolic-numeric approach for solving PDE-based mathematical models on sequential and parallel computers. PIER, an experimental software system that we are developing, synthesizes F77 subroutines for finite element modeling directly from very-high level user input specifications. The system is being developed in Common Lisp and uses MAXIMA computer algebra system for symbolic mathematical computations. PIER input syntax provide high-level statements to specify finite element discretization and methods for solving systems of equations. The user composes the finite element analysis process using MAXIMA input syntax and F77 statements along with these statements. Symbolic quantities for element formulation like shape functions, element equations etc. are automatically derived. The input model characteristics, derived formulae, desired solution …",
        "citations": 5
    },
    {
        "title": "Automating FEA programming",
        "id": "DOTolnIAAAAJ:UHK10RUVsp4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:UHK10RUVsp4C",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "NASA. Ames Research Center, Working Notes from the 1992 AAAI Workshop on Automating Software Design. Theme: Domain Specific Software Design",
        "pub_date": "1992/7/1",
        "description": "In this paper we briefly describe a combined symbolic and numeric approach for solving mathematical models on parallel computers. An experimental software system, PIER, is being developed in Common Lisp to synthesize computationally intensive and domain formulation dependent phases of finite element analysis (FEA) solution methods. Quantities for domain formulation like shape functions, element stiffness matrices, etc., are automatically derived using symbolic mathematical computations. The problem specific information and derived formulae are then used to generate (parallel) numerical code for FEA solution steps. A constructive approach to specify a numerical program design is taken. The code generator compiles application oriented input specifications into (parallel) FORTRAN77 routines with the help of built-in knowledge of the particular problem, numerical solution methods and the target computer.",
        "citations": 2
    },
    {
        "title": "Synthesis of Sequential and Parallel Programs for Finite Element Analysis (sequential Programs)",
        "id": "DOTolnIAAAAJ:ZuybSZzF8UAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ZuybSZzF8UAC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "",
        "pub_date": "1992"
    },
    {
        "title": "High-level user input specifications for finite element code generation",
        "id": "DOTolnIAAAAJ:N5tVd3kTz84C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:N5tVd3kTz84C",
        "authors": [
            "Naveen Sharma",
            "P Wang"
        ],
        "pub_source": "",
        "pub_date": "1992",
        "description": "A set of input specifications is designed to enable engineers and scientists, who may not be computer experts, to describe the finite element analysis (FEA) procedures for a new application. The input directs PIER, a code derivation/generation system being developed in Common Lisp, to produce either sequential or parallel FEA codes. The PIER input employs common terminology and notations as used in standard FEA texts and can be intermixed with f77 statements. A user can transcribe a textbook-like FEA procedure description into PIER input form with relative ease. The input specification supports the definition of the element mesh, nodal properties, data storage scheme, symbolic derivations, and numerical algorithms for the solution procedures. The user can also group high-level statements into modules to facilitate parallelization. PIER has an FEA knowledge base which includes two different FEA formulations (element-by-element and assembled stiffness matrix). The design, usage, and implementation of the input specification are described. Examples are given to further illustrate how to prepare PIER input specifications.",
        "citations": 3
    },
    {
        "title": "Generating finite element programs for shared memory multiprocessors",
        "id": "DOTolnIAAAAJ:Y5dfb0dijaUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:Y5dfb0dijaUC",
        "authors": [
            "Naveen Sharma",
            "Paul S Wang"
        ],
        "pub_source": "ASME-PUBLICATIONS-PVP",
        "pub_date": "1992",
        "description": "Symbolic computation is employed to automatically derive formulas in finite element analysis (FEA) and to generate parallel numeric code. Key FEA computations parallelized include element stiffness computations and solution of global system of equations. An element-by-element preconditioned conjugate gradient method is used to solve the global system of equations in parallel. Derived formulas are automatically mapped onto the shared-memory architecture. An experimental software system, P-FINGER, is being extented. P-FINGER features a specification language to describe numeric algorithms for which code is to be generated. The specifications also allow an automatic code dependence analysis mechanism to extract parallelism from the specified computational steps. A separate code translator GENCRAY is modified to render code into parallel f77. Generated parallel routines run under the control of existing FEA packages. Examples of generated code are also presented.",
        "citations": 11
    },
    {
        "title": "Generating Finite Element Programs for Shared Memory Machines",
        "id": "DOTolnIAAAAJ:7T2F9Uy0os0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:7T2F9Uy0os0C",
        "authors": [
            "Naveen Sharma",
            "Paul S Wang"
        ],
        "pub_source": "Proceedings of the Fifth SIAM Conference on Parallel Processing for Scientific Computing",
        "pub_date": "1991/3/25",
        "description": "Generating Finite Element Programs for Shared Memory Machines | Proceedings of the \nFifth SIAM Conference on Parallel Processing for Scientific Computing skip to main content \nACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse \nAbout Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs \nConferences People More Search ACM Digital Library SearchSearch Advanced Search \nBrowse Browse Digital Library Collections More Home Browse by Title Proceedings \nProceedings of the Fifth SIAM Conference on Parallel Processing for Scientific Computing \nGenerating Finite Element Programs for Shared Memory Machines Article Share on \nGenerating Finite Element Programs for Shared Memory Machines Authors: Naveen \nSharma View Profile , Paul S. Wang View Profile Authors Info & Claims Proceedings of the \nFifth SIAM Conference on Parallel Processing …"
    },
    {
        "title": "A NOVEL POLYHYDROXYFLAVONE GLUCOSIDE FROM A-TYLOSIA-SCARABAEOIDES LEAVES",
        "id": "DOTolnIAAAAJ:j8SEvjWlNXcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:j8SEvjWlNXcC",
        "authors": [
            "RK Gupta",
            "N Sharma",
            "SG AGARWAL",
            "RK Thappa"
        ],
        "pub_source": "INDIAN JOURNAL OF CHEMISTRY SECTION B-ORGANIC CHEMISTRY INCLUDING MEDICINAL …",
        "pub_date": "1990/12/1",
        "description": "A highly oxygenated flavone glucoside, provisionally named as atyloside, has been isolated from the leaves of A tylosia scarabaeoides Benth. and its structure established as 3, 4', 5', 6,7,8-hexahydroxyflavone-8-beta-D-glucopyranoside (1) [6,7,8-trihydroxy-2- (3',4',5'-trihydroxyphenyl)-4H-l-benzopyran-4-one-8-beta-D-glucopyranoside].",
        "citations": 1
    },
    {
        "title": "Generating finite element programs for Warp machine",
        "id": "DOTolnIAAAAJ:ye4kPcJQO24C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ye4kPcJQO24C",
        "authors": [
            "N Sharma"
        ],
        "pub_source": "Bau et al.[21]",
        "pub_date": "1988/11",
        "description": "Some initial results of applying combined symbolic and numeric approaches to map key finite element computations onto parallel architectures are described. An experimental software system, P-FINGER, which derives the finite element formulations and maps the corresponding computations onto a parallel architecture is being developed. A separate parallel code translator package, GENW2, is used to render parallel procedures into code for the Warp systolic array computer. The generated parallel routines execute on the parallel processor under the control of a Fortran-based finite element analysis package which runs on a general purpose host computer. Examples run on the Warp machine are presented with timing comparisons to the traditional sequential approach.",
        "citations": 7
    },
    {
        "title": "Symbolic derivation and automatic generation of parallel routines for finite element analysis",
        "id": "DOTolnIAAAAJ:PR6Y55bgFSsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:PR6Y55bgFSsC",
        "authors": [
            "Naveen Sharma",
            "Paul S Wang"
        ],
        "pub_source": "International Symposium on Symbolic and Algebraic Computation",
        "pub_date": "1988/7/4",
        "description": "Described are some initial results of a joint research project involving engineering and computer science. The overall objective is to apply advanced computing technology effectively for the solution of engineering problems. Based on earlier work on the automatic derivation and generation of numeric code for finite element analysis, we are conducting research into the mapping of finite element computations on parallel architectures. Software is being developed to automatically derive and generate parallel code that can be used with existing sequential code to improve speed. We are developing techniques to derive parallel procedures, based on high-level user input, to exploit parallel computer architectures. An experimental software system called P-FINGER is under development to derive key finite element routines for the Warp systolic array computer. A separate parallel code generation package, is used …",
        "citations": 19
    },
    {
        "title": "Automatic Generation of Parallel Routines in Finite Element Analysis",
        "id": "DOTolnIAAAAJ:dQ2og3OwTAUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:dQ2og3OwTAUC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "Kent State University",
        "pub_date": "1988"
    },
    {
        "title": "Organic Pigments and Their Use in Polymeric Material",
        "id": "DOTolnIAAAAJ:PoWvk5oyLR8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:PoWvk5oyLR8C",
        "authors": [
            "ND Sharma",
            "SN Mishra"
        ],
        "pub_source": "Pop. Plast.,",
        "pub_date": "1987",
        "description": "Pigment is a matter in the particulate form that is insoluble and unaffected physically or chemically in the media it is used in. Pigments are extensively used for colouring the various polymeric materials such as nylon, polyester, polyolefins and acrylics. The properties and specific requirements for a pigment to achieve optimum properties in a particular system are described. Methods of preparation of various organic pigments and their suitability in different polymeric materials are also reviewed.--AA"
    },
    {
        "title": "Constituents of Atylosia scarabaeoides.",
        "id": "DOTolnIAAAAJ:uJ-U7cs_P_0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:uJ-U7cs_P_0C",
        "authors": [
            "N Sharma",
            "RK Gupta"
        ],
        "pub_source": "",
        "pub_date": "1985/11/27",
        "description": "Hentriacontane, β-sitosteryl glucoside, smallcap˜D(+)-pinitol, vitexin and four fatty esters of hexacosanol (palmitate, stearate, arachidate and oleate) were identified in the leaves.",
        "citations": 8
    },
    {
        "title": "Studies on the distribution, metabolism and excretion of sulphasomidine in buffaloes.",
        "id": "DOTolnIAAAAJ:_xSYboBqXhAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:_xSYboBqXhAC",
        "authors": [
            "ND Sharma",
            "I Gupta"
        ],
        "pub_source": "",
        "pub_date": "1982",
        "description": "Sulphasomidine (sulfisomidine INN) after single oral doses of 100 and 200 mg/kg body weight did not produce therapeutically effective plasma levels (5 mg/100 ml) in buffalo calves. However, following 200 mg/kg single oral dose there was high urinary excretion of the free form (for more than 24 h) with a very low proportion of the acetylated form, indicating it to be a useful non-nephrotoxic drug for the treatment of urinary tract infections of buffaloes. It may also be useful in brain diseases (such as meningococcal infections) and in liver and biliary infections."
    },
    {
        "title": "Study on the distribution of five sulphonamides in the milk of buffaloes.",
        "id": "DOTolnIAAAAJ:pyW8ca7W8N0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:pyW8ca7W8N0C",
        "authors": [
            "ND Sharma",
            "I Gupta"
        ],
        "pub_source": "",
        "pub_date": "1982",
        "description": "Each sulfonamide (sulfisomidine, sulfadiazine, sulfaphenazole, sulfadimethoxine and sulfamethazine [sulfadimidine]) was administered orally in aqueous solution to buffaloes weighing 450-540 kg (5-8 years old) in a single dose of 200 mg/kg body weight. The concentrations of sulfadimidine and sulfaphenazole in milk at 1 h after administration were 1.4 and 0.55 mg/100 ml respectively, while the others were present in traces only. The maximum concentrations in milk (mg/100 ml) of these sulfonamides in free form were 5.94 (at 12 h after administration, sulfadimidine), 1.55 (24 h, sulfisomidine), 1.34 (8 h, sulfaphenazole), 0.96 (12 h, sulfadimethoxine) and 0.9 (12 h, sulfadiazine). Only sulfadimidine could produce therapeutically effective concentrations, indicating its systemic use against mammary gland infections such as mastitis. After administration of these sulfonamides buffalo milk was unfit for human …",
        "citations": 2
    },
    {
        "title": "Note on the acute toxicity of sulphamethazine sodium 33.3% when administered intravenously to buffalo calves.",
        "id": "DOTolnIAAAAJ:yD5IFk8b50cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:yD5IFk8b50cC",
        "authors": [
            "ND Sharma",
            "SP Naithani",
            "I Gupta"
        ],
        "pub_source": "",
        "pub_date": "1981",
        "description": "Six groups of buffalo calves (34 in all) were injected i/v with sulfadimidine at dose rate between 100-600 mg/kg, at an injection rate of 40 ml a minute. Lower dose rates (100 and 200 mg/kg) had no adverse effect, while 300 mg/kg caused some excitement and 400 mg/kg caused muscle tremors, inability to stand and dullness lasting for 4-5 hours. 500 mg/kg caused severe shock, incoordination, trembling, convulsions, inability to stand, respiratory difficulties and cessation of urination, which lasted 12-15 hours. The highest dose, 600 mg/kg produced similar symptoms, but more severe and more persistent."
    },
    {
        "title": "DESIGN, FABRICATION AND PERFORMANCE EVALUATION OF A TEST RIG OF CENTRIFUGAL PUMPS IN SERIES AND PARALLEL COMBINATION",
        "id": "DOTolnIAAAAJ:ruyezt5ZtCIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:ruyezt5ZtCIC",
        "authors": [
            "Naveen Sharma",
            "Lajpat Rai"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Centrifugal pumps find vast applications in modern machineries and often works either in series or parallel. In this experimental work, an attempt has been made to design and fabricate an experimental set-up that comprises of two centrifugal pumps arranged in such a manner that the experimental set-up works either individually or in series and in parallel combinations. The maximum value of efficiency estimated is 62.45% for C1 and 65.30% for C2, 55.10% and 58.15%, when pumps operate individually, in series and in parallel combination, respectively. The designed and fabricated test rig has efficiently served the purpose of providing a clear idea about the effectiveness of experimental set-up in transmitting fluid to distant work stations. This study indicated the methodology could be used to transfer gases or liquid to long distances by using more number of pumps in series and parallel combinations."
    },
    {
        "title": "Case Reports «Previous Article ToC Next Article»",
        "id": "DOTolnIAAAAJ:foquWX3nUaYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:foquWX3nUaYC",
        "authors": [
            "RP Luthra",
            "Renu Gupta",
            "Divy Vashisht",
            "Naveen Sharma",
            "Ranjan Gupta"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Recent advancements in barrier membranes, bone grafting substitutes, and surgical techniques have led to a predictable arsenal of treatment methods for clinicians who practice implant dentistry. Nowadays, postextraction socket preservation and augmentation can be a predictable procedure and can certainly aid in implant placement in a position that satisfies both esthetics as well as function. Extraction socket augmentation for future implant therapy does not rule out immediate implant placement but rather provides an additional option when treatment planning implant patients. This article will focus on the concept of extraction socket preservation using regenerative materials. It will describe a technique suggested by the authors to resist bone resorption and soft tissue shrinkage following tooth extraction."
    },
    {
        "title": "Impact of Marketing Strategy on Development of Tourism Industry in Rajasthan",
        "id": "DOTolnIAAAAJ:LI9QrySNdTsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:LI9QrySNdTsC",
        "authors": [
            "Mr Manish Shrivastava",
            "Mr Deep Kumar Mathur",
            "DS Malik",
            "Naveen Sharma",
            "Swati Mishra"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The Rajasthan government has taken a few measures for the advancement of the tourism industry in the state. A multi-pronged methodology has been embraced, which incorporates new instrument for speed usage of the tourism industry ventures, advancement of integrated tourism circuits and rural endpoints, special capacity building in the unorganized hospitality segment and new marketing strategy.Marketing of Tourism related activities have plays a key role in the development of Tourism industry in India as well as in Rajasthan. Various marketing procedures were adopted by government of Rajasthan to boost this economic activity during the last 5 years. Many of them are running as a continuous process whereas some of them are year specific."
    },
    {
        "title": "A MODIFIED STATISTICAL PROCEDURE FOR DERIVING MEASURE OF ECONOMIC WELFARE FROM NATIONAL INCOME AND ICP DATA",
        "id": "DOTolnIAAAAJ:tYavs44e6CUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:tYavs44e6CUC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The use of national income as a representative of welfare has been widely criticized and now it is very well accepted as not a reliable measure of welfare. 1 But it must be understood at the outset that all the criticism against national income as a reliable representative of economic welfare are unfounded since the very purpose of national income estimation has always been to arrive at a Measure of Economic Activity (MEA) or a measure of output produced in a particular year (Alder, 1982). The use of national income as a proxy of national welfare was done just because of the non-availability of any reliable alternative. Besides since national income can serve many purposes, a majority of controversies, problems and errors of measurements of national income accounts seem to arise due to:1. lack of clear specification of the purpose for which these accounts are being used; 2. use of these accounts for various …"
    },
    {
        "title": "Track on Cognitive, Cellular, and Mobile Networks (CCM)",
        "id": "DOTolnIAAAAJ:AvfA0Oy_GE0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:AvfA0Oy_GE0C",
        "authors": [
            "Honggang Wang",
            "Eunsung Oh",
            "Yanming Shen",
            "Youping Zhao",
            "Beijing Jiaotong",
            "Satya Prakash Ponnaluri",
            "Wei Cheng",
            "Jie Zeng",
            "Aleksandar Kuzmanovic",
            "Baochun Li",
            "Dan Li",
            "Gek Hong Sim",
            "Gong Zhang",
            "Michael Schapira",
            "Niloy Ganguly",
            "Ning Xia",
            "Rade Stanojevic",
            "Ravi Kokku",
            "Swati Rallapalli",
            "Wei Wang",
            "Amy Apon",
            "Liana Fong",
            "TJ Watson",
            "Ivan Rodero",
            "Naveen Sharma",
            "Byung Chul Tak",
            "Rafael Tolosana-Calasanz",
            "Leo Selavo",
            "Tao Wang",
            "Hongbo Jiang",
            "Jiliang Wang",
            "Octav Chipara",
            "Christine Julien",
            "Lugano Svizzeraitaliana",
            "Luoyi Fu",
            "Shanghai Jiao Tong",
            "Amy Murphy",
            "Bruno Kessler",
            "Olaf Landsiedel Chalmers",
            "Brano Kusy",
            "Carlo Pinciroli École",
            "Utz Roedig"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Provides a listing of current committee members and society officers."
    },
    {
        "title": "Steering Committee ACSOS 2021",
        "id": "DOTolnIAAAAJ:uc_IGeMz5qoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:uc_IGeMz5qoC",
        "authors": [
            "Ada Diaconescu",
            "Samuel Kounev",
            "Jean Botev",
            "Songqing Chen",
            "Betty HC Cheng",
            "Simon Dobson",
            "Peter Lewis",
            "Arif Merchant",
            "Manish Parashar",
            "Wolfgang Reif",
            "Naveen Sharma",
            "Jan-Philipp Steghöfer",
            "Mirko Viroli",
            "Christian Krupitzer"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Steering Committee Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference \nProceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News \nResource Center Press Room Advertising About Us Cart All Advanced Search Conference \nCover Image Download 1.Home 2.Proceedings 3.acsos-c 2021 Steering Committee 2021, pp. \nxxii-xxii, DOI Bookmark: 10.1109/ACSOS-C52956.2021.00010 Keywords Authors Abstract \nProvides a listing of current committee members and society officers. Steering Committee \nACSOS 2021 Ada Diaconescu (Chair), LTCI Lab, Telecom Paris, Institute Politechnqie de Paris, \nFrance Samuel Kounev (Chair), University of Würzburg, Germany Jean Botev, University of …"
    },
    {
        "title": "Method and system for determining an average walk distance to a service",
        "id": "DOTolnIAAAAJ:fEOibwPWpKIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:fEOibwPWpKIC",
        "authors": [
            ""
        ],
        "pub_source": "US Patent 7,987,051, 2,011, 0",
        "pub_date": ""
    },
    {
        "title": "Method and system for determining an average walk distance to a service",
        "id": "DOTolnIAAAAJ:-_dYPAW6P2MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:-_dYPAW6P2MC",
        "authors": [
            "N Sharma"
        ],
        "pub_source": "",
        "pub_date": ""
    },
    {
        "title": "Method and system for a distributed file system based on user behaviors and user locales",
        "id": "DOTolnIAAAAJ:2KloaMYe4IUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:2KloaMYe4IUC",
        "authors": [
            ""
        ],
        "pub_source": "",
        "pub_date": ""
    },
    {
        "title": "Designing File Replication Schemes for Peer-to-Peer File Sharing Systems.",
        "id": "DOTolnIAAAAJ:VOx2b1Wkg3QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:VOx2b1Wkg3QC",
        "authors": [
            ""
        ],
        "pub_source": "",
        "pub_date": ""
    },
    {
        "title": "A Mouse Model of Target Identification in the Presence of Novel Backgrounds",
        "id": "DOTolnIAAAAJ:tS2w5q8j5-wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:tS2w5q8j5-wC",
        "authors": [
            "Michael Castellano",
            "Cohn J OMS-II",
            "M Swerdloff",
            "J San Miguel",
            "R Shah",
            "N Sharma",
            "N Shah",
            "Y Li",
            "Gonzalo Otazu"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Deficits in feedback pathways may underlie the pathophysiology of Autism Spectrum Disorder (ASD) symptoms including those involving poor facial recognition, aberrant audio processing, and perhaps the inability to solve CAPTCHAs (identifying known visual stimuli in the presence of novel background distractors). These tasks comprise affected elements in ASD sensory processing: novelty, complexity, and generalization. 1"
    },
    {
        "title": "Overcoming Network Security Issues in Cloud Computing and its Applications (A Major Challenge in Cloud Computing Applications)",
        "id": "DOTolnIAAAAJ:4OULZ7Gr8RgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:4OULZ7Gr8RgC",
        "authors": [
            "Naveen Sharma",
            "Dimple Malik",
            "Mahesh Kr Saini"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "In this modern technologies world everything becomes very vast and more reliable. We makes our documentation on one pc and we can access and get this on other system but this can be happened with the help of internet. The rapid improvement of the capacity of online connectivity gave birth to cloud computing. Data and processes could be done online without the need of any local software or client. As long as the user knows the process and has the right security credentials, he could access the system and make the necessary changes, but there are major challenges and security issues in cloud computing that makes accessing somewhat difficult. In this paper we are giving a introduction to cloud computing and discussing and overcome this security issues that being coming in cloud computing applications."
    },
    {
        "title": "ICAC 2019",
        "id": "DOTolnIAAAAJ:fPk4N6BV_jEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:fPk4N6BV_jEC",
        "authors": [
            "Samuel Kounev",
            "Naveen Sharma",
            "Tarek Abdelzaher",
            "Betty Cheng",
            "Ada Diaconescu",
            "Yixin Diao",
            "Simon Dobson",
            "Holger Giese",
            "Michael Kozuch",
            "Philippe Lalanda",
            "Daniel Menasce",
            "Arif Merchant",
            "Dejan Milojicic",
            "Manish Parashar",
            "Hartmut Schmeck",
            "Alan Sill",
            "Vladimir Vlassov"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Steering Committee Toggle navigation IEEE Computer Society Digital Library Jobs Tech News \nResource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE \nComputer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings \nInstitutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center \nPress Room Advertising About Us Cart All Advanced Search Conference Cover Image Download \n1.Home 2.Proceedings 3.icac 2019 Steering Committee 2019, pp. 16-16, DOI Bookmark: \n10.1109/ICAC.2019.00009 Keywords Authors Steering Committee ICAC 2019 Co-Chairs \nSamuel Kounev, University of Würzburg, Germany Naveen Sharma, Rochester Institute of \nTechnology, USA Members Tarek Abdelzaher, University of Illinois at Urbana-Champaign, \nUSA Betty Cheng, Michigan State University, USA Ada Diaconescu, Telecom ParisTech, …"
    },
    {
        "title": "ICAC 2018 Steering Committee",
        "id": "DOTolnIAAAAJ:M3NEmzRMIkIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:M3NEmzRMIkIC",
        "authors": [
            "Samuel Kounev",
            "Naveen Sharma",
            "Tarek Abdelzaher",
            "Betty Cheng",
            "Ada Diaconescu",
            "Yixin Diao",
            "Simon Dobson",
            "Holger Giese",
            "Michael Kozuch",
            "Philippe Lalanda",
            "Daniel Menasce",
            "Arif Merchant",
            "Dejan Milojicic",
            "Manish Parashar",
            "Hartmut Schmeck",
            "Alan Sill",
            "Vladimir Vlassov"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Provides a listing of current committee members and society officers."
    },
    {
        "title": "A SEAMLESS VERTICAL HANDOVER IN HETEROGENOUS WIRELESS NETWORKS",
        "id": "DOTolnIAAAAJ:r0BpntZqJG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:r0BpntZqJG4C",
        "authors": [
            "Sapna Saini",
            "Naveen Sharma",
            "Banur SVIET"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Future wireless systems will be characterized by their heterogenity because of advancement in the technology. It integrates different networks to provide seamless internet access for mobile users with multimode access ability. Handover in heterogenous wireless network is an important feature for the mobile terminal. It is a strategy that required to maintain the network connectivity which aims to achieve the efficient communication that requires systematic and individual attention in order to provide an efficient service to the user. They provide a cost effective, simple, operable and personalized global communication according to users need. This paper gives the comprehensive study of vertical handover decision based algorithm in order to choose the best available network and increases handover performance so that an efficient service is provided to the users."
    },
    {
        "title": "Security Issues In Cloud Computing–A Review",
        "id": "DOTolnIAAAAJ:_Qo2XoVZTnwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:_Qo2XoVZTnwC",
        "authors": [
            "Shikha Sharma",
            "Naveen Sharma"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Cloud Computing is the most emerging trend in Information Technology now days. Number of users used Cloud to store their data. The need for online services is increasing; the extent of services available through the internet, such as online software, platform, storage, etc. is also growing. This leads to formation of a structured provision of services, called cloud computing, which actually provides a huge amount of computing resources as services through the internet. One of the important services in the cloud is the availability of online storage, called cloud storage. Data storage security: It is security of data on the storage media. In cloud computing security is an important factor for ensuring clients that in the cloud, data is placed on a secure mode. For protecting Data from malicious users, client authentication becomes an important task. The global computing infrastructure is rapidly moving towards cloud based architecture. Adopting cloud technology can be an affordable way to get access to a dynamically scalable, virtualized computing environment. The cloud provider is responsible for the environment, so organizations can make use of resources for short periods of time without having to maintain the environment when it is not being used. While cloud computing models are attractive because of their flexibility and cost effectiveness. This paper is focused on the security issues of cloud computing. Before analyzing the security issues, the introduction to cloud computing and brief discussion on the cloud service model or cloud development models is presented. Then discusses the cloud layered architecture and cloud security challenges. This …"
    },
    {
        "title": "RECOMMENDING OPTIMAL CLOUD CONFIGURATION BASED ON BENCHMARKING IN BLACK-BOX CLOUDS",
        "id": "DOTolnIAAAAJ:R3hNpaxXUhUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:R3hNpaxXUhUC",
        "authors": [
            "Gueyoung Jung",
            "Naveen Sharma",
            "Tridib Mukherjee",
            "Frank Goetz",
            "Julien Bourdaillet"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "This paper focuses on recommending optimal cloud configuration for deploying complex user workloads. Such recommendation has become imperative in recent times for cloud users to reduce complexity in selecting a configuration. The number of different configuration options has increased many-fold due to the proliferation of cloud providers and different non-standardized offerings from these providers. Furthermore, the performance and price implications are unknown beforehand, when a cloud user deploys her workload into these different configurations. The problem gets exacerbated since cloud providers generally keep the underlying infrastructures and technologies non-transparent to users. In this paper, we present (i) a benchmark-based modeling approach to accurately estimate the performance of workloads on target black-box cloud configurations; and (ii) a search algorithm that first generates a capability vector consisting of relative performance scores of resource types (eg, CPU, memory, and disk) for each configuration and then, identifies a near optimal cloud configuration based on the capability vectors. Experiments show that our approach accurately estimates the performance capability, and performs efficient search for the near optimal cloud configuration that has the minimum price while meeting the throughput goal."
    },
    {
        "title": "ICCAC 2016 Conference Organization",
        "id": "DOTolnIAAAAJ:HDshCWvjkbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:HDshCWvjkbEC",
        "authors": [
            "Naveen Sharma",
            "Indranil Gupta",
            "Yixin Diao",
            "Daniel Krutz",
            "Sameh Elnikety",
            "Youssif Al-Nashif",
            "Yaser Jaraweh",
            "Cihan Tunc",
            "Pradeep Murukannaiah",
            "Simon Dobson",
            "Geoffrey Fox",
            "Salim Hariri",
            "Soonwook Hwang",
            "Manish Parashar",
            "S Masoud Sadjadi",
            "Vladimir Vlassov"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Provides a listing of current committee members and society officers."
    },
    {
        "title": "Message from the ICCAC 2016 General Chair",
        "id": "DOTolnIAAAAJ:mB3voiENLucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:mB3voiENLucC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Message from the General Chair Page 1 Message from the ICCAC 2016 General Chair \nWelcome to the 2016 IEEE International Conference on Cloud and Autonomic Computing (ICCAC) \nbeing held in Augsburg, Germany, on September 12–16, 2016. For the third time, ICCAC is \nco-located with the Self-Adaptive and Self-Organizing (SASO) conference. As General Chair, \nI had the pleasure to work with many people in the conference organization and steering \ncommittee who made this event possible. Special thanks go to Program Committee Co-Chairs \nDrs. Indranil Gupta (“Indy”) and Yixin Diao as well as Workshop/Tutorial and Posters Chairs \nDrs. Sameh Elnikety and Daniel Krutz, respectively. Also, special thanks go to all members \nof the Program Committee for their hard work in putting together a high-caliber program. I \nwould also like to extend thanks to the Web Chair Daniel Krutz, Publicity Committee co-chaired …"
    },
    {
        "title": "Decentralized Clustering Analysis for Online Anomaly Detection in Self-Monitoring Peer Systems",
        "id": "DOTolnIAAAAJ:-f6ydRqryjwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:-f6ydRqryjwC",
        "authors": [
            "Andres Quiroz",
            "Manish Parashar",
            "Naveen Sharma"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "This paper describes a framework for decentralized clustering-based analysis and online anomaly detection for self-monitoring of peer systems. The framework enables peer behavior patterns and anomalies to be effectively detected and reported so that corrective or otherwise corresponding action can be taken. In this system, it is assumed that peers represent their status using commonly known attributes and periodically report them as semantic events. Anomalies in the behavior/state of peers can then be detected by clustering these events based on the values of the attributes. The design and evaluation of a decentralized and scalable clustering algorithm that builds on a content-based routing, messaging and notification substrate is presented. The operation and performance of the algorithm is experimentally evaluated."
    },
    {
        "title": "Clouds",
        "id": "DOTolnIAAAAJ:hC7cP41nSMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=DOTolnIAAAAJ:hC7cP41nSMkC",
        "authors": [
            "Naveen Sharma"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Presents the table of contents of the proceedings."
    }
]