[
    {
        "title": "Adversary Tactic Driven Scenario and Terrain Generation with Partial Infrastructure Specification",
        "id": "flJTFn4AAAAJ:LPZeul_q3PIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:LPZeul_q3PIC",
        "authors": [
            "Ádám Ruman",
            "Martin Drašar",
            "Lukáš Sadlek",
            "Shanchieh Jay Yang",
            "Pavel Čeleda"
        ],
        "pub_source": "",
        "pub_date": "2024",
        "description": "Diverse, accurate, and up-to-date training environments are essential for training cybersecurity experts and autonomous systems. However, preparation of their content is time-consuming and requires experts to provide detailed specifications. In this paper, we explore the challenges of automated generation of the content (composed of scenarios and terrains) for these environments. We propose new models to represent the cybersecurity domain and associated action spaces. These models are used to create sound and complex training content based on partial specifications provided by users. We compare the results with a real-world complex malware campaign to assess the realism of the synthesized content. To further evaluate the correctness and variability of the results, we utilize the kill-chain attack graph generation for the generated training content to asses the internal correspondence of its key components.Our results demonstrate that the proposed approach can create complex training content similar to advanced attack campaigns, which passes evaluation for soundness and practicality. Our proposed approach and its implementation significantly contribute to the state of the art, enabling novel approaches to cybersecurity training and autonomous system development."
    },
    {
        "title": "Advancing TTP Analysis: Harnessing the Power of Encoder-Only and Decoder-Only Language Models with Retrieval Augmented Generation",
        "id": "flJTFn4AAAAJ:geHnlv5EZngC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:geHnlv5EZngC",
        "authors": [
            "Reza Fayyazi",
            "Rozhina Taghdimi",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "arXiv preprint arXiv:2401.00280",
        "pub_date": "2023/12/30",
        "description": "Tactics, Techniques, and Procedures (TTPs) outline the methods attackers use to exploit vulnerabilities. The interpretation of TTPs in the MITRE ATT&CK framework can be challenging for cybersecurity practitioners due to presumed expertise, complex dependencies, and inherent ambiguity. Meanwhile, advancements with Large Language Models (LLMs) have led to recent surge in studies exploring its uses in cybersecurity operations. This leads us to question how well encoder-only (e.g., RoBERTa) and decoder-only (e.g., GPT-3.5) LLMs can comprehend and summarize TTPs to inform analysts of the intended purposes (i.e., tactics) of a cyberattack procedure. The state-of-the-art LLMs have shown to be prone to hallucination by providing inaccurate information, which is problematic in critical domains like cybersecurity. Therefore, we propose the use of Retrieval Augmented Generation (RAG) techniques to extract relevant contexts for each cyberattack procedure for decoder-only LLMs (without fine-tuning). We further contrast such approach against supervised fine-tuning (SFT) of encoder-only LLMs. Our results reveal that both the direct-use of decoder-only LLMs (i.e., its pre-trained knowledge) and the SFT of encoder-only LLMs offer inaccurate interpretation of cyberattack procedures. Significant improvements are shown when RAG is used for decoder-only LLMs, particularly when directly relevant context is found. This study further sheds insights on the limitations and capabilities of using RAG for LLMs in interpreting TTPs.",
        "citations": 1
    },
    {
        "title": "Unraveling Network-Based Pivoting Maneuvers: Empirical Insights and Challenges",
        "id": "flJTFn4AAAAJ:5Ul4iDaHHb8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:5Ul4iDaHHb8C",
        "authors": [
            "Martin Husák",
            "Shanchieh Jay Yang",
            "Joseph Khoury",
            "Đorđe Klisura",
            "Elias Bou-Harb"
        ],
        "pub_source": "International Conference on Digital Forensics and Cyber Crime",
        "pub_date": "2023/11/30",
        "description": "Pivoting days in a campus network. Through NetFlow monitoring, we initially identified potential pivoting candidates, which are traces in the network traffic that match known patterns. Subsequently, we conducted an in-depth analysis of these candidates and uncovered a significant number of false positives and benign pivoting-like patterns. To enhance investigation and understanding, we introduced a novel graph representation called a pivoting graph, which provides comprehensive visualization capabilities. Unfortunately, investigating pivoting candidates is highly dependent on the specific context and necessitates a strong understanding of the local environment. To address this challenge, we applied principal component analysis and clustering techniques to a diverse range of features. This allowed us to identify the most meaningful features for automated pivoting detection, eliminating the need for prior …"
    },
    {
        "title": "Are Existing Out-Of-Distribution Techniques Suitable for Network Intrusion Detection?",
        "id": "flJTFn4AAAAJ:sSrBHYA8nusC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:sSrBHYA8nusC",
        "authors": [
            "Andrea Corsini",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2023 IEEE Conference on Communications and Network Security (CNS)",
        "pub_date": "2023/10/2",
        "description": "Machine learning (ML) has become increasingly popular in network intrusion detection. However, ML-based solutions always respond regardless of whether the input data reflects known patterns, a common issue across safety-critical applications. While several proposals exist for detecting Out-Of-Distribution (OOD) in other fields, it remains unclear whether these approaches can effectively identify new forms of intrusions for network security. New attacks, not necessarily affecting overall distributions, are not guaranteed to be clearly OOD as instead, images depicting new classes are in computer vision. In this work, we investigate whether existing OOD detectors from other fields allow the identification of unknown malicious traffic. We also explore whether more discriminative and semantically richer embedding spaces within models, such as those created with contrastive learning and multi-class tasks, benefit …",
        "citations": 2
    },
    {
        "title": "The Road Towards Autonomous Cybersecurity Agents: Remedies for Simulation Environments",
        "id": "flJTFn4AAAAJ:8AbLer7MMksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:8AbLer7MMksC",
        "authors": [
            "Martin Drašar",
            "Ádám Ruman",
            "Pavel Čeleda",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "European Symposium on Research in Computer Security",
        "pub_date": "2023/9/25",
        "description": "One of the fundamental challenges in developing autonomous cybersecurity agents (AICA) is providing them with appropriate training environments for skills acquisition and evaluation. Current reinforcement learning (RL) algorithms rely on myriads of training runs to instill proper behavior, and this is reasonably achievable only within a simulated environment. In this paper, we explore the topic of simulation models and environments for RL and present an assessment framework to compare simulation models designed for simulating cyberattack scenarios. We examine four existing simulation tools, including a new one by the authors of the paper, and discuss their properties, particularly in terms of deployability, to support RL-based AICA. In the example of complex scenarios, we compare the two most sophisticated simulation tools and discuss their strengths.",
        "citations": 1
    },
    {
        "title": "The 3rd Workshop on Artificial Intelligence-enabled Cybersecurity Analytics",
        "id": "flJTFn4AAAAJ:tS2w5q8j5-wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:tS2w5q8j5-wC",
        "authors": [
            "Sagar Samtani",
            "Shanchieh Yang",
            "Hsinchun Chen"
        ],
        "pub_source": "Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining",
        "pub_date": "2023/8/6",
        "description": "Artificial Intelligence (AI) has gripped modern society as a viable approach to revolutionize operational capabilities across multiple industries. One critical application area that could stand to benefit from the capabilities of AI is cybersecurity. Increasingly, federal funding agencies such as the National Science Foundation are calling for enhanced AI-enabled analytics capabilities to improve cyber threat intelligence, cyber defense generation, and more. To this end, this half-day workshop, not in its third year at ACM KDD, sought to attain significant contributions related to various aspects of AI-enabled cybersecurity analytics. This workshop received a record number of submissions. Submissions were reviewed by a highly-qualified, interdisciplinary group of AI for cybersecurity researchers and practitioners spanning academia and private industry firms."
    },
    {
        "title": "On the uses of large language models to interpret ambiguous cyberattack descriptions",
        "id": "flJTFn4AAAAJ:4fKUyHm3Qg0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:4fKUyHm3Qg0C",
        "authors": [
            "Reza Fayyazi",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "arXiv preprint arXiv:2306.14062",
        "pub_date": "2023/6/24",
        "description": "The volume, variety, and velocity of change in vulnerabilities and exploits have made incident threat analysis challenging with human expertise and experience along. The MITRE AT&CK framework employs Tactics, Techniques, and Procedures (TTPs) to describe how and why attackers exploit vulnerabilities. However, a TTP description written by one security professional can be interpreted very differently by another, leading to confusion in cybersecurity operations or even business, policy, and legal decisions. Meanwhile, advancements in AI have led to the increasing use of Natural Language Processing (NLP) algorithms to assist the various tasks in cyber operations. With the rise of Large Language Models (LLMs), NLP tasks have significantly improved because of the LLM's semantic understanding and scalability. This leads us to question how well LLMs can interpret TTP or general cyberattack descriptions. We propose and analyze the direct use of LLMs as well as training BaseLLMs with ATT&CK descriptions to study their capability in predicting ATT&CK tactics. Our results reveal that the BaseLLMs with supervised training provide a more focused and clearer differentiation between the ATT&CK tactics (if such differentiation exists). On the other hand, LLMs offer a broader interpretation of cyberattack techniques. Despite the power of LLMs, inherent ambiguity exists within their predictions. We thus summarize the existing challenges and recommend research directions on LLMs to deal with the inherent ambiguity of TTP descriptions.",
        "citations": 11
    },
    {
        "title": "Learning about the adversary",
        "id": "flJTFn4AAAAJ:vRqMK49ujn8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:vRqMK49ujn8C",
        "authors": [
            "Azqa Nadeem",
            "Sicco Verwer",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Autonomous Intelligent Cyber Defense Agent (AICA) A Comprehensive Guide",
        "pub_date": "2023/6/3",
        "description": "The evolving nature of the tactics, techniques, and procedures used by cyber adversaries have made signature and template based methods of modeling adversary behavior almost infeasible. We are moving into an era of data-driven autonomous cyber defense agents that learn contextually meaningful adversary behaviors from observables. In this chapter, we explore what can be learnt about cyber adversaries from observable data, such as intrusion alerts, network traffic, and threat intelligence feeds. We describe the challenges of building autonomous cyber defense agents, such as learning from noisy observables with no ground truth, and the brittle nature of deep learning based agents that can be easily evaded by adversaries. We illustrate three state-of-the-art autonomous cyber defense agents that model adversary behavior from traffic induced observables without a priori expert knowledge or ground truth …",
        "citations": 1
    },
    {
        "title": "Cyberattack forecasting using predictive information",
        "id": "flJTFn4AAAAJ:b0M2c_1WBrUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:b0M2c_1WBrUC",
        "authors": [
            "A Okutan",
            "SJ Yang",
            "K McConky"
        ],
        "pub_source": "US Patent 11,632,386",
        "pub_date": "2023/4/18",
        "description": "2020-06-17 Assigned to ROCHESTER INSTITUTE OF TECHNOLOGY reassignment ROCHESTER INSTITUTE OF TECHNOLOGY ASSIGNMENT OF ASSIGNORS INTEREST (SEE DOCUMENT FOR DETAILS). Assignors: MCCONKY, KATIE, YANG, SHANCHIEH JAY, OKUTAN, AHMET",
        "citations": 18
    },
    {
        "title": "Quantifying impact on safety from cyber-attacks on cyber-physical systems",
        "id": "flJTFn4AAAAJ:l7t_Zn2s7bgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:l7t_Zn2s7bgC",
        "authors": [
            "Eleftherios Vlahakis",
            "Gregory Provan",
            "Gordon Werner",
            "Shanchieh Yang",
            "Nikolaos Athanasopoulos"
        ],
        "pub_source": "IFAC-PapersOnLine",
        "pub_date": "2023/1/1",
        "description": "We propose a novel framework for modeling attack scenarios in cyber-physical control systems: we represent a cyber-physical system as a constrained switching system, where a single model embeds the dynamics of the physical process, the attack patterns, and the attack detection schemes. We show that this is compatible with established results in hybrid automata, namely, constrained switching linear systems. The proposed attack modeling approach admits a large class of non-deterministic attack policies and enables the characterization of system safety as an asymptotic property. By calculating the maximal safe set, the resulting new impact metrics intuitively quantify the degradation of safety and the impact of cyber attacks on the safety properties of the system under attack. We showcase our results via an illustrative example.",
        "citations": 2
    },
    {
        "title": "HeATed Alert Triage (HeAT): Transferrable Learning to Extract Multistage Attack Campaigns",
        "id": "flJTFn4AAAAJ:tOudhMTPpwUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:tOudhMTPpwUC",
        "authors": [
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "arXiv preprint arXiv:2212.13941",
        "pub_date": "2022/12/28",
        "description": "With growing sophistication and volume of cyber attacks combined with complex network structures, it is becoming extremely difficult for security analysts to corroborate evidences to identify multistage campaigns on their network. This work develops HeAT (Heated Alert Triage): given a critical indicator of compromise (IoC), e.g., a severe IDS alert, HeAT produces a HeATed Attack Campaign (HAC) depicting the multistage activities that led up to the critical event. We define the concept of \"Alert Episode Heat\" to represent the analysts opinion of how much an event contributes to the attack campaign of the critical IoC given their knowledge of the network and security expertise. Leveraging a network-agnostic feature set, HeAT learns the essence of analyst's assessment of \"HeAT\" for a small set of IoC's, and applies the learned model to extract insightful attack campaigns for IoC's not seen before, even across networks by transferring what have been learned. We demonstrate the capabilities of HeAT with data collected in Collegiate Penetration Testing Competition (CPTC) and through collaboration with a real-world SOC. We developed HeAT-Gain metrics to demonstrate how analysts may assess and benefit from the extracted attack campaigns in comparison to common practices where IP addresses are used to corroborate evidences. Our results demonstrates the practical uses of HeAT by finding campaigns that span across diverse attack stages, remove a significant volume of irrelevant alerts, and achieve coherency to the analyst's original assessments."
    },
    {
        "title": "Non-cooperative learning for robust spectrum sharing in connected vehicles with malicious agents",
        "id": "flJTFn4AAAAJ:08ZZubdj9fEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:08ZZubdj9fEC",
        "authors": [
            "Haoran Peng",
            "Hanif Rahbari",
            "Shanchieh Jay Yang",
            "Li-Chun Wang"
        ],
        "pub_source": "GLOBECOM 2022-2022 IEEE Global Communications Conference",
        "pub_date": "2022/12/4",
        "description": "Multi-agent reinforcement learning (MARL) has pre-viously been employed for efficient spectrum sharing among co-operative connected vehicles. However, we show in this paper that existing MARL models are not robust against non-cooperative or malicious agents (vehicles) whose spectrum selection strategy may cause congestion and reduce the spectrum utilization. For example, a selfish (non-cooperative) agent aims to only maximize its own spectrum utilization, irrespective of the overall system efficiency and spectrum availability to others. We investigate and analyze the MARL-based spectrum sharing problem in connected vehicles including vehicles (agents) with selfish or sabotage strategies. We then develop a theoretical framework to consider the selfish agent, and study various adversarial scenarios (including attacks with disruptive goals) via simulations. Our robust MARL approach where “robust …",
        "citations": 1
    },
    {
        "title": "ACM KDD AI4Cyber/MLHat: Workshop on AI-enabled cybersecurity analytics and deployable defense",
        "id": "flJTFn4AAAAJ:Tiz5es2fbqcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:Tiz5es2fbqcC",
        "authors": [
            "Sagar Samtani",
            "Gang Wang",
            "Ali Ahmadzadeh",
            "Arridhana Ciptadi",
            "Shanchieh Yang",
            "Hsinchun Chen"
        ],
        "pub_source": "Proceedings of the 28th ACM SIGKDD Conference on Knowledge Discovery and Data Mining",
        "pub_date": "2022/8/14",
        "description": "Federal funding agencies and industry entities are seeking innovative approaches to address the ever-growing cybersecurity crisis. Increasingly, numerous cybersecurity thought leaders are indicating that Artificial Intelligence (AI)-enabled analytics can help tackle key cybersecurity tasks and deploy defenses. This half-day workshop, co-located with ACM KDD, sought to attain significant research contributions to various aspects of AI-enabled analytics for cybersecurity applications and deployable defense solutions from academics and practitioners. This workshop was a joint workshop of the 2021 AI-enabled Cybersecurity Analytics and 2021 International Workshop on Deployable Machine Learning for Security Defense. As such, we developed an interdisciplinary Program Committee with significant experience in various aspects of AI, cybersecurity, and/or deployable defense.",
        "citations": 4
    },
    {
        "title": "Discovery of Rare yet Co-occurring Actions with Temporal Characteristics in Episodic Cyberattack Streams",
        "id": "flJTFn4AAAAJ:K3LRdlH-MEoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:K3LRdlH-MEoC",
        "authors": [
            "Gordon Werner",
            "Shanchieh Yang"
        ],
        "pub_source": "2022 International Conference on Computer Communications and Networks (ICCCN)",
        "pub_date": "2022/7/25",
        "description": "The large number of streaming intrusion alerts make it challenging for security analysts to quickly identify attack patterns. This is especially difficult since critical alerts often occur rarely for traditional pattern mining algorithms to be effective. Recognizing the attack speed as an inherent indicator of differing cyber attacks, this work aggregates alerts into attack episodes that have distinct attack speeds, and finds attack actions regularly co-occurring within the same episode. This enables a novel use of SPADE – a temporal pattern mining algorithm – to extract consistent co-occurrences of alert signatures that are indicative of attack actions that follow each other. The proposed system, R-CAD, extracts not only the co-occurring patterns but also the temporal characteristics of the co-occurrences, giving the ‘strong rules’ indicative of critical and repeated attack behaviors. Through the use of a real-world dataset, we …"
    },
    {
        "title": "Suffix-based Finite Automata for Learning Explainable Attacker Strategies",
        "id": "flJTFn4AAAAJ:XiSMed-E-HIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:XiSMed-E-HIC",
        "authors": [
            "Azqa Nadeem",
            "Sicco Verwer",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "",
        "pub_date": "2022/4",
        "description": "Learning about attacker behavior, such as their tactics, techniques and procedures (TTPs) is largely a manual and expert knowledge-driven task in defensive cybersecurity. An attack graph is a graphical representation of attacker strategies that shows all the pathways an attacker can use to penetrate a network. Existing techniques correlate system vulnerabilities and expert input regarding network topology to construct attack graphs, thus providing a static and hypothetical view of the threat landscape. These traditional attack graphs cannot directly be used to monitor ongoing attacks in Security Operations Centers (SOCs) since they do not show the dynamic strategies being employed by the attackers. Meanwhile, SOC analysts defend against cyber attacks by monitoring millions of intrusion alerts on a daily basis 2, often leading to ‘alert fatigue’and reduced productivity. In the accepted paper [1], we propose a novel paradigm of attack graphs, known as ‘alert-driven attack graphs’, that are learned directly from intrusion alerts without any expert input. Thus, instead of investigating large volumes of alerts, SOC analysts can visualize a few alert-driven attack graphs to understand the corresponding attacker strategies. Utilizing machine learning to extract alert-driven attack graphs, the following constraints must be addressed: 1) Alert-type imbalance: Severe alerts are infrequent, while non-severe alerts (eg, related to network scans) are common. Frequency-analysis methods discard infrequent events as noise, making most machine learning methods unsuitable for this application. 2) Modeling context: The same alert signature may be involved in different …"
    },
    {
        "title": "Enabling visual analytics via alert-driven attack graphs",
        "id": "flJTFn4AAAAJ:UxriW0iASnsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:UxriW0iASnsC",
        "authors": [
            "Azqa Nadeem",
            "Sicco Verwer",
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Proceedings of the 2021 ACM SIGSAC conference on computer and communications security",
        "pub_date": "2021/11/12",
        "description": "Attack graphs (AG) are a popular area of research that display all the paths an attacker can exploit to penetrate a network. Existing techniques for AG generation rely heavily on expert input regarding vulnerabilities and network topology. In this work, we advocate the use of AGs that are built directly using the actions observed through intrusion alerts, without prior expert input. We have developed an unsupervised visual analytics system, called SAGE, to learn alert-driven attack graphs. We show how these AGs (i) enable forensic analysis of prior attacks, and (ii) enable proactive defense by providing relevant threat intelligence regarding attacker strategies. We believe that alert-driven AGs can play a key role in AI-enabled cyber threat intelligence as they open up new avenues for attacker strategy analysis whilst reducing analyst workload.",
        "citations": 8
    },
    {
        "title": "Sage: Intrusion alert-driven attack graph extractor",
        "id": "flJTFn4AAAAJ:KxtntwgDAa4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:KxtntwgDAa4C",
        "authors": [
            "Azqa Nadeem",
            "Sicco Verwer",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2021 IEEE symposium on visualization for cyber security (VizSec)",
        "pub_date": "2021/10/27",
        "description": "Attack graphs (AG) are used to assess pathways availed by cyber adversaries to penetrate a network. State-of-the-art approaches for AG generation focus mostly on deriving dependencies between system vulnerabilities based on network scans and expert knowledge. In real-world operations however, it is costly and ineffective to rely on constant vulnerability scanning and expert-crafted AGs. We propose to automatically learn AGs based on actions observed through intrusion alerts, without prior expert knowledge. Specifically, we develop an unsupervised sequence learning system, SAGE, that leverages the temporal and probabilistic dependence between alerts in a suffix-based probabilistic deterministic finite automaton (S-PDFA) – a model that accentuates infrequent severe alerts and summarizes paths leading to them. AGs are then derived from the S-PDFA on a per-objective, per-victim basis. Tested with …",
        "citations": 14
    },
    {
        "title": "Translating intrusion alerts to cyberattack stages using pseudo-active transfer learning (PATRL)",
        "id": "flJTFn4AAAAJ:OU6Ihb5iCvQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:OU6Ihb5iCvQC",
        "authors": [
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2021 IEEE conference on communications and network security (CNS)",
        "pub_date": "2021/10/4",
        "description": "Intrusion alerts continue to grow in volume, variety, and complexity. Its cryptic nature requires substantial time and expertise to interpret the intended consequence of observed malicious actions. To assist security analysts in effectively diagnosing what alerts mean, this work develops a novel machine learning approach that translates alert descriptions to intuitively interpretable Action-Intent-Stages (AIS) with only 1% labeled data. We combine transfer learning, active learning, and pseudo labels and develop the Pseudo-Active Transfer Learning (PATRL) process. The PATRL process begins with an unsupervised-trained language model using MITRE ATT&CK, CVE, and IDS alert descriptions. The language model feeds to an LSTM classifier to train with 1% labeled data and is further enhanced with active learning using pseudo labels predicted by the iteratively improved models. Our results suggest PATRL can …",
        "citations": 8
    },
    {
        "title": "Alert-driven attack graph generation using s-pdfa",
        "id": "flJTFn4AAAAJ:SP6oXDckpogC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:SP6oXDckpogC",
        "authors": [
            "Azqa Nadeem",
            "Sicco Verwer",
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "IEEE transactions on dependable and secure computing",
        "pub_date": "2021/10/4",
        "description": "Ideal cyber threat intelligence (CTI) includes insights into attacker strategies that are specific to a network under observation. Such CTI currently requires extensive expert input for obtaining, assessing, and correlating system vulnerabilities into a graphical representation, often referred to as an attack graph (AG). Instead of deriving AGs based on system vulnerabilities, this work advocates the direct use of intrusion alerts. We propose SAGE, an explainable sequence learning pipeline that automatically constructs AGs from intrusion alerts without a priori expert knowledge. SAGE exploits the temporal and probabilistic dependence between alerts in a suffix-based probabilistic deterministic finite automaton (S-PDFA) — a model that brings infrequent severe alerts into the spotlight and summarizes paths leading to them. Attack graphs are extracted from the model on a per-victim, per-objective basis. SAGE is thoroughly …",
        "citations": 38
    },
    {
        "title": "On the evaluation of sequential machine learning for network intrusion detection",
        "id": "flJTFn4AAAAJ:1sJd4Hv_s6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:1sJd4Hv_s6UC",
        "authors": [
            "Andrea Corsini",
            "Shanchieh Jay Yang",
            "Giovanni Apruzzese"
        ],
        "pub_source": "Proceedings of the 16th International Conference on Availability, Reliability and Security",
        "pub_date": "2021/8/17",
        "description": "Recent advances in deep learning renewed the research interests in machine learning for Network Intrusion Detection Systems (NIDS). Specifically, attention has been given to sequential learning models, due to their ability to extract the temporal characteristics of network traffic flows (NetFlows), and use them for NIDS tasks. However, the applications of these sequential models often consist of transferring and adapting methodologies directly from other fields, without an in-depth investigation on how to leverage the specific circumstances of cybersecurity scenarios; moreover, there is a lack of comprehensive studies on sequential models that rely on NetFlow data, which presents significant advantages over traditional full packet captures. We tackle this problem in this paper. We propose a detailed methodology to extract temporal sequences of NetFlows that denote patterns of malicious activities. Then, we apply …",
        "citations": 16
    },
    {
        "title": "ACM KDD AI4Cyber: The 1st Workshop on Artificial Intelligence-enabled Cybersecurity Analytics",
        "id": "flJTFn4AAAAJ:CHSYGLWDkRkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:CHSYGLWDkRkC",
        "authors": [
            "Sagar Samtani",
            "Shanchieh Yang",
            "Hsinchun Chen"
        ],
        "pub_source": "Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining",
        "pub_date": "2021/8/14",
        "description": "Despite significant contributions to various aspects of cybersecurity, cyber-attacks remain on the unfortunate rise. Increasingly, internationally recognized entities such as the National Science Foundation and National Science & Technology Council have noted Artificial Intelligence can help analyze billions of log files, Dark Web data, malware, and other data sources to help execute fundamental cybersecurity tasks. Our objective for the 1st Workshop on Artificial Intelligence-enabled Cybersecurity Analytics (half-day; co-located with ACM KDD) was to gather academic and practitioners to contribute recent work pertaining to AI-enabled cybersecurity analytics. We composed an outstanding, inter-disciplinary Program Committee with significant expertise in various aspects of AI-enabled Cybersecurity Analytics to evaluate the submitted work. Significant contributions to the half-day workshop were made in the areas of …",
        "citations": 3
    },
    {
        "title": "Towards an efficient detection of pivoting activity",
        "id": "flJTFn4AAAAJ:xtRiw3GOFMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:xtRiw3GOFMkC",
        "authors": [
            "Martin Husák",
            "Giovanni Apruzzese",
            "Shanchieh Jay Yang",
            "Gordon Werner"
        ],
        "pub_source": "2021 IFIP/IEEE International Symposium on Integrated Network Management (IM)",
        "pub_date": "2021/5/17",
        "description": "Pivoting is a technique used by cyber attackers to exploit the privileges of compromised hosts in order to reach their final target. Existing research on countering this menace is only effective for pivoting activities spanning within the internal network perimeter. When applying existing methods to include external traffic, the detection algorithm produces overwhelming entries, most of which unrelated to pivoting. We address this problem by identifying the major characteristics that are specific to potentially malicious pivoting. Our analysis combines human expertise with machine learning and is based on the inspection of real network traffic generated by a large organization. The final goal is the reduction of the unacceptable amounts of false positives generated by the state of the art methods. This paper paves the way for future researches aimed at countering the critical menace of illegitimate pivoting activities.",
        "citations": 12
    },
    {
        "title": "Near real-time intrusion alert aggregation using concept-based learning",
        "id": "flJTFn4AAAAJ:NhqRSupF_l8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:NhqRSupF_l8C",
        "authors": [
            "Gordon Werner",
            "Shanchieh Jay Yang",
            "Katie McConky"
        ],
        "pub_source": "Proceedings of the 18th ACM International Conference on Computing Frontiers",
        "pub_date": "2021/5/11",
        "description": "Intrusion detection systems generate a large number of streaming alerts. It can be overwhelming for analysts to quickly and effectively find related alerts stemmed from correlated attack actions. What if fast arriving alerts could be automatically processed with no prior knowledge to find related actions in near real-time? The Concept Learning for Intrusion Event Aggregation in Realtime (CLEAR) system aims to learn and update an evolving set of temporal 'concepts,' each consisting of aggregates of related alerts that exhibit similar statistical arrival patterns. With no training data, the system constructs the concepts in near real-time from statistically similar alert aggregates. Tracked concepts are then applied to incoming alerts for fast and high-fidelity aggregation. The concepts learned by CLEAR are significantly more unique and invariant when compared to those learned by alternative drift detection methods …",
        "citations": 8
    },
    {
        "title": "Near Real-time Learning and Extraction of Attack Models from Intrusion Alerts",
        "id": "flJTFn4AAAAJ:abG-DnoFyZgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:abG-DnoFyZgC",
        "authors": [
            "Shanchieh Jay Yang",
            "Ahmet Okutan",
            "Gordon Werner",
            "Shao-Hsuan Su",
            "Ayush Goel",
            "Nathan D Cahill"
        ],
        "pub_source": "arXiv preprint arXiv:2103.13902",
        "pub_date": "2021/3/25",
        "description": "Critical and sophisticated cyberattacks often take multitudes of reconnaissance, exploitations, and obfuscation techniques to penetrate through well protected enterprise networks. The discovery and detection of attacks, though needing continuous efforts, is no longer sufficient. Security Operation Center (SOC) analysts are overwhelmed by the significant volume of intrusion alerts without being able to extract actionable intelligence. Recognizing this challenge, this paper describes the advances and findings through deploying ASSERT to process intrusion alerts from OmniSOC in collaboration with the Center for Applied Cybersecurity Research (CACR) at Indiana University. ASSERT utilizes information theoretic unsupervised learning to extract and update `attack models' in near real-time without expert knowledge. It consumes streaming intrusion alerts and generates a small number of statistical models for SOC analysts to comprehend ongoing and emerging attacks in a timely manner. This paper presents the architecture and key processes of ASSERT and discusses a few real-world attack models to highlight the use-cases that benefit SOC operations. The research team is developing a light-weight containerized ASSERT that will be shared through a public repository to help the community combat the overwhelming intrusion alerts.",
        "citations": 2
    },
    {
        "title": "Heated Alert Triage (HeAT): Network-agnostic extraction of cyber attack campaigns",
        "id": "flJTFn4AAAAJ:u9iWguZQMMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:u9iWguZQMMsC",
        "authors": [
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Proceedings of the conference on applied machine learning for information security",
        "pub_date": "2021",
        "description": "With growing sophistication and volume of cyber attacks combined with complex network structures, it is becoming extremely difficult for security analysts to corroborate evidences to identify campaigns and threats on their network. So much so that organizations employ teams of security professionals just to keep up with vast amount of data presented to the analysts each day. This work develops HeAT (Heated Alert Triage): given a critical indicator of compromise (IoC) such as a severe IDS alert, HeAT produces a HeATed Attack Campaign depicting the actions that led up to the critical event including reconnaissance and initial exploitation stages. We define the concept of “Alert Episode Heat\" to represent the analysts opinion of how much an event contributes to the attack campaign of the critical IoC given their own knowledge of their network context and security expertise. Leveraging a network-agnostic feature set and a short but targeted training process, HeAT is able to realize insightful and concise attack campaigns for IoC’s not observed before, compare attack strategies of different attackers with the same IoC, and also be applied across networks with the same degree of fidelity. HeAT maintains the analysts original assessment of the specified “HeAT\" regardless of the critical event being assessed or the network topology. We demonstrate the capabilities of HeAT with case studies using cyber-competition datasets to mimic how HeAT would be deployed in practice and assess the HeATed attack campaign from the analyst’s perspective. With the goal of aiding the analyst in quickly finding further evidence of an attack, we show that HeAT …",
        "citations": 1
    },
    {
        "title": "CLEAR-ROAD: Extraction of Temporally Co-occurring yet Rare Critical Alerts",
        "id": "flJTFn4AAAAJ:p2g8aNsByqUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:p2g8aNsByqUC",
        "authors": [
            "Gordon Werner",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "",
        "pub_date": "2021",
        "description": "Intrusion detection systems generate a large number of streaming alerts. It can be overwhelming for analysts to quickly and effectively understand behavior within a network. Critical alerts occur so infrequently that it can be difficult to determine what surrounding alerts are actually related to them, providing a deep challenge to analysts. What if an analyst could provide a collection of known critical alerts and quickly receive a summary detailing their temporal behaviors within a network as well consistently co-occurring signatures that pre-empt or succeed the critical action? What if this information could be provided in near real time, with no training data, and with the capability to adapt to changing temporal patterns and relationships across signatures? The Concept Learning for Intrusion Event Aggregation in Realtime with Rare co-Occurring Alert signature Discovery (CLEAR-ROAD) answers that question, revealing consistent co-occurrences derived from alerts with similar temporal arrival patterns. Alerts are aggregated, or sequenced, based on their unique and invariant arrival patterns, not external training data. The signature patterns expressed by such temporal activity are then discovered through pattern mining techniques. A constrained databasing approach is used to reduce the number of sequences processed by an average of 90% for individual streams. Case studies are conducted to analyze the co-occurring signatures found across two real world datasets, one from a SOC operation and another from a penetration testing competition. CLEAR-ROAD is able to find consistently cooccurring signatures across streams and datasets quickly and …"
    },
    {
        "title": "SAGE: Intrusion Alert-driven Attack Graph Extractor (Encore abstract)",
        "id": "flJTFn4AAAAJ:uWQEDVKXjbEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:uWQEDVKXjbEC",
        "authors": [
            "Azqa Nadeem",
            "Sicco Verwer",
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "33rd Benelux Conference on Artificial Intelligence and30th Belgian-Dutch Conference on Machine Learning",
        "pub_date": "2021",
        "description": "Security Operations Center (SOC) analysts investigate thousands of intrusion alerts on a daily basis, leading to alert fatigue and reduced productivity [1]. While alert correlation techniques help reduce the volume of alerts, they do not show the bigger picture of how the attack happened. Attack graphs (AG) are visual models of attacker strategies. State-of-the-art approaches for AG generation focus mostly on deriving dependencies between system vulnerabilities, based on network scans and expert knowledge [3]. In real-world operations however, it is costly and ineffective to rely on constant vulnerability scanning and expert-crafted AGs.We propose to learn AGs, purely based on the actions observed through intrusion alerts. In this paper, we develop an unsupervised sequence learning system, called SAGE (IntruSion alert-driven Attack Graph Extractor) 3. It constructs alert-driven AGs without any expert input. These AGs unlock a new means to derive intelligence regarding attacker strategies without having to investigate thousands of intrusion alerts."
    },
    {
        "title": "On the variety and veracity of cyber intrusion alerts synthesized by generative adversarial networks",
        "id": "flJTFn4AAAAJ:SeFeTyx0c_EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:SeFeTyx0c_EC",
        "authors": [
            "Christopher Sweet",
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "ACM Transactions on Management Information Systems (TMIS)",
        "pub_date": "2020/10/1",
        "description": "Many cyber attack actions can be observed, but the observables often exhibit intricate feature dependencies, non-homogeneity, and potentially rare yet critical samples. This work tests the ability to learn, model, and synthesize cyber intrusion alerts through Generative Adversarial Networks (GANs), which explore the feature space by reconciling between randomly generated samples and data that reflect a mixture of diverse attack behaviors without a priori knowledge. Through a comprehensive analysis using Jensen-Shannon Divergence, Conditional and Joint Entropy, and mode drops and additions, we show that the Wasserstein-GAN with Gradient Penalty and Mutual Information is more effective in learning to generate realistic alerts than models without Mutual Information constraints. We further show that the added Mutual Information constraint pushes the model to explore the feature space more thoroughly and …",
        "citations": 6
    },
    {
        "title": "Session-level adversary intent-driven cyberattack simulator",
        "id": "flJTFn4AAAAJ:fPk4N6BV_jEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:fPk4N6BV_jEC",
        "authors": [
            "Martin Drašar",
            "Stephen Moskal",
            "Shanchieh Yang",
            "Pavol Zat'ko"
        ],
        "pub_source": "2020 IEEE/ACM 24th International Symposium on Distributed Simulation and Real Time Applications (DS-RT)",
        "pub_date": "2020/9/14",
        "description": "Recognizing the need for proactive analysis of cyber adversary behavior, this paper presents a new event-driven simulation model and implementation to reveal the efforts needed by attackers who have various entry points into a network. Unlike previous models which focus on the impact of attackers' actions on the defender's infrastructure, this work focuses on the attackers' strategies and actions. By operating on a request-response session level, our model provides an abstraction of how the network infrastructure reacts to access credentials the adversary might have obtained through a variety of strategies. We present the current capabilities of the simulator by showing three variants of Bronze Butler APT on a network with different user access levels.",
        "citations": 24
    },
    {
        "title": "SoK: Contemporary issues and challenges to enable cyber situational awareness for network security",
        "id": "flJTFn4AAAAJ:ZHo1McVdvXMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:ZHo1McVdvXMC",
        "authors": [
            "Martin Husák",
            "Tomáš Jirsík",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Proceedings of the 15th International Conference on Availability …",
        "pub_date": "2020/8/25",
        "description": "Cyber situational awareness is an essential part of cyber defense that allows the cybersecurity operators to cope with the complexity of today's networks and threat landscape. Perceiving and comprehending the situation allow the operator to project upcoming events and make strategic decisions. In this paper, we recapitulate the fundamentals of cyber situational awareness and highlight its unique characteristics in comparison to generic situational awareness known from other fields. Subsequently, we provide an overview of existing research and trends in publishing on the topic, introduce front research groups, and highlight the impact of cyber situational awareness research. Further, we propose an updated taxonomy and enumeration of the components used for achieving cyber situational awareness. The updated taxonomy conforms to the widely-accepted three-level definition of cyber situational awareness and …",
        "citations": 30
    },
    {
        "title": "Dissecting Cyberadversarial Intrusion Stages via Interdisciplinary Observations",
        "id": "flJTFn4AAAAJ:HoB7MX3m0LUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:HoB7MX3m0LUC",
        "authors": [
            "Aunshul Rege",
            "Shanchieh Yang",
            "Alyssa Mendlein",
            "Katorah Williams",
            "Shao-Hsusan Su",
            "Stephen Moskal"
        ],
        "pub_source": "Proceedings of the Sixth International Workshop on Security and Privacy Analytics",
        "pub_date": "2020/3/16",
        "description": "Advanced Persistent Threats (APTs) are professional, sophisticated threats that pose a serious concern to our technologically-dependent society. As these threats become more common, conventional response-driven cyberattack management needs to be substituted with anticipatory defense measures. Understanding adversarial behavior and movement is critical to improve our ability to proactively defend. This paper focuses on understanding adversarial movement and adaptation using a case study from a real-time cybersecurity exercise. Through multidisciplinary methodologies from social and hard sciences, this paper presents a mechanism to dissect cyberadversarial intrusion chains to unpack movement, and adaptations."
    },
    {
        "title": "Cyberattack action-intent-framework for mapping intrusion observables",
        "id": "flJTFn4AAAAJ:yD5IFk8b50cC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:yD5IFk8b50cC",
        "authors": [
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "arXiv preprint arXiv:2002.07838",
        "pub_date": "2020/2/18",
        "description": "The techniques and tactics used by cyber adversaries are becoming more sophisticated, ironically, as defense getting stronger and the cost of a breach continuing to rise. Understanding the thought processes and behaviors of adversaries is extremely challenging as high profile or even amateur attackers have no incentive to share the trades associated with their illegal activities. One opportunity to observe the actions the adversaries perform is through the use of Intrusion Detection Systems (IDS) which generate alerts in the event that suspicious behavior was detected. The alerts raised by these systems typically describe the suspicious actions via the form of attack 'signature', which do not necessarily reveal the true intent of the attacker performing the action. Meanwhile, several high level frameworks exist to describe the sequence or chain of action types an adversary might perform. These frameworks, however, do not connect the action types to observables of standard intrusion detection systems, nor describing the plausible intents of the adversarial actions. To address these gaps, this work proposes the Action-Intent Framework (AIF) to complement existing Cyber Attack Kill Chains and Attack Taxonomies. The AIF defines a set of Action-Intent States (AIS) at two levels of description: the Macro-AIS describes 'what' the attacker is trying to achieve and the Micro-AIS describes \"how\" the intended goal is achieved. A full description of both the Macro is provided along with a set of guiding principals of how the AIS is derived and added to the framework.",
        "citations": 12
    },
    {
        "title": "ASSERT: attack synthesis and separation with entropy redistribution towards predictive cyber defense",
        "id": "flJTFn4AAAAJ:lSLTfruPkqcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:lSLTfruPkqcC",
        "authors": [
            "Ahmet Okutan",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Cybersecurity",
        "pub_date": "2019/12",
        "description": "The sophistication of cyberattacks penetrating into enterprise networks has called for predictive defense beyond intrusion detection, where different attack strategies can be analyzed and used to anticipate next malicious actions, especially the unusual ones. Unfortunately, traditional predictive analytics or machine learning techniques that require training data of known attack strategies are not practical, given the scarcity of representative data and the evolving nature of cyberattacks. This paper describes the design and evaluation of a novel automated system, ASSERT, which continuously synthesizes and separates cyberattack behavior models to enable better prediction of future actions. It takes streaming malicious event evidences as inputs, abstracts them to edge-based behavior aggregates, and associates the edges to attack models, where each represents a unique and collective attack behavior. It …",
        "citations": 15
    },
    {
        "title": "Synthetic intrusion alert generation through generative adversarial networks",
        "id": "flJTFn4AAAAJ:pqnbT2bcN3wC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:pqnbT2bcN3wC",
        "authors": [
            "Christopher Sweet",
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "MILCOM 2019-2019 IEEE Military Communications Conference (MILCOM)",
        "pub_date": "2019/11/12",
        "description": "Cyber Intrusion alerts are commonly collected by corporations to analyze network traffic and glean information about attacks perpetrated against the network. However, datasets of true malignant alerts are rare and generally only show one potential attack scenario out of many possible ones. Furthermore, it is difficult to expand the analysis of these alerts through artificial means due to the complexity of feature dependencies within an alert and lack of rare yet critical samples. This work proposes the use of a Mutual Information constrained Generative Adversarial Network as a means to synthesize new alerts from historical data. Histogram Intersection and Conditional Entropy are used to show the performance of this model as well as it's ability to learn intricate feature dependencies. The proposed models are able to capture a much wider domain of alert feature values than standard Generative Adversarial Networks …",
        "citations": 4
    },
    {
        "title": "Dynamic Generation of Empirical Cyberattack Models with Engineered Alert Features",
        "id": "flJTFn4AAAAJ:g5m5HwL7SMYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:g5m5HwL7SMYC",
        "authors": [
            "Ahmet Okutan",
            "Fu-Yuan Cheng",
            "Shao-Hsuan Su",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "MILCOM 2019-2019 IEEE Military Communications Conference (MILCOM)",
        "pub_date": "2019/11/12",
        "description": "Due to the increased diversity and complexity of cyberattacks, innovative and effective analytics are needed in order to identify critical cyber incidents on a corporate network even if no ground truth data is available. This paper develops an automated system which processes a set of intrusion alerts to create behavior aggregates and then classifies these aggregates into empirical attack models through a dynamic Bayesian approach with innovative feature engineering methods. Each attack model represents a unique collective attack behavior that helps to identify critical activities on the network. Using 2017 National Collegiate Penetration Testing Competition data, it is demonstrated that the developed system is capable of generating and refining unique attack models that make sense to human, without a priori knowledge.",
        "citations": 1
    },
    {
        "title": "On the veracity of cyber intrusion alerts synthesized by generative adversarial networks",
        "id": "flJTFn4AAAAJ:35N4QoGY0k4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:35N4QoGY0k4C",
        "authors": [
            "Christopher Sweet",
            "Stephen Moskal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "arXiv preprint arXiv:1908.01219",
        "pub_date": "2019/8/3",
        "description": "Recreating cyber-attack alert data with a high level of fidelity is challenging due to the intricate interaction between features, non-homogeneity of alerts, and potential for rare yet critical samples. Generative Adversarial Networks (GANs) have been shown to effectively learn complex data distributions with the intent of creating increasingly realistic data. This paper presents the application of GANs to cyber-attack alert data and shows that GANs not only successfully learn to generate realistic alerts, but also reveal feature dependencies within alerts. This is accomplished by reviewing the intersection of histograms for varying alert-feature combinations between the ground truth and generated datsets. Traditional statistical metrics, such as conditional and joint entropy, are also employed to verify the accuracy of these dependencies. Finally, it is shown that a Mutual Information constraint on the network can be used to increase the generation of low probability, critical, alert values. By mapping alerts to a set of attack stages it is shown that the output of these low probability alerts has a direct contextual meaning for Cyber Security analysts. Overall, this work provides the basis for generating new cyber intrusion alerts and provides evidence that synthesized alerts emulate critical dependencies from the source dataset.",
        "citations": 1
    },
    {
        "title": "Capture: cyberattack forecasting using non-stationary features with time lags",
        "id": "flJTFn4AAAAJ:70eg2SAEIzsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:70eg2SAEIzsC",
        "authors": [
            "Ahmet Okutan",
            "Shanchieh Jay Yang",
            "Katie McConky",
            "Gordon Werner"
        ],
        "pub_source": "2019 IEEE Conference on Communications and Network Security (CNS)",
        "pub_date": "2019/6/10",
        "description": "Forecasting cyberattacks before they occur is an important yet challenging task, as exploring early signs of an attack from a large volume of data is not trivial. This paper describes the design and evaluation of a novel automated system, CAPTURE, which uses a broad range of unconventional signals derived from various open sources to forecast cyberattacks towards a target organization anonymized as CorpX. It includes novel approaches to select relevant and significant, but not redundant, lagged signals and treat the non-stationary relationships between the unconventional signals and the cyberattack occurrences. Using cyber incidents recorded by a third party organization and 146 signals from a variety of sources, this paper demonstrates that CAPTURE performs significantly better than a baseline model with various configurations. Furthermore, CAPTURE offers insights to human analysts on which and how …",
        "citations": 15
    },
    {
        "title": "Experimental evaluation of jamming threat in LoRaWAN",
        "id": "flJTFn4AAAAJ:vV6vV6tmYwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:vV6vV6tmYwMC",
        "authors": [
            "Chin-Ya Huang",
            "Ching-Wei Lin",
            "Ray-Guang Cheng",
            "Shanchieh Jay Yang",
            "Shiann-Tsong Sheu"
        ],
        "pub_source": "2019 IEEE 89th Vehicular Technology Conference (VTC2019-Spring)",
        "pub_date": "2019/4/28",
        "description": "LoRaWAN is a promising solution of Low-power wide area network (LPWAN) operating in unlicensed spectrum to support long range wireless services for Internet of Things (IoTs). However, with the growth of IoT devices deployed in a fixed geographic area, the immunity to interference on the communication increases significantly. Attackers may utilize such situation to jam packet transmission by emitting RF interference signal at the same time when a LoRa end node is sending data to the LoRa gateway. As a consequence, the transmission of the LoRa end node would fail due to collision which would in turn reduce the network performance. In this paper, we implement a LoRa jammer on commercial LoRa devices by modifying the open source and figure out the proper setting of the jammer through three scenarios aiming to evaluate the influence of LoRa transmission configuration on jamming performance …",
        "citations": 25
    },
    {
        "title": "A cybersecurity dataset derived from the national collegiate penetration testing competition",
        "id": "flJTFn4AAAAJ:_xSYboBqXhAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:_xSYboBqXhAC",
        "authors": [
            "Nuthan Munaiah",
            "Justin Pelletier",
            "Shau-Hsuan Su",
            "S Yang",
            "Andrew Meneely"
        ],
        "pub_source": "HICSS Symposium on cybersecurity big data analytics",
        "pub_date": "2019/1",
        "description": "Developers, and administrators, can benefit from inculcating an attacker mindset to foreshadow potential security flaws is software systems as they are developed and/or administered. However, the lack of empirical data about real cyberattacks poses a challenge to understanding attacker behavior. In this paper, we describe a dataset captured during the recently held National Collegiate Penetration Testing Competition (CPTC) which can provide some insight into typical attackers’ modus operandi. The competition had nine teams competing to compromise an enterprise cyberinfrastructure advertised as belonging to a fictitious ride sharing organization. The dataset contains an export of over 500 million log events (with a compressed size of over 8.4 GB) and 99 virtual machines (with a compressed size of over 135 GB). The dataset is, to the best of our knowledge, the first of its kind providing insights at the application level from the perspectives of both the attacker and the victim.",
        "citations": 14
    },
    {
        "title": "Differentiating and predicting cyberattack behaviors using lstm",
        "id": "flJTFn4AAAAJ:3fE2CSJIrl8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:3fE2CSJIrl8C",
        "authors": [
            "Ian Perry",
            "Lutzu Li",
            "Christopher Sweet",
            "Shao-Hsuan Su",
            "Fu-Yuan Cheng",
            "Shanchieh Jay Yang",
            "Ahmet Okutan"
        ],
        "pub_source": "2018 IEEE Conference on Dependable and Secure Computing (DSC)",
        "pub_date": "2018/12/10",
        "description": "Classifying and predicting cyberattack behaviors are outstanding challenges due to the changing and broad attack surfaces as attackers penetrate into enterprise networks. The rise of Recurrent Neural Networks (RNNs) for temporally structured data in machine learning presents an opportunity to address these challenges, though it would require sufficient data and reasonable labels indicative of attack behaviors. This paper presents the use of RNNs to model penetration behaviors exhibited by ten teams in the 2017 Collegiate Penetration Testing Competition (CPTC'17). The Long-Short-Term-Memory (LSTM) models obtained by training on the CPTC data enable the assessment of the differentiability of attack behaviors across teams and the predictability of future actions. This first-of-its kind attempt presents observations and insights for how earlier attack actions may or may not be indicative of future behaviors. The …",
        "citations": 29
    },
    {
        "title": "Forecasting cyberattacks with incomplete, imbalanced, and insignificant data",
        "id": "flJTFn4AAAAJ:MXK_kJrjxJIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:MXK_kJrjxJIC",
        "authors": [
            "Ahmet Okutan",
            "Gordon Werner",
            "Shanchieh Jay Yang",
            "Katie McConky"
        ],
        "pub_source": "Cybersecurity",
        "pub_date": "2018/12",
        "description": "Having the ability to forecast cyberattacks before they happen will unquestionably change the landscape of cyber warfare and cyber crime. This work predicts specific types of attacks on a potential victim network before the actual malicious actions take place. The challenge to forecasting cyberattacks is to extract relevant and reliable signals to treat sporadic and seemingly random acts of adversaries. This paper builds on multi-faceted machine learning solutions and develops an integrated system to transform large volumes of public data to aggregate signals with imputation that are relevant and predictive of cyber incidents. A comprehensive analysis of the individual parts and the integrated whole demonstrates the effectiveness and trade-offs of the proposed approach. Using 16-months of reported cyber incidents by an anonymized victim organization, the integrated approach achieves up to 87%, 90 …",
        "citations": 31
    },
    {
        "title": "Extracting and evaluating similar and unique cyber attack strategies from intrusion alerts",
        "id": "flJTFn4AAAAJ:2P1L_qKh6hAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:2P1L_qKh6hAC",
        "authors": [
            "Stephen Moskal",
            "Shanchieh Jay Yang",
            "Michael E Kuhl"
        ],
        "pub_source": "2018 IEEE international conference on intelligence and security informatics (ISI)",
        "pub_date": "2018/11/9",
        "description": "Intrusion detection system (IDS) is an integral part of computer networks to monitor and detect threats. However, the alerts raised by these systems are often overwhelming to security analysts, making it difficult to uncover the steps an attacker took to compromise one or more systems in the network. This work presents a novel approach that aggregates IDS alerts and forms sequences of attack activities and their corresponding probabilistic models. This allows comparison of attack sequences to offer insights for unique as well as similar attack behaviors. We aggregate alerts by performing a Gaussian filter on specific alert attributes and model attackers using a suffix-based probabilistic model. We compare sequences generated from ten independent attacking teams with similar objectives demonstrating how our process uncovers similarities and uniqueness between the attacks that was not obvious. The sequences …",
        "citations": 23
    },
    {
        "title": "Leveraging intra-day temporal variations to predict daily cyberattack activity",
        "id": "flJTFn4AAAAJ:j3f4tGmQtD8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:j3f4tGmQtD8C",
        "authors": [
            "Gordon Werner",
            "Shanchieh Yang",
            "Katie McConky"
        ],
        "pub_source": "2018 IEEE International Conference on Intelligence and Security Informatics (ISI)",
        "pub_date": "2018/11/9",
        "description": "Cyber attacks against organizations are occurring with increasing regularity. Defensive systems are in place that can detect malicious traffic within a network. However, these systems can only provide analysis after malicious activity has occurred. What if one can forecast the number of cyberattacks expected for a future day with reasonable accuracies? This paper investigates the use of Auto-Regressive Integrated Moving Average (ARIMA) models to forecast daily counts of different cyberattack types against multiple targets. Smaller measurement periods are used to better capture temporal trends in attack data and increase forecasting accuracy, reducing error by over 14% compared to naive predictions based on average historical occurrence rates. Aggregation techniques are employed to construct a daily forecast using a number of smaller predictions, providing over 11% more accuracy than standard ARIMA …",
        "citations": 12
    },
    {
        "title": "Forecasting cyberattacks as time series with different aggregation granularity",
        "id": "flJTFn4AAAAJ:BqipwSGYUEgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:BqipwSGYUEgC",
        "authors": [
            "Gordon Werner",
            "Ahmet Okutan",
            "Shanchieh Yang",
            "Katie McConky"
        ],
        "pub_source": "2018 IEEE International Symposium on Technologies for Homeland Security (HST)",
        "pub_date": "2018/10/23",
        "description": "Cyber defense can no longer be limited to intrusion detection methods. These systems require malicious activity to enter an internal network before an attack can be detected. Having advanced, predictive knowledge of future attacks allow a potential victim to heighten security and possibly prevent any malicious traffic from breaching the network. This paper investigates the use of Auto-Regressive Integrated Moving Average (ARIMA) models and Bayesian Networks (BN) to predict future cyber attack occurrences and intensities against two target entities. In addition to incident count forecasting, categorical and binary occurrence metrics are proposed to better represent volume forecasts to a victim. Different measurement periods are used in time series construction to better model the temporal patterns unique to each attack type and target configuration, seeing over 86% improvement over baseline forecasts. Using …",
        "citations": 9
    },
    {
        "title": "Probabilistic modeling and inference for obfuscated cyber attack sequences",
        "id": "flJTFn4AAAAJ:4OULZ7Gr8RgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:4OULZ7Gr8RgC",
        "authors": [
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "arXiv preprint arXiv:1809.01562",
        "pub_date": "2018/9/5",
        "description": "A key element in defending computer networks is to recognize the types of cyber attacks based on the observed malicious activities. Obfuscation onto what could have been observed of an attack sequence may lead to mis-interpretation of its effect and intent, leading to ineffective defense or recovery deployments. This work develops probabilistic graphical models to generalize a few obfuscation techniques and to enable analyses of the Expected Classification Accuracy (ECA) as a result of these different obfuscation on various attack models. Determining the ECA is a NP-Hard problem due to the combinatorial number of possibilities. This paper presents several polynomial-time algorithms to find the theoretically bounded approximation of ECA under different attack obfuscation models. Comprehensive simulation shows the impact on ECA due to alteration, insertion and removal of attack action sequence, with increasing observation length, level of obfuscation and model complexity.",
        "citations": 1
    },
    {
        "title": "Toward intelligent autonomous agents for cyber defense: Report of the 2017 Workshop by the North Atlantic Treaty Organization (NATO) Research Group IST-152-RTG",
        "id": "flJTFn4AAAAJ:f2IySw72cVMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:f2IySw72cVMC",
        "authors": [
            "Alexander Kott",
            "Ryan Thomas",
            "Martin Drašar",
            "Markus Kont",
            "Alex Poylisher",
            "Benjamin Blakely",
            "Paul Theron",
            "Nathaniel Evans",
            "Nandi Leslie",
            "Rajdeep Singh",
            "Maria Rigaki",
            "S Jay Yang",
            "Benoit LeBlanc",
            "Paul Losiewicz",
            "Sylvain Hourlier",
            "Misty Blowers",
            "Hugh Harney",
            "Gregory Wehner",
            "Alessandro Guarino",
            "Jana Komárková",
            "James Rowell"
        ],
        "pub_source": "arXiv preprint arXiv:1804.07646",
        "pub_date": "2018/4/20",
        "description": "This report summarizes the discussions and findings of the Workshop on Intelligent Autonomous Agents for Cyber Defence and Resilience organized by the NATO research group IST-152-RTG. The workshop was held in Prague, Czech Republic, on 18-20 October 2017. There is a growing recognition that future cyber defense should involve extensive use of partially autonomous agents that actively patrol the friendly network, and detect and react to hostile activities rapidly (far faster than human reaction time), before the hostile malware is able to inflict major damage, evade friendly agents, or destroy friendly agents. This requires cyber-defense agents with a significant degree of intelligence, autonomy, self-learning, and adaptability. The report focuses on the following questions: In what computing and tactical environments would such an agent operate? What data would be available for the agent to observe or ingest? What actions would the agent be able to take? How would such an agent plan a complex course of actions? Would the agent learn from its experiences, and how? How would the agent collaborate with humans? How can we ensure that the agent will not take undesirable destructive actions? Is it possible to help envision such an agent with a simple example?",
        "citations": 8
    },
    {
        "title": "Forecasting cyber attacks with imbalanced data sets and different time granularities",
        "id": "flJTFn4AAAAJ:kNdYIx-mwKoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:kNdYIx-mwKoC",
        "authors": [
            "Ahmet Okutan",
            "Shanchieh Jay Yang",
            "Katie McConky"
        ],
        "pub_source": "arXiv preprint arXiv:1803.09560",
        "pub_date": "2018/3/26",
        "description": "If cyber incidents are predicted a reasonable amount of time before they occur, defensive actions to prevent their destructive effects could be planned. Unfortunately, most of the time we do not have enough observables of the malicious activities before they are already under way. Therefore, this work suggests to use unconventional signals extracted from various data sources with different time granularities to predict cyber incidents for target entities. A Bayesian network is used to predict cyber attacks where the unconventional signals are used as indicative random variables. This work also develops a novel minority class over sampling technique to improve cyber attack prediction on imbalanced data sets. The results show that depending on the selected time granularity, the unconventional signals are able to predict cyber attacks for the anonimyzed target organization even though the signals are not explicitly related to that organization. Furthermore, the minority over sampling approach developed achieves better performance compared to the existing filtering techniques in the literature.",
        "citations": 23
    },
    {
        "title": "Feature Engineering of Time-Series Data to Extract Discriminative Features",
        "id": "flJTFn4AAAAJ:dshw04ExmUIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:dshw04ExmUIC",
        "authors": [
            "David Stolze",
            "Katie McConky",
            "Michael Kuhl",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "IIE Annual Conference. Proceedings",
        "pub_date": "2018",
        "description": "Time-series data streams often contain predictive value in the form of unique patterns. While these patterns may be used as leading indicators for event prediction, a lack of prior knowledge of pattern shape and irregularities can render traditional forecasting methods ineffective. This research tests an automated means of predetermining the most effective combination of transformations to be applied to time-series data when training a classification algorithm. This method relies on using meta-features of a provided data set such as coefficient of variation and length to determine optimal transformations to test based on past trials. The transformations applied include converting values of the time-series data stream into a binary data set, with each anomalous value being labeled as a\" 1\". The number of binary points to be used for training is varied to determine an optimal length. The training set is then aggregated into …"
    },
    {
        "title": "Cyber threat assessment via attack scenario simulation using an integrated adversary and network modeling approach",
        "id": "flJTFn4AAAAJ:Wp0gIr-vW9MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:Wp0gIr-vW9MC",
        "authors": [
            "Stephen Moskal",
            "Shanchieh Jay Yang",
            "Michael E Kuhl"
        ],
        "pub_source": "The Journal of Defense Modeling and Simulation",
        "pub_date": "2018/1",
        "description": "Existing research on cyber threat assessment focuses on analyzing the network vulnerabilities and producing possible attack graphs. Cyber attacks in real-world enterprise networks, however, vary significantly due to not only network and system configurations, but also the attacker’s strategies. This work proposes a cyber-based attacker behavior model (ABM) in conjunction with the Cyber Attack Scenario and Network Defense Simulator to model the interaction between the network and the attackers. The ABM leverages a knowledge-based design and factors in the capability, opportunity, intent, preference, and Cyber Attack Kill Chain integration to model various types of attackers. By varying the types of attackers and the network configurations, and simulating their interactions, we present a method to measure the overall network security against cyber attackers under different scenarios. Simulation results based …",
        "citations": 43
    },
    {
        "title": "POSTER: Cyber attack prediction of threats from unconventional resources (CAPTURE)",
        "id": "flJTFn4AAAAJ:UeHWp8X0CEIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:UeHWp8X0CEIC",
        "authors": [
            "Ahmet Okutan",
            "Gordon Werner",
            "Katie McConky",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security",
        "pub_date": "2017/10/30",
        "description": "This paper outlines the design, implementation and evaluation of CAPTURE - a novel automated, continuously working cyber attack forecast system. It uses a broad range of unconventional signals from various public and private data sources and a set of signals forecasted via the Auto-Regressive Integrated Moving Average (ARIMA) model. While generating signals, auto cross correlation is used to find out the optimum signal aggregation and lead times. Generated signals are used to train a Bayesian classifier against the ground truth of each attack type. We show that it is possible to forecast future cyber incidents using CAPTURE and the consideration of the lead time could improve forecast performance.",
        "citations": 19
    },
    {
        "title": "Scanner: Sequence clustering of android resource accesses",
        "id": "flJTFn4AAAAJ:Tyk-4Ss8FVUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:Tyk-4Ss8FVUC",
        "authors": [
            "Neil Wong Hon Chan",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2017 IEEE Conference on Dependable and Secure Computing",
        "pub_date": "2017/8/7",
        "description": "The average Android OS user has on average 95 applications (apps) installed on his mobile device. On installation or at runtime, Android applications request various permissions that the users have to agree to in order to use the core functionalities of the apps. This can represent a security or privacy risk that the users are often unaware of when they simply accept the request. To better understand the behavior of these apps, there exist several static or dynamic analysis tools to extract information such as permission requirement or ratings. However most of them do not examine the sequential resource accesses of the applications which can be critical. This work presents SCANNER, a system to characterize the behavior of Android applications by examining their sequential resource access which complements the existing static and dynamic frameworks. SCANNER uses the Longest Common Subsequence (LCS …",
        "citations": 2
    },
    {
        "title": "Predicting cyber attacks with bayesian networks using unconventional signals",
        "id": "flJTFn4AAAAJ:_Qo2XoVZTnwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:_Qo2XoVZTnwC",
        "authors": [
            "Ahmet Okutan",
            "Shanchieh Jay Yang",
            "Katie McConky"
        ],
        "pub_source": "Proceedings of the 12th Annual Conference on Cyber and Information Security Research",
        "pub_date": "2017/4/4",
        "description": "The ability to predict cyber incidents before they occur will help mitigate malicious activities and their impact. This is a challenging task and a departure from intrusion detection where observables of malicious activities are analyzed. Since there is no direct observable before the cyber incident actually happens, the predictive analysis need to be based on non-conventional signals that may or may not be directly related to the potential victim entity. This paper presents our preliminary findings through the use of Bayesian classifier to process signals drawn from global events and social media. The preliminary results show promising prediction performance for an anonymized organization even though the signals are not specific to that organization.",
        "citations": 56
    },
    {
        "title": "Time series forecasting of cyber attack intensity",
        "id": "flJTFn4AAAAJ:9ZlFYXVOiuMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:9ZlFYXVOiuMC",
        "authors": [
            "Gordon Werner",
            "Shanchieh Yang",
            "Katie McConky"
        ],
        "pub_source": "Proceedings of the 12th Annual Conference on cyber and information security research",
        "pub_date": "2017/4/4",
        "description": "Cyber attacks occur on a near daily basis and are becoming exponentially more common. While some research aims to detect the characteristics of an attack, little focus has been given to patterns of attacks in general. This paper aims to exploit temporal correlations between the number of attacks per day in order to predict future intensity of cyber incidents. Through analysis of attack data collected from Hackmageddon, correlation was found among reported attack volume in consecutive days. This paper presents a forecasting system that aims to predict the number of cyber attacks on a given day based only on a set of historical attack count data. Our system conducts ARIMA time series forecasting on all previously collected incidents to predict the expected number of attacks on a future date. Our tool is able to use only a subset of data relevant to a specific attack method. Prediction models are dynamically updated …",
        "citations": 75
    },
    {
        "title": "Computer Systems, Networks, and Software Track",
        "id": "flJTFn4AAAAJ:dfsIfKJdRG4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:dfsIfKJdRG4C",
        "authors": [
            "AM Leventi-Peetz",
            "Jörg-Volker Peetz",
            "Bi Di Ying",
            "Amiya Nayak",
            "Jingzheng Wu",
            "Mutian Yang",
            "Tianyue Luo",
            "Neil Wong Hon Chan",
            "Shanchieh Jay Yang",
            "Chih-Ning Lee",
            "Yi-Ruei Chen",
            "Wen-Guey Tzeng",
            "Yuan Hsiang Su",
            "Amir Rezapour",
            "Zhenghao Hu",
            "Hui Wang",
            "Juanru Li",
            "Wenbo Yang",
            "Yuanyuan Zhang",
            "Dawu Gu",
            "Yacine Hebbal",
            "Sylvie Laniepce",
            "Jean-Marc Menaud",
            "Ming-Hung Shih",
            "Morris Chang",
            "Sen Wang Di Zhuang",
            "J Morris Chang",
            "Chiawei Wang",
            "Shiuhpyng Shieh"
        ],
        "pub_source": "",
        "pub_date": "2017",
        "description": "The following topics are dealt with: computer systems; computer networks; software track; VLSI; and CAD."
    },
    {
        "title": "Modeling information sharing behavior on Q&A forums",
        "id": "flJTFn4AAAAJ:R3hNpaxXUhUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:R3hNpaxXUhUC",
        "authors": [
            "Biru Cui",
            "Shanchieh Jay Yang",
            "Christophan M Homan"
        ],
        "pub_source": "Advances in Knowledge Discovery and Data Mining: 21st Pacific-Asia Conference, PAKDD 2017, Jeju, South Korea, May 23-26, 2017, Proceedings, Part II 21",
        "pub_date": "2017",
        "description": "Q&A forums pool massive amounts of crowd expertise from a broad spectrum of geographical, cultural, and disciplinary knowledge toward specific, user-posed questions. Existing studies on these forums focus on how to route questions to the best answerers based on content or predict whether a question will be answered, but few of them investigated the inherent knowledge sharing relationship among users. We study knowledge sharing among users of StackOverflow, a popular Q&A forum, where the knowledge sharing process is related to the time elapsed since a question was posted, the reputation of the questioner, and the content of the posted text. Taking these factors into consideration, the paper proposes time-based information sharing model (TISM), where the likelihood a user will share or provide knowledge to another is modeled as a continuous function of time, reputation, and post length …",
        "citations": 3
    },
    {
        "title": "Assessing the likelihood of cyber network infiltration using rare-event simulation",
        "id": "flJTFn4AAAAJ:bFI3QPDXJZMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:bFI3QPDXJZMC",
        "authors": [
            "Alexander L Krall",
            "Michael E Kuhl",
            "Stephen F Moskal",
            "Shanchieh J Yang"
        ],
        "pub_source": "2016 IEEE Symposium Series on Computational Intelligence (SSCI)",
        "pub_date": "2016/12/6",
        "description": "Network infiltration is one of many types of cyber-based attacks that may be of interest to a cyber security analyst. Sufficient observation of particular events that may be uncommon during network infiltration requires special simulation techniques. This paper presents an application of the importance sampling method to estimate the likelihood of a successful network infiltration, given that sufficiently many network alerts have not been generated to achieve said success. The benefits of utilizing importance sampling within this context are assessed against the use of standard simulation.",
        "citations": 5
    },
    {
        "title": "Issues and challenges of the applications of context to enhance information fusion: panel summary",
        "id": "flJTFn4AAAAJ:4JMBOYKVnBMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:4JMBOYKVnBMC",
        "authors": [
            "Erik Blasch",
            "Ivan Kadar",
            "Chee Chong",
            "Alan Steinberg",
            "Ronald PS Mahler",
            "Shanchieh Jay Yang",
            "Laurie H Fenstermacher",
            "Alex L Chan",
            "Paul Tandy"
        ],
        "pub_source": "Signal Processing, Sensor/Information Fusion, and Target Recognition XXV …",
        "pub_date": "2016/5/17",
        "description": "During the 2015 SPIE DSS conference, nine panelists were invited to highlight the trends and use of context for information fusion. This paper highlights the common issues and trends presented from the panel discussion. The different panelists highlighted methods of filtering methods, data aggregation, and the importance of context for realtime analytics. Using the panelist perspectives, the review organizes the common issues and themes as well areas of future analysis of content and context enrichment from information fusion.",
        "citations": 2
    },
    {
        "title": "Privacy sensitive resource access monitoring for android systems",
        "id": "flJTFn4AAAAJ:aqlVkmm33-oC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:aqlVkmm33-oC",
        "authors": [
            "Leah Zhao",
            "Neil Wong Hon Chan",
            "Shanchieh Jay Yang",
            "Roy W Melton"
        ],
        "pub_source": "2015 24th International Conference on Computer Communication and Networks (ICCCN)",
        "pub_date": "2015/8/3",
        "description": "Existing works have studied how to collect and analyze human usage of mobile devices, to aid in further understanding of human behavior. Typical data collection utilizes applications or background services installed on the mobile device with user permission to collect user usage data via accelerometer, call logs, location, Wi-Fi transmission, etc. through a data tainting process. Built on the existing work, this research developed a system called Panorama (Privacy-sensitive Resource Access Monitoring for Android Systems) to collect application behavior instead of user behavior. The goal is to provide the means to analyze how background services access mobile resources, and potentially to identify suspicious applications that access sensitive user information. Panorama tracks the access of mobile resources in real time and enhances the concept of taint tracking. Each identified user privacy-sensitive resource is …",
        "citations": 7
    },
    {
        "title": "Mission impact assessment for cyber warfare",
        "id": "flJTFn4AAAAJ:hMod-77fHWUC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:hMod-77fHWUC",
        "authors": [
            "Jared Holsopple",
            "Shanchieh Jay Yang",
            "Moises Sudit"
        ],
        "pub_source": "Intelligent Methods for Cyber Warfare",
        "pub_date": "2015",
        "description": "Cyber networks are used extensively by not only a nation’s military to protect sensitive information and execute missions, but also the primary infrastructure that provides services that enable modern conveniences such as education, potable water, electricity, natural gas, and financial transactions. Disruption of any of these services could have widespread impacts not only to citizens’ well-being. As such, these critical services may be targeted by malicious hackers during cyber warfare. Due to the increasing dependence on computers for military and infrastructure purposes, it is imperative to not only protect them and mitigate any immediate or potential threats, but to also understand the current or potential impacts beyond the cyber networks or the organization. This increased dependence means that a cyber attack may not only affect the cyber network, but also other tasks or missions that are dependent upon …",
        "citations": 12
    },
    {
        "title": "Cyber insider mission detection for situation awareness",
        "id": "flJTFn4AAAAJ:LkGwnXOMwfcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:LkGwnXOMwfcC",
        "authors": [
            "Haitao Du",
            "Changzhou Wang",
            "Tao Zhang",
            "Shanchieh Jay Yang",
            "Jai Choi",
            "Peng Liu"
        ],
        "pub_source": "Intelligent Methods for Cyber Warfare",
        "pub_date": "2015",
        "description": "Cyber insider detection is challenging due to the difficulty in differentiating legitimate activities from malicious ones. This chapter will begin by providing a brief review of exiting works in the machine learning community that offer treatments to cyber insider detection. The review will lead to our recent research advance that focuses on early detection of ongoing insider mission instead of trying to determine whether individual events are malicious or not. Multiple automated software agents are assumed to possess different account privileges on different hosts, to perform different dimensions of a complex insider mission. This work develops an integrated approach that utilizes Hidden Markov Models to estimate the suspicious level of insider activities, and then fuses these suspiciousness values across insider activity dimensions to estimate the progression of an insider mission. The fusion across cyber insider …",
        "citations": 6
    },
    {
        "title": "Non-independent cascade formation: Temporal and spatial effects",
        "id": "flJTFn4AAAAJ:u-x6o8ySG0sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:u-x6o8ySG0sC",
        "authors": [
            "Biru Cui",
            "Shanchieh Jay Yang",
            "Christopher Homan"
        ],
        "pub_source": "Proceedings of the 23rd ACM International Conference on Conference on Information and Knowledge Management",
        "pub_date": "2014/11/3",
        "description": "Determining cascade size and the factors affecting cascade size are two fundamental research problems in social network analysis. The commonly considered independent cascade model, when applied to social networks such as Digg, produces a phase-transition phenomenon where the cascade is either very small or very large. This phenomenon can be explained based on the concept of Giant Propagation Component (GPC). The GPC is defined as a maximally connected component, such that, by applying the independent cascade model, once any node of the component is infected, most of the remaining nodes in the component will eventually become infected with a high probability. While GPC exists in social networks, the phase-transition phenomenon, is not observed in the actual cascade size distribution when the information propagation is due to actions such as ``like'' or ``dig''. This paper hypothesizes …",
        "citations": 6
    },
    {
        "title": "NRE: Suppress selective forwarding attacks in wireless sensor networks",
        "id": "flJTFn4AAAAJ:RGFaLdJalmkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:RGFaLdJalmkC",
        "authors": [
            "Biru Cui",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2014 IEEE Conference on Communications and Network Security",
        "pub_date": "2014/10/29",
        "description": "Selective Forwarding (SF) attacks impact the data transmission integrity by not forwarding a subset of received packets from time to time. The `selective' characteristic makes SF attacks hard to be distinguished from the normal packet drops or poor receptions in a volatile wireless environment. To understand this stealthy attack, an analytical model is developed to estimate the wellness of a node's forwarding behavior. Further analysis examines the cases where multiple nodes launch SF attacks in a Wireless Sensor Network (WSN), where we borrow the idea of the PageRank algorithm to estimate the most susceptible nodes to SF attacks in a network. Based on the analyses, we develop a novel reactive routing scheme that bypass suspicious nodes by estimating parent node's reliability and link quality in an integrated manner. The proposed scheme is compared to traditional approaches that also use the Node …",
        "citations": 18
    },
    {
        "title": "Context model fusion for multistage network attack simulation",
        "id": "flJTFn4AAAAJ:bEWYMUwI8FkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:bEWYMUwI8FkC",
        "authors": [
            "Stephen Moskal",
            "Ben Wheeler",
            "Derek Kreider",
            "Michael E Kuhl",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2014 IEEE Military Communications Conference",
        "pub_date": "2014/10/6",
        "description": "Analyzing and predicting complex network attack strategies require an efficient way to produce realistic and up-to-date data representing a variety of attack behaviors on diverse network configurations. This work develops a simulation system that fuses four context models: the networks, the system vulnerabilities, the attack behaviors, and the attack scenarios, so as to synthesize multistage attack sequences. The separation of different context models enables flexibility and usability in defining these models, as well as a comprehensive synthesis of attack sequences under different combinations of situations. After describing the design of the context models, an example use of the simulator and sample outputs, including the ground truth actions and sensor observables, will be discussed.",
        "citations": 27
    },
    {
        "title": "Impact assessment",
        "id": "flJTFn4AAAAJ:GnPB-g6toBAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:GnPB-g6toBAC",
        "authors": [
            "Jared Holsopple",
            "Moises Sudit",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Cyber Defense and Situational Awareness",
        "pub_date": "2014/10/2",
        "description": "As the Foundations and Challenges chapter explained, the second level of SA is called comprehension and deals with determining the significance and relations of various elements of the situation to other elements and to the overall goals of the network. It is also often called situation understanding and involves the “so what” of the information that has been perceived. Previous chapters of this book have not focused on this level of SA. Therefore, this chapter elaborates specifically on the comprehension level of CSA. The chapter explains that an effective way to comprehend significant relations between the disparate elements of the situation is to concentrate on how these elements impact the mission of the network. This involves asking and answering questions of how various suspected attacks relate to each other, how they relate to remaining capabilities of the network’s components, and how the resulting …",
        "citations": 6
    },
    {
        "title": "Attack projection",
        "id": "flJTFn4AAAAJ:2osOgNQ5qMEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:2osOgNQ5qMEC",
        "authors": [
            "Shanchieh Jay Yang",
            "Haitao Du",
            "Jared Holsopple",
            "Moises Sudit"
        ],
        "pub_source": "Cyber Defense and Situational Awareness, 239-261",
        "pub_date": "2014/10/2",
        "description": "Having dedicated the previous chapter to the second level of SA, we now proceed to the third level. The highest level of SA—projection—involves envisioning how the current situation may evolve into the future situation and the anticipation of the future elements of the situation. In the context of CSA, particularly important is the projection of future cyber attacks, or future phases of an ongoing cyber attack. Attacks often take a long time and involve multitudes of reconnaissance, exploitations, and obfuscation activities to achieve the goal of cyber espionage or sabotage. The anticipation of future attack actions is generally derived from the presently observed malicious activities. This chapter reviews the existing state-of-the-art techniques for network attack projection, and then explains how the estimates of ongoing attack strategies can then be used to provide a prediction of likely upcoming threats to critical …",
        "citations": 51
    },
    {
        "title": "Probabilistic inference for obfuscated network attack sequences",
        "id": "flJTFn4AAAAJ:7PzlFSSx8tAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:7PzlFSSx8tAC",
        "authors": [
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2014 44th Annual IEEE/IFIP International Conference on Dependable Systems and Networks",
        "pub_date": "2014/6/23",
        "description": "Facing diverse network attack strategies and overwhelming alters, much work has been devoted to correlate observed malicious events to pre-defined scenarios, attempting to deduce the attack plans based on expert models of how network attacks may transpire. Sophisticated attackers can, however, employ a number of obfuscation techniques to confuse the alert correlation engine or classifier. Recognizing the need for a systematic analysis of the impact of attack obfuscation, this paper models attack strategies as general finite order Markov models, and treats obfuscated observations as noises. Taking into account that only finite observation window and limited computational time can be afforded, this work develops an algorithm to efficiently inference on the joint distribution of clean and obfuscated attack sequences. The inference algorithm recovers the optimal match of obfuscated sequences to attack models …",
        "citations": 18
    },
    {
        "title": "Engaging Computer Engineering Freshmen through a Voluntary Competitive Team Project with Mentoring",
        "id": "flJTFn4AAAAJ:P5F9QuxV20EC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:P5F9QuxV20EC",
        "authors": [
            "Roy W Melton",
            "Shanchieh Jay Yang",
            "Adriana Becker-Gomez"
        ],
        "pub_source": "2014 ASEE Annual Conference & Exposition",
        "pub_date": "2014/6/15",
        "description": "Engaging Computer Engineering Freshmen through a Voluntary Competitive Team Project with MentoringMany freshman computer engineering students need hands-on activity in addition to classroominstruction to sustain their interest and motivation in their chosen discipline. Whereas a requiredcourse with lab had typically filled this need in spring, last spring we offered our freshmen azero-credit freshman project with one scheduled contact hour per week and with no grade. Unlike the required course with lab where students learned through traditional instruction forassessment by homework, quizzes, exams, and lab demonstrations, participation in the freshmanproject was voluntary, and students learned primarily through mentoring for assessment in a finalcompetition. The project consisted of incorporating a commercial off-the-shelf radio controlled (RC) car witha provided microcontroller, motor driver circuitry …",
        "citations": 1
    },
    {
        "title": "Segmenting large-scale cyber attacks for online behavior model generation",
        "id": "flJTFn4AAAAJ:qjMakFHDy7sC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:qjMakFHDy7sC",
        "authors": [
            "Steven Strapp",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "International Conference on Social Computing, Behavioral-Cultural Modeling, and Prediction",
        "pub_date": "2014/4/1",
        "description": "Large-scale cyber attack traffic can present challenges to identify which packets are relevant and what attack behaviors are present. Existing works on Host or Flow Clustering attempt to group similar behaviors to expedite analysis, often phrasing the problem as offline unsupervised machine learning. This work proposes online processing to simultaneously segment traffic observables and generate attack behavior models that are relevant to a target. The goal is not just to aggregate similar attack behaviors, but to provide situational awareness by grouping relevant traffic that exhibits one or more behaviors around each asset. The seemingly clustering problem is recast as a supervised learning problem: classifying received traffic to the most likely attack model, and iteratively introducing new models to explain received traffic. A graph-based prior is defined to extract the macroscopic attack structure, which …",
        "citations": 12
    },
    {
        "title": "Who Will Follow a New Topic Tomorrow?",
        "id": "flJTFn4AAAAJ:3s1wT3WcHBgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:3s1wT3WcHBgC",
        "authors": [
            "Biru Cui",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Social Computing, Behavioral-Cultural Modeling and Prediction: 7th International Conference, SBP 2014, Washington, DC, USA, April 1-4, 2014. Proceedings 7",
        "pub_date": "2014",
        "description": "When a novel research topic emerges, we are interested in discovering how the topic will propagate over the bibliography network, i.e., which author will research and publish about this topic. Inferring the underlying influence network among authors is the basis of predicting such topic adoption. Existing works infer the influence network based on past adoption cascades, which is limited by the amount and relevance of cascades collected. This work hypothesizes that the influence network structure and probabilities are the results of many factors including the social relationships and topic popularity. These heterogeneous information shall be optimized to learn the parameters that define the homogeneous influence network that can be used to predict future cascade. Experiments using DBLP data demonstrate that the proposed method outperforms the algorithm based on traditional cascade network …"
    },
    {
        "title": "Social Computing, Behavioral-Cultural Modeling, and Prediction",
        "id": "flJTFn4AAAAJ:UebtZRa9Y70C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:UebtZRa9Y70C",
        "authors": [
            "William G Kennedy",
            "Nitin Agarwal",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Springer",
        "pub_date": "2014",
        "description": "This volume contains the accepted papers presented orally and as posters at the 2014 International Conference on Social Computing, Behavioral-Cultural Modeling, and Prediction (SBP 2014). This was the seventh year of the SBP conference, and the fourth since it merged with the International Conference on Computational Cultural Dynamics (ICCCD). This year the SBP 2014 conference was co-located with the Behavioral Representation in Modeling and Simulation (BRiMS) conference, which had a separate submission, review, and acceptance process and produces a separate record of its proceedings. In 2014 the SBP conference continued its traditions. We received a set of 101 submissions (from 17 countries), down from last year’s 137 submissions but better than the prior highest number of 88 submissions. SBP continued to be a selective, single-track conference. Twenty-four submissions were accepted as …",
        "citations": 11
    },
    {
        "title": "Design and implementation of a Skype Protocol Analyzer",
        "id": "flJTFn4AAAAJ:NaGl4SEjCO4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:NaGl4SEjCO4C",
        "authors": [
            "Ray-Guang Cheng",
            "Po-Yao Tsai",
            "Ping-Chen Lin",
            "Chia-Liang Lian",
            "Tse-Han Liu",
            "Hsien-Cheng Chou",
            "Shiao-Li Tsao",
            "Shanchieh Yang"
        ],
        "pub_source": "2013 IEEE Conference on Communications and Network Security (CNS)",
        "pub_date": "2013/10/14",
        "description": "Proprietary protocols on the Internet often pose challenges for users and analysts to determine how secure the applications are or how easy private information can be accessed. This work presents a tool that processes packets generated by Skype and analyzes its proprietary implementation. The goal of the exercise is to determine how one may reverse engineer a proprietary protocol and obtain private information. The results demonstrate that a buddy-list of a target user can be obtained through the developed Skype Protocol Analyzer.",
        "citations": 3
    },
    {
        "title": "Simulating attack behaviors in enterprise networks",
        "id": "flJTFn4AAAAJ:IWHjjKOFINEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:IWHjjKOFINEC",
        "authors": [
            "Stephen Moskal",
            "Derek Kreider",
            "Lydia Hays",
            "Ben Wheeler",
            "Shanchieh Jay Yang",
            "Michael Kuhl"
        ],
        "pub_source": "2013 IEEE Conference on Communications and Network Security (CNS), 359-360",
        "pub_date": "2013/10/14",
        "description": "Research works on cyber security have shifted from simply hardening the networked systems to enabling fight-through technologies where the system is resilient to sophisticated attacks. A much-needed effort in this new premise is a better understanding of how attackers might behave within a well-protected network. Attack behavior analysis can benefit from automated simulations for large-scale enterprise networks. This work reviews existing efforts on attack behavior modeling and simulation, leading to the discussion of CyberSim, a modular system for cyber attack behavior simulation.",
        "citations": 11
    },
    {
        "title": "Sequential modeling for obfuscated network attack action sequences",
        "id": "flJTFn4AAAAJ:mVmsd5A6BfQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:mVmsd5A6BfQC",
        "authors": [
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2013 IEEE Conference on Communications and Network Security (CNS)",
        "pub_date": "2013/10/14",
        "description": "This work presents a preliminary study of modeling obfuscation techniques for network attack action sequences. The aim is to develop a systematic analytical methodology that shows how intentional obfuscation or unintentional noise may affect the modeling and classification of attack sequences. Discussions on different types of obfuscation techniques will be given, followed by a formal formulation to represent the effect of obfuscation within attack sequences. Preliminary simulation results are presented to demonstrate the impact of attack sequences with and without obfuscated attack actions.",
        "citations": 4
    },
    {
        "title": "Introduction to the special section on social computing, behavioral-cultural modeling, and prediction",
        "id": "flJTFn4AAAAJ:4TOpqqG69KYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:4TOpqqG69KYC",
        "authors": [
            "Shanchieh Jay Yang",
            "Dana Nau",
            "John Salerno"
        ],
        "pub_source": "ACM Transactions on Intelligent Systems and Technology (TIST) 4 (3), 1-2",
        "pub_date": "2013/7/1",
        "description": "Social computing harnesses the power of computational methods to study social behavior and social context. Behavioral-cultural modeling refers to representing behavior in the abstract and is a convenient and powerful way to conduct virtual experiments and scenario planning. Both social computing and behavioral-cultural modeling are techniques designed to achieve a better understanding and prediction of complex behaviors, patterns, and associated outcomes of interest. These approaches are inherently interdisciplinary and cross disparate disciplines, and they require collaborative efforts to take advantage of the state-of-the-art research in order to document lessons learned and develop novel theories, experiments, and methodologies in terms of social, physical, psychological, and governmental mechanisms. This special section aims at providing a forum for researchers to disseminate their interdisciplinary …",
        "citations": 1
    },
    {
        "title": "Influence versus intent for predictive analytics in situation awareness",
        "id": "flJTFn4AAAAJ:u_35RYKgDlwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:u_35RYKgDlwC",
        "authors": [
            "Biru Cui",
            "Shanchieh Jay Yang",
            "Ivan Kadar"
        ],
        "pub_source": "Signal Processing, Sensor Fusion, and Target Recognition XXII",
        "pub_date": "2013/5/23",
        "description": "Predictive analytics in situation awareness requires an element to comprehend and anticipate potential adversary activities that might occur in the future. Most work in high level fusion or predictive analytics utilizes machine learning, pattern mining, Bayesian inference, and decision tree techniques to predict future actions or states. The emergence of social computing in broader contexts has drawn interests in bringing the hypotheses and techniques from social theory to algorithmic and computational settings for predictive analytics. This paper aims at answering the question on how influence and attitude (some interpreted such as intent) of adversarial actors can be formulated and computed algorithmically, as a higher level fusion process to provide predictions of future actions. The challenges in this interdisciplinary endeavor include drawing existing understanding of influence and attitude in both social science …",
        "citations": 1
    },
    {
        "title": "Summary of human social, cultural, behavioral (HSCB) modeling for information fusion panel discussion",
        "id": "flJTFn4AAAAJ:QIV2ME_5wuYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:QIV2ME_5wuYC",
        "authors": [
            "Erik Blasch",
            "John Salerno",
            "Ivan Kadar",
            "Shanchieh Jay Yang",
            "Laurie Fenstermacher",
            "Mica Endsley",
            "Lynne Grewe"
        ],
        "pub_source": "Signal Processing, Sensor Fusion, and Target Recognition XXII",
        "pub_date": "2013/5/23",
        "description": "During the SPIE 2012 conference, panelists convened to discuss “Real world issues and challenges in Human Social/Cultural/Behavioral modeling with Applications to Information Fusion.” Each panelist presented their current trends and issues. The panel had agreement on advanced situation modeling, working with users for situation awareness and sense-making, and HSCB context modeling in focusing research activities. Each panelist added different perspectives based on the domain of interest such as physical, cyber, and social attacks from which estimates and projections can be forecasted. Also, additional techniques were addressed such as interest graphs, network modeling, and variable length Markov Models. This paper summarizes the panelists discussions to highlight the common themes and the related contrasting approaches to the domains in which HSCB applies to information fusion applications.",
        "citations": 27
    },
    {
        "title": "Handling temporal and functional changes for mission impact assessment",
        "id": "flJTFn4AAAAJ:JV2RwH3_ST0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:JV2RwH3_ST0C",
        "authors": [
            "Jared Holsopple",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2013 IEEE International Multi-Disciplinary Conference on Cognitive Methods in Situation Awareness and Decision Support (CogSIMA)",
        "pub_date": "2013/2/25",
        "description": "Mission impact assessment for computer networks has become increasingly important as the prevalent cyber assets support more and more mission critical infrastructure for daily operations as well as emergency responses. Existing work lacks comprehensive and systematic treatment and thus may not be able to provide timely assessment. Evolving from a general graphical representation of cyber assets, this work develops a Mission Tree model that adapts to both functional and temporal changes. The proposed approach will be shown to support the estimate of current impact as well as predict future impact based on an efficient upward propagation through the assets and aggregation functions that reflect how assets functionally support different tasks and missions.",
        "citations": 6
    },
    {
        "title": "Who shall we follow in twitter for cyber vulnerability?",
        "id": "flJTFn4AAAAJ:e5wmG9Sq2KIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:e5wmG9Sq2KIC",
        "authors": [
            "Biru Cui",
            "Stephen Moskal",
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Social Computing, Behavioral-Cultural Modeling and Prediction: 6th International Conference, SBP 2013, Washington, DC, USA, April 2-5, 2013. Proceedings 6",
        "pub_date": "2013",
        "description": "Twitter has become a key social media for sharing information, not only for casual conversations but also for business and technologies. As the Twitter community continues to grow, an intriguing question is to determine how to obtain most valuable information the earliest by following fewest Tweeters or Tweets. This multi-criteria optimization problem exhibits similar features as in the information cascade problem for blogs. This work revises an information cascade outbreak detection algorithm to find critical Twitter accounts that disseminate the most cyber vulnerabilities the earliest. Three award functions are defined to evaluate every account’s contribution per topic from three aspects: timeliness, originality and influence. Critical users are selected according to their total contribution on a specific security category. Experiments were conducted using Tweets containing CVE information over a five-week period …",
        "citations": 9
    },
    {
        "title": "Temporal and spatial analyses for large-scale cyber attacks",
        "id": "flJTFn4AAAAJ:roLk4NBRz8UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:roLk4NBRz8UC",
        "authors": [
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Handbook of Computational Approaches to Counterterrorism",
        "pub_date": "2012/11/8",
        "description": "Prevalent computing devices with networking capabilities have become critical cyber infrastructure for government, industry, academia and every-day life. As their value rises, the motivation driving cyber attacks on this infrastructure has shifted from the pursuit of notoriety to the pursuit of profit [1, 2] or political gains, leading to cyber terrorism on various scales. Cyber terrorism has had its share of case studies and definitions since late 1990s and early 2000s [3–5]. A common denominator of the definition of cyber terrorism is the threat posed through the use of cyber infrastructure, especially the Internet. Stuxnet, a malware discovered in June 2010, which was a directed attack against the Iranian nuclear program [6], represented a milestone on cyber warfare and posed a new challenge to analyze and understand cyber attacks due to its complexity in attack strategy. While cyber terrorism can have many elements …",
        "citations": 12
    },
    {
        "title": "Social computing, behavioral-cultural modeling and prediction",
        "id": "flJTFn4AAAAJ:Y0pCki6q_DkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:Y0pCki6q_DkC",
        "authors": [
            "S Yang",
            "A Greenberg",
            "M Endsley"
        ],
        "pub_source": "College Park, MD: Springer",
        "pub_date": "2012",
        "description": "Welcome to the 2011 international conference on Social Computing, Behavioral–Cultural Modeling and Prediction (SBP11). The overall goal of the conference is to bring together a diverse set of researchers/disciplines to promote interaction and assimilation so as to understand social computing and behavior modeling. In 2008, the first year of SBP, we held a workshop and had 34 papers submitted; in 2010 we had grown to a conference and had 78 submissions. This year, our fourth, we continued to expand, joining forces with the International Conference on Cultural Dynamics (and amending our name accordingly) and we received a record 88 submissions. The submissions were from Asia, Oceania, Europe, and the Americas. We are extremely delighted that the technical program encompassed keynote speeches, invited talks, and high-quality contributions from multiple disciplines. We truly hope that our …",
        "citations": 54
    },
    {
        "title": "Characterizing transition behaviors in internet attack sequences",
        "id": "flJTFn4AAAAJ:0EnyYjriUFMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:0EnyYjriUFMC",
        "authors": [
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2011 Proceedings of 20th International Conference on Computer Communications and Networks (ICCCN)",
        "pub_date": "2011/7/31",
        "description": "Cyber attacks from the Internet often span over multiple ports and multiple hosts. This work hypothesizes that there are distinct sequential patterns revealing hacking behavior. A feature called Attack Transition Action (ATA) is defined to represent the changes on attacked destinations and ports over time. The simplicity of the feature enables the development of a probabilistic model, revealing higher order transitions hidden within the attack sequences. The model trained with a real-world attack dataset uncovers several natural clusters of Internet attack behaviors. The discovered behavior patterns are explained with representative hacking strategies. Our systematic modeling and analysis provides an effective means to characterize classes of Internet attacks.",
        "citations": 7
    },
    {
        "title": "Optimizing collection requirements through analysis of plausible impact",
        "id": "flJTFn4AAAAJ:M3NEmzRMIkIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:M3NEmzRMIkIC",
        "authors": [
            "Khiem Tong",
            "Shanchieh Jay Yang",
            "Moises Sudit",
            "Jared Holsopple"
        ],
        "pub_source": "14th International Conference on Information Fusion",
        "pub_date": "2011/7/5",
        "description": "Intelligence collection, while critical in mission planning, lacks systematic means to quantify its value for optimal prioritization. This work proposes a framework that starts with analyzing the plausible impacts imposed on assets and mission due to predicted adversary activities. The candidate collection requirements, derived from plausible futures, are evaluated for their benefits to mitigate potential impact to mission success. A Mixed Integer Programming problem is formulated to model the tradeoff between maximizing mission impact mitigation and satisfying resource constraints. A case study is presented to demonstrate the effectiveness of the framework, where insights are obtained based on the optimal solutions."
    },
    {
        "title": "Discovering collaborative cyber attack patterns using social network analysis",
        "id": "flJTFn4AAAAJ:iH-uZ7U-co4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:iH-uZ7U-co4C",
        "authors": [
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Social Computing, Behavioral-Cultural Modeling and Prediction: 4th International Conference, SBP 2011, College Park, MD, USA, March 29-31, 2011. Proceedings 4",
        "pub_date": "2011",
        "description": "This paper investigates collaborative cyber attacks based on social network analysis. An Attack Social Graph (ASG) is defined to represent cyber attacks on the Internet. Features are extracted from ASGs to analyze collaborative patterns. We use principle component analysis to reduce the feature space, and hierarchical clustering to group attack sources that exhibit similar behavior. Experiments with real world data illustrate that our framework can effectively reduce from large dataset to clusters of attack sources exhibiting critical collaborative patterns.",
        "citations": 38
    },
    {
        "title": "Toward ensemble characterization and projection of multistage cyber attacks",
        "id": "flJTFn4AAAAJ:NMxIlDl6LWMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:NMxIlDl6LWMC",
        "authors": [
            "Haitao Du",
            "Daniel F Liu",
            "Jared Holsopple",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2010 Proceedings of 19th International Conference on Computer Communications and Networks",
        "pub_date": "2010/8/2",
        "description": "With expanding network infrastructures, increasing vulnerabilities and uncertain malicious activities, cyber security research has begun to provide situation assessment beyond Intrusion Detection Systems (IDSs). A key goal of cyber situation assessment is to efficiently and effectively project the likely future targets of ongoing multistage attacks. This work presents two ensemble techniques that combine real-time projection algorithms modeling the behavior, capability, and opportunity of malicious activities in a network. Sugeno fuzzy inference system and Transferable Belief Model are used to combine supporting evidence and resolve conflicts between the algorithm outputs. The two ensemble techniques are analyzed and compared using simulated attack datasets generated for varying network environments and attack parameters. The results are discussed to reveal the benefits and limitations of individual …",
        "citations": 42
    },
    {
        "title": "Issues and challenges in higher level fusion: Threat/impact assessment and intent modeling (a panel summary)",
        "id": "flJTFn4AAAAJ:O3NaXMp0MMsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:O3NaXMp0MMsC",
        "authors": [
            "John J Salerno",
            "Shanchieh Jay Yang",
            "Ivan Kadar",
            "Moises Sudit",
            "George P Tadda",
            "Jared Holsopple"
        ],
        "pub_source": "2010 13th International Conference on Information Fusion, 1-17",
        "pub_date": "2010/7/26",
        "description": "Many say that we live in the information age, but in reality if you ask any analyst today they would say we live in the data age. The amount of data being presented and displayed to the analyst is overwhelming - to a point that in many cases they are missing the salient or key activities of interest. Analysts are spending the majority of their time filtering through the data rather than performing analysis. Over the past 10 years, there has been an increasing emphasis on research in higher level fusion or what many are calling situation awareness. In this paper, we describe a collection of research addressing the challenges of enabling situation awareness. We will review our reference model and provide a discussion of a flow through the model to include how we can rank various activities based on their impact and threat. We also provide a number of algorithms that have been implemented and then tested and evaluated …",
        "citations": 35
    },
    {
        "title": "Clustering of multistage cyber attacks using significant services",
        "id": "flJTFn4AAAAJ:eQOLeE2rZwMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:eQOLeE2rZwMC",
        "authors": [
            "Christopher T Murphy",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2010 13th International Conference on Information Fusion",
        "pub_date": "2010/7/26",
        "description": "Multistage cyber attacks may target services of different types, often indicating their behavior or capability of penetrating into the network. A significant enhancement to network defenses will be to recognize the different classes of multistage attacks, allowing timely and effective anticipation of future attacks. Drawing analogies from social networking analysis, this work proposes a methodology that clusters cyber attacks based on the `significant services' being exploited. From transforming the attacked services to utilizing the Divisive Hierarchical Clustering algorithm, the proposed method is able to identify sub-communities of attacks that share common characteristics. Experiment results demonstrate a high modularity for the identified community structure. Novel discoveries are also made possible by examining the attack clusters and the resulting dendrogram.",
        "citations": 7
    },
    {
        "title": "Enhancing situation awareness via automated situation assessment",
        "id": "flJTFn4AAAAJ:-f6ydRqryjwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:-f6ydRqryjwC",
        "authors": [
            "Jared Holsopple",
            "Moises Sudit",
            "Michael Nusinov",
            "Daniel F Liu",
            "Haitao Du",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "IEEE Communications Magazine",
        "pub_date": "2010/3/18",
        "description": "The human cognitive process of situation awareness is limited to the amount of data and the level of complexity between the data elements. Situation assessment, encompassing automated threat and impact assessment, shall assist human analysts by estimating the critical activities and objects in an emerging situation. The existing work on situation assessment, while serving its individual purposes, is not driven explicitly by the need to enhance situation awareness. This article provides a summary of various related work, ranging from visualization to algorithmic threat projection, and describes a human-centered framework that associates situation assessment processes and models with requirements needed to enhance situation awareness.",
        "citations": 49
    },
    {
        "title": "Dynamic creation of social networks for syndromic surveillance using information fusion",
        "id": "flJTFn4AAAAJ:_kc_bZDykSQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:_kc_bZDykSQC",
        "authors": [
            "Jared Holsopple",
            "Shanchieh Yang",
            "Moises Sudit",
            "Adam Stotz"
        ],
        "pub_source": "Advances in Social Computing: Third International Conference on Social Computing, Behavioral Modeling, and Prediction, SBP 2010, Bethesda, MD, USA, March 30-31, 2010. Proceedings 3",
        "pub_date": "2010",
        "description": "To enhance the effectiveness of health care, many medical institutions have started transitioning to electronic health and medical records and sharing these records between institutions. The large amount of complex and diverse data makes it difficult to identify and track relationships and trends, such as disease outbreaks, from the data points. INFERD: Information Fusion Engine for Real-Time Decision-Making is an information fusion tool that dynamically correlates and tracks event progressions. This paper presents a methodology that utilizes the efficient and flexible structure of INFERD to create social networks representing progressions of disease outbreaks. Individual symptoms are treated as features allowing multiple hypothesis being tracked and analyzed for effective and comprehensive syndromic surveillance."
    },
    {
        "title": "ViSAw: Visualizing threat and impact assessment for enhanced situation awareness",
        "id": "flJTFn4AAAAJ:qUcmZB5y_30C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:qUcmZB5y_30C",
        "authors": [
            "Michael Nusinov",
            "Shanchieh Jay Yang",
            "Jared Holsopple",
            "Moises Sudit"
        ],
        "pub_source": "MILCOM 2009-2009 IEEE Military Communications Conference",
        "pub_date": "2009/10/18",
        "description": "Situation awareness relies on a combined knowledge of the environment, friendly actions and adversaries' actions. Impact assessment applies that knowledge to estimate the consequences of those actions and anticipate plausible futures. In domains such as asymmetric warfare and cyber security, timely and comprehensive impact assessment is critical for human analysts to develop situation awareness and thus make informed decisions. This work investigates critical visual elements that will enhance situation awareness and how to display these elements. Our approach leverages results of threat and impact assessment of ongoing situations. These include changes in effects of activities on assets and mission, and the projection of current situations into the future. While other visualization tools have focused on representing asset and event data in a meaningful way, this visualization attempts to display impact and …",
        "citations": 11
    },
    {
        "title": "Designing a data fusion system using a top-down approach",
        "id": "flJTFn4AAAAJ:Se3iqnhoufwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:Se3iqnhoufwC",
        "authors": [
            "Jared Holsopple",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "MILCOM 2009-2009 IEEE Military Communications Conference",
        "pub_date": "2009/10/18",
        "description": "While there are multiple reference models for data fusion, there are no formal processes in which to design a complete fusion system. Even though high-level fusion, i.e., impact and threat assessment, is included in the various models, the majority of data fusion research has focused on low-level data fusion such as sensing and correlation. More importantly, low-level fusion technologies have been designed without detailed consideration of threat and impact assessment requirements. On the other hand, high-level designs are restricted by the available data from low-level systems. This disconnected practice has presented tremendous challenges for designing an effective overall fusion system that would truly enhance situation awareness. This paper proposes a top-down fusion system design process in which the elements needed for situation awareness will drive the design requirements for environment/terrain …",
        "citations": 10
    },
    {
        "title": "Toward unsupervised classification of non-uniform cyber attack tracks",
        "id": "flJTFn4AAAAJ:maZDTaKrznsC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:maZDTaKrznsC",
        "authors": [
            "Haitao Du",
            "Christopher Murphy",
            "Jordan Bean",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2009 12th International Conference on Information Fusion",
        "pub_date": "2009/7/6",
        "description": "As adversary activities move into cyber domains, attacks are not necessarily associated with physical entities. As a result, observations of an enemy's course of action (eCoA) may be sporadic, or non-uniform, with potentially more missing and noisy data. Traditional classification methods, in this case, can become ineffective to differentiate correlated observations or attack tracks. This paper formalizes this new challenge and discusses three solution approaches from seemingly unrelated fields. This attempt sheds new light to the problem of classifying unknown types of non-uniform cyber attack tracks.",
        "citations": 14
    },
    {
        "title": "Elements of impact assessment: a case study with cyber attacks",
        "id": "flJTFn4AAAAJ:_FxGoFyzp5QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:_FxGoFyzp5QC",
        "authors": [
            "Shanchieh Jay Yang",
            "Jared Holsopple",
            "Daniel Liu"
        ],
        "pub_source": "Intelligent Sensing, Situation Management, Impact Assessment, and Cyber-Sensing",
        "pub_date": "2009/5/19",
        "description": "Extensive discussions have taken place in recent year regarding impact assessment - what is it and how can we do it? It is especially intriguing in this modern era where non-traditional warfare has caused either information overload or limited understanding of adversary doctrines. This work provides a methodical discussion of key elements for the broad definition of impact assessment (IA). The discussion will start with a process flow involving components related to IA. Two key functional components, impact estimation and threat projection, are compared and illustrated in detail. These details include a discussion of when to model red and blue knowledge. Algorithmic approaches will be discussed, augmented with lessons learned from our IA development for cyber situation awareness. This paper aims at providing the community with a systematic understanding of IA and its open issues with specific examples.",
        "citations": 12
    },
    {
        "title": "Cyber integrated MEMS microhand for biological applications",
        "id": "flJTFn4AAAAJ:8k81kl-MbHgC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:8k81kl-MbHgC",
        "authors": [
            "Adam Weissman",
            "Athena Frazier",
            "Michael Pepen",
            "Yen-Wen Lu",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Micro-and Nanotechnology Sensors, Systems, and Applications",
        "pub_date": "2009/5/11",
        "description": "Anthropomorphous robotic hands at microscales have been developed to receive information and perform tasks for biological applications. To emulate a human hand's dexterity, the microhand requires a master-slave interface with a wearable controller, force sensors, and perception displays for tele-manipulation. Recognizing the constraints and complexity imposed in developing feedback interface during miniaturization, this project address the need by creating an integrated cyber environment incorporating sensors with a microhand, haptic/visual display, and object model, to emulates human hands' psychophysical perception at microscale."
    },
    {
        "title": "National Center for Multi-Source Information Fusion",
        "id": "flJTFn4AAAAJ:a0OBvERweLwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:a0OBvERweLwC",
        "authors": [
            "Jared Holsopple",
            "Shanchieh J Yang",
            "Mike Kuhl",
            "David Hall",
            "Rakesh Nagi",
            "Stu Shapiro",
            "Moises Sudit",
            "Brian Panulla",
            "Mike Kandefer",
            "Patrice Seyed",
            "Zhang Ying",
            "Adhijit Gosavi",
            "Kevin Costantini",
            "Greg Tauer"
        ],
        "pub_source": "DTIC Document",
        "pub_date": "2009/4/1",
        "description": "The National Center for Multisource Information Fusion N-CMIF research was a joint collaboration between CUBRC, University at Buffalo UB, Rochester Institute of Technology RIT and Penn State University PSU to address information fusion research gaps present in situation, threat, and impact assessment JDL levels 2 and 3 as well as sensor management JDL level 4 and visualization. While much of the research conducted under N-CMIF emphasized computer security, the research also aimed to address the problems in a manner applicable to other domains. Major accomplishments in N-CMIF include 1 addressing current gaps in information fusion and computer security 2 the enhancement of the Cyber Attack Simulator a tool to automatically generate cyber attack scenarios for a given computer network 3 Future Situation and Impact Awareness FuSIA a level 23 framework implemented in Java that enhances situation awareness by identifying the current and future impact of a situation as well as providing run-time performance metrics to evaluate the quality of the assessments 4 two different sensor management techniques for computer networks 5 semantic and contextual reasoning of cyber attacks and 6 the visualization of cyber attacks.Descriptors:",
        "citations": 2
    },
    {
        "title": "High level information fusion for tracking and projection of multistage cyber attacks",
        "id": "flJTFn4AAAAJ:W7OEmFMy1HYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:W7OEmFMy1HYC",
        "authors": [
            "Shanchieh J Yang",
            "Adam Stotz",
            "Jared Holsopple",
            "Moises Sudit",
            "Michael Kuhl"
        ],
        "pub_source": "Information Fusion",
        "pub_date": "2009/1/1",
        "description": "The use of computer networks has become a necessity for government, industry, and personal businesses. Protection and defense against cyber attacks on computer networks, however, are becoming inadequate as attackers become more sophisticated and as the networks and systems become more complex. Drawing analogies from other application domains, this paper introduces information fusion to provide situation awareness and threat prediction from massive volumes of sensed data. An in-depth discussion is provided to define fusion tasks for cyber defense. A novel cyber fusion system is proposed to address specifically the tracking and projection of multistage attacks. Critical assessments of the developed attack tracking and threat projection sub-components are provided with simulation results. This pioneering work elaborates the benefits, limitations, and future challenges of high level information fusion …",
        "citations": 113
    },
    {
        "title": "Real-time fusion and projection of network intrusion activity",
        "id": "flJTFn4AAAAJ:hFOr9nPyWt4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:hFOr9nPyWt4C",
        "authors": [
            "Stephen R Byers",
            "Shanchieh J Yang"
        ],
        "pub_source": "2008 11th International Conference on Information Fusion",
        "pub_date": "2008/6/30",
        "description": "Intrusion detection systems (IDS) warn of suspicious or malicious network activity and are a fundamental, yet passive, defense-in-depth layer for modern networks. Prior research has applied information fusion techniques to correlate the alerts of multiple IDSs and group those belonging to the same multi-stage attack into attack tracks. Projecting the next likely step in these tracks potentially enhances an analystpsilas situation awareness; however, the reliance on attack plans, complicated algorithms, or expert knowledge of the respective network is prohibitive and prone to obsolescence with the continual deployment of new technology and evolution of hacker tradecraft. This paper presents a real-time continually learning system capable of projecting attack tracks that does not require a priori knowledge about network architecture or rely on static attack templates. The intrusion projection system is framed as part of a …",
        "citations": 13
    },
    {
        "title": "FuSIA: Future situation and impact awareness",
        "id": "flJTFn4AAAAJ:9yKSN-GCB0IC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:9yKSN-GCB0IC",
        "authors": [
            "Jared Holsopple",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "2008 11th International Conference on Information Fusion",
        "pub_date": "2008/6/30",
        "description": "Recent cyber security research has focused on providing a situation awareness of computer networks by identifying incoming attacks. FuSIA: Future Situation and Impact Awareness seeks to extend this situation awareness via estimating plausible futures of ongoing attacks. Plausible futures, derived based on current progress of attacks, are projected situations that computer security analysts may use to determine appropriate actions for proactive defense. This work discusses the generalized framework of FuSIA as well as its application in cyber intrusion projection. FuSIA adopts application specific contextual information as well as provides flexibility by accommodating multiple projection algorithms. In particular, this paper presents threat projection algorithms via analyzing capability and opportunity of ongoing attacks. Plausibility scores derived from these algorithms are then combined based on Dempster-Shafer …",
        "citations": 60
    },
    {
        "title": "Intrusion activity projection for cyber situational awareness",
        "id": "flJTFn4AAAAJ:dhFuZR0502QC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:dhFuZR0502QC",
        "authors": [
            "Shanchieh J Yang",
            "Stephen Byers",
            "Jared Holsopple",
            "Brian Argauer",
            "Daniel Fava"
        ],
        "pub_source": "2008 IEEE international conference on intelligence and security informatics",
        "pub_date": "2008/6/17",
        "description": "Previous works in the area of network security have emphasized the creation of intrusion detection systems (IDSs) to flag malicious network traffic and computer usage. Raw IDS data may be correlated and form attack tracks, each of which consists of ordered collections of alerts belonging to a single multi-stage attack. Assessing an attack track in its early stage may reveal the attackerpsilas capability and behavior trends, leading to projections of future intrusion activities. Behavior trends are captured via variable length Markov models (VLMM) without predetermined attack plans. A virtual terrain schema is developed to model network and system configurations, and used to estimate critical elements and vulnerabilities exposed to each attacker given his/her progress. Experimental results show promises for these proactive measures in ensuring continuous and critical cyber operations.",
        "citations": 40
    },
    {
        "title": "Projecting cyberattacks through variable-length markov models",
        "id": "flJTFn4AAAAJ:4DMP91E08xMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:4DMP91E08xMC",
        "authors": [
            "Daniel S Fava",
            "Stephen R Byers",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "IEEE Transactions on Information Forensics and Security",
        "pub_date": "2008/6/6",
        "description": "Previous works in the area of network security have emphasized the creation of intrusion detection systems (IDSs) to flag malicious network traffic and computer usage, and the development of algorithms to analyze IDS alerts. One possible byproduct of correlating raw IDS data are attack tracks, which consist of ordered collections of alerts belonging to a single multistage attack. This paper presents a variable-length Markov model (VLMM) that captures the sequential properties of attack tracks, allowing for the prediction of likely future actions on ongoing attacks. The proposed approach is able to adapt to newly observed attack sequences without requiring specific network information. Simulation results are presented to demonstrate the performance of VLMM predictors and their adaptiveness to new attack scenarios.",
        "citations": 118
    },
    {
        "title": "Multi-threat containment with dynamic wireless neighborhood networks",
        "id": "flJTFn4AAAAJ:WF5omc3nYNoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:WF5omc3nYNoC",
        "authors": [
            "Nathan A Ransom",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Intelligent Computing: Theory and Applications VI",
        "pub_date": "2008/4/15",
        "description": "Advances in the areas of robotics have greatly increased the complexity and number of problems that groups of robots are able to solve. This work deals with the use of homogeneous and autonomous robots dynamically forming teams to solve a multi-threat containment problem. The multi-threat containment problem has the robot teams surround a number of threats that may occur randomly. Approaches with and without utilizing wireless communication are proposed and analyzed with a focus on the effects of using wireless. Simulation results show the benefit of the proposed integrated algorithm and its performance in different scenarios.",
        "citations": 1
    },
    {
        "title": "Virtual terrain: a security-based representation of a computer network",
        "id": "flJTFn4AAAAJ:hC7cP41nSMkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:hC7cP41nSMkC",
        "authors": [
            "Jared Holsopple",
            "Shanchieh Yang",
            "Brian Argauer"
        ],
        "pub_source": "Data Mining, Intrusion Detection, Information Assurance, and Data Networks Security 2008",
        "pub_date": "2008/3/17",
        "description": "Much research has been put forth towards detection, correlating, and prediction of cyber attacks in recent years. As this set of research progresses, there is an increasing need for contextual information of a computer network to provide an accurate situational assessment. Typical approaches adopt contextual information as needed; yet such ad hoc effort may lead to unnecessary or even conflicting features. The concept of virtual terrain is, therefore, developed and investigated in this work. Virtual terrain is a common representation of crucial information about network vulnerabilities, accessibilities, and criticalities. A virtual terrain model encompasses operating systems, firewall rules, running services, missions, user accounts, and network connectivity. It is defined as connected graphs with arc attributes defining dynamic relationships among vertices modeling network entities, such as services, users, and machines …",
        "citations": 24
    },
    {
        "title": "VTAC: Virtual terrain assisted impact assessment for cyber attacks",
        "id": "flJTFn4AAAAJ:KlAtU1dfN6UC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:KlAtU1dfN6UC",
        "authors": [
            "Brian J Argauer",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Data Mining, Intrusion Detection, Information Assurance, and Data Networks Security 2008",
        "pub_date": "2008/3/17",
        "description": "Overwhelming intrusion alerts have made timely response to network security breaches a difficult task. Correlating alerts to produce a higher level view of intrusion state of a network, thus, becomes an essential element in network defense. This work proposes to analyze correlated or grouped alerts and determine their 'impact' to services and users of the network. A network is modeled as 'virtual terrain' where cyber attacks maneuver. Overlaying correlated attack tracks on virtual terrain exhibits the vulnerabilities exploited by each track and the relationships between them and different network entities. The proposed impact assessment algorithm utilizes the graph-based virtual terrain model and combines assessments of damages caused by the attacks. The combined impact scores allow to identify severely damaged network services and affected users. Several scenarios are examined to demonstrate the uses of the …",
        "citations": 40
    },
    {
        "title": "Intrusion signature creation via clustering anomalies",
        "id": "flJTFn4AAAAJ:d1gkVwhDpl0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:d1gkVwhDpl0C",
        "authors": [
            "Gilbert R Hendry",
            "Shanchieh J Yang"
        ],
        "pub_source": "Data Mining, Intrusion Detection, Information Assurance, and Data Networks Security 2008",
        "pub_date": "2008/3/17",
        "description": "Current practices for combating cyber attacks typically use Intrusion Detection Systems (IDSs) to detect and block multistage attacks. Because of the speed and impacts of new types of cyber attacks, current IDSs are limited in providing accurate detection while reliably adapting to new attacks. In signature-based IDS systems, this limitation is made apparent by the latency from day zero of an attack to the creation of an appropriate signature. This work hypothesizes that this latency can be shortened by creating signatures via anomaly-based algorithms. A hybrid supervised and unsupervised clustering algorithm is proposed for new signature creation. These new signatures created in real-time would take effect immediately, ideally detecting new attacks. This work first investigates a modified density-based clustering algorithm as an IDS, with its strengths and weaknesses identified. A signature creation algorithm …",
        "citations": 47
    },
    {
        "title": "Terrain and behavior modeling for projecting multistage cyber attacks",
        "id": "flJTFn4AAAAJ:TQgYirikUcIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:TQgYirikUcIC",
        "authors": [
            "Daniel Fava",
            "Jared Holsopple",
            "Shanchieh Jay Yang",
            "Brian Argauer"
        ],
        "pub_source": "2007 10th International Conference on Information Fusion",
        "pub_date": "2007/7/9",
        "description": "Contributions from the information fusion community have enabled comprehensible traces of intrusion alerts occurring on computer networks. Traced or tracked cyber attacks are the bases for threat projection in this work. Due to its complexity, we separate threat projection into two sub-tasks: predicting likely next targets and predicting attacker behavior. A virtual cyber terrain is proposed for identifying likely targets. Overlaying traced alerts onto the cyber terrain reveals exposed vulnerabilities, services, and hosts. Meanwhile, a novel attempt to extract cyber attack behavior is discussed. Leveraging traditional work on prediction and compression, this work identities behavior patterns from traced cyber attack data. The extracted behavior patterns are expected to further refine projections deduced from the cyber terrain.",
        "citations": 27
    },
    {
        "title": "The effect of collision avoidance for autonomous robot team formation",
        "id": "flJTFn4AAAAJ:EUQCXRtRnyEC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:EUQCXRtRnyEC",
        "authors": [
            "Mark H Seidman",
            "Shanchieh J Yang"
        ],
        "pub_source": "Unmanned Systems Technology IX",
        "pub_date": "2007/5/2",
        "description": "As technology and research advance to the era of cooperative robots, many autonomous robot team algorithms have emerged. Shape formation is a common and critical task in many cooperative robot applications. While theoretical studies of robot team formation have shown success, it is unclear whether such algorithms will perform well in a real-world environment. This work examines the effect of collision avoidance schemes on an ideal circle formation algorithm, but behaves similarly if robot-to-robot communications are in place. Our findings reveal that robots with basic collision avoidance capabilities are still able to form into a circle, under most conditions. Moreover, the robot sizes, sensing ranges, and other critical physical parameters are examined to determine their effects on algorithm's performance."
    },
    {
        "title": "Evaluating threat assessment for multi-stage cyber attacks",
        "id": "flJTFn4AAAAJ:YsMSGLbcyi4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:YsMSGLbcyi4C",
        "authors": [
            "Shanchieh Jay Yang",
            "Jared Holsopple",
            "Moises Sudit"
        ],
        "pub_source": "MILCOM 2006-2006 IEEE Military Communications conference",
        "pub_date": "2006/10/23",
        "description": "Current practices to defend against cyber attacks are typically reactive yet passive. Recent research work has been proposed to proactively predict hacker's target entities in the early stage of the attack. With prediction, there comes false alarms and missed attacks. Very little has been reported on how to evaluate a threat assessment algorithm, especially for cyber security. Because of the variety and the constantly changing nature of hacker behavior and network vulnerabilities, a cyber threat assessment algorithm is, perhaps more susceptible that for other application domains. This work sets forth the issues on evaluating cyber threat assessment algorithms, and discusses the validity of various statistical measures. Simulation examples are provided to illustrate the pros and cons of using different metrics under various cyber attack scenarios. Our results show that commonly used false positives and false negatives are …",
        "citations": 35
    },
    {
        "title": "TANDI: Threat assessment of network data and information",
        "id": "flJTFn4AAAAJ:Zph67rFs4hoC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:Zph67rFs4hoC",
        "authors": [
            "Jared Holsopple",
            "Shanchieh Jay Yang",
            "Moises Sudit"
        ],
        "pub_source": "Multisensor, Multisource Information Fusion: Architectures, Algorithms, and Applications 2006",
        "pub_date": "2006/4/18",
        "description": "Current practice for combating cyber attacks typically use Intrusion Detection Sensors (IDSs) to passively detect and block multi-stage attacks. This work leverages Level-2 fusion that correlates IDS alerts belonging to the same attacker, and proposes a threat assessment algorithm to predict potential future attacker actions. The algorithm, TANDI, reduces the problem complexity by separating the models of the attacker's capability and opportunity, and fuse the two to determine the attacker's intent. Unlike traditional Bayesian-based approaches, which require assigning a large number of edge probabilities, the proposed Level-3 fusion procedure uses only 4 parameters. TANDI has been implemented and tested with randomly created attack sequences. The results demonstrate that TANDI predicts future attack actions accurately as long as the attack is not part of a coordinated attack and contains no insider threats. In …",
        "citations": 63
    },
    {
        "title": "TANDI: threat assessment of network data and information [6242-23]",
        "id": "flJTFn4AAAAJ:nb7KW1ujOQ8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:nb7KW1ujOQ8C",
        "authors": [
            "J Holsopple",
            "SJ Yang",
            "M Sudit"
        ],
        "pub_source": "PROCEEDINGS-SPIE THE INTERNATIONAL SOCIETY FOR OPTICAL ENGINEERING",
        "pub_date": "2006"
    },
    {
        "title": "Field programmable gate array implementation of Reed-Solomon code, RS (255,239)",
        "id": "flJTFn4AAAAJ:J_g5lzvAfSwC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:J_g5lzvAfSwC",
        "authors": [
            "Kenny Chung Chung Wai",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "Xelic Inc., Pittsford, New York",
        "pub_date": "2006",
        "description": "This paper demonstrates an FPGA implementation of the Reed-Solomon, RS (255,239), codec architecture for the OTN G. 709. The RS codec is designed to occupy the least amount of logic blocks, be fast and parameterizable. I am presenting an efficient implementation of the encoder algorithm on reconfigurable devices in addition to a non-finalized version of the decoder. Both encoder and decoder are synthesized to Altera’s StratixII and benchmarks are run against Altera’s Reed Solomon Code. Xelic’s encoder is measured to be about half the size of Altera’s encoder. Effort on optimizing Xelic’s decoder is underway to have an efficient implementation of the decoder algorithm.",
        "citations": 15
    },
    {
        "title": "High level fusion in the cyber domain",
        "id": "flJTFn4AAAAJ:ns9cj8rnVeAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:ns9cj8rnVeAC",
        "authors": [
            "M Sudit",
            "S Yang",
            "M Kuhl",
            "A Stotz",
            "M Holender",
            "J Holsopple",
            "E Bohannon",
            "J Kistner"
        ],
        "pub_source": "DTIC Document, Tech. Rep.",
        "pub_date": "2005",
        "citations": 5
    },
    {
        "title": "Application of particle swarm techniques in sensor network configuration",
        "id": "flJTFn4AAAAJ:ULOm3_A8WrAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:ULOm3_A8WrAC",
        "authors": [
            "Jason Tillett",
            "Shanchieh Jay Yang",
            "Raghuveer Rao",
            "Ferat Sahin"
        ],
        "pub_source": "Unattended Ground Sensor Technologies and Applications VII",
        "pub_date": "2005/5/27",
        "description": "A decentralized version of particle swarm optimization called the distributed particle swarm optimization (DPSO) approach is formulated and applied to the generation of sensor network configurations or topologies so that the deleterious effects of hidden nodes and asymmetric links on the performance of wireless sensor networks are minimized.  Three different topology generation schemes, COMPOW, Cone-Based and the DPSO--based schemes are examined using ns-2. Simulations are executed by varying the node density and traffic rates. Results contrasting heterogeneous vs. homogeneous power reveal that an important metric for a sensor network topology may involve consideration of hidden nodes and asymmetric links, and demonstrate the effect of spatial reuse on the potency of topology generators.",
        "citations": 5
    },
    {
        "title": "Energy efficient multi-mode operation for networked wireless sensors",
        "id": "flJTFn4AAAAJ:TFP_iSt0sucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:TFP_iSt0sucC",
        "authors": [
            "Shanchieh Jay Yang",
            "Niranjan Krishnamurthi",
            "Cory D Cress",
            "Moises Sudit"
        ],
        "pub_source": "IEEE VEHICULAR TECHNOLOGY CONFERENCE",
        "pub_date": "2005/1/1",
        "description": "This paper aims at developing a comprehensive model for optimal multi-mode wireless sensor operations. We start by proposing a maximum data retrieval (MDR) problem that jointly optimizes the routing and scheduling decisions over time for multi-mode wireless sensors. Attempting to solve the general yet extremely complex problem leads to observations and analysis of optimal store-and-forward (S&F) operations for individual sensors in an ideal setting. Our analytical model for the S&F operation provides not only closed form expressions in estimating sensor lifetime and total transmission, but also insights on developing a simpler flow distribution problem that could approximate the MDR problem. Heuristic procedures are then developed to demonstrate the feasibility of having the sensors perform in S&F cycles. Our simulation shows that these heuristics achieves performance close to theoretical estimates derived based on the S&F operation analysis."
    },
    {
        "title": "Optimal topologies for wireless sensor networks",
        "id": "flJTFn4AAAAJ:IjCSPb-OGe4C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:IjCSPb-OGe4C",
        "authors": [
            "Jason C Tillett",
            "Shanchieh Jay Yang",
            "Raghuveer M Rao",
            "Ferat Sahin"
        ],
        "pub_source": "Unmanned/Unattended Sensors and Sensor Networks",
        "pub_date": "2004/11/30",
        "description": "Since untethered sensor nodes operate on battery, and because they must communicate through a multi-hop network, it is vital to optimally configure the transmit power of the nodes both to conserve power and optimize spatial reuse of a shared channel. Current topology control algorithms try to minimize radio power while ensuring connectivity of the network. We propose that another important metric for a sensor network topology will involve consideration of hidden nodes and asymmetric links. Minimizing the number of hidden nodes and asymmetric links at the expense of increasing the transmit power of a subset of the nodes may in fact increase the longevity of the sensor network. In this paper we explore a distributed evolutionary approach to optimizing this new metric. Inspiration from the Particle Swarm Optimization technique motivates a distributed version of the algorithm. We generate topologies with fewer …",
        "citations": 13
    },
    {
        "title": "Energy efficient data retrieval for networked multi-mode wireless sensors",
        "id": "flJTFn4AAAAJ:qxL8FJ1GzNcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:qxL8FJ1GzNcC",
        "authors": [
            "Cory C Cress",
            "Shanchieh J Yang",
            "Moises Sudit"
        ],
        "pub_source": "Proceedings of the 1st ACM international workshop on Performance evaluation of wireless ad hoc, sensor, and ubiquitous networks",
        "pub_date": "2004/10/4",
        "description": "This paper develops a mixed-integer programming model to maximize the total data retrieved via a wireless sensor networks, subject to the practical network and individual multi-mode sensor constraints. The model is different from existing ones in that it accounts for the buffer usage over time and the energy spikes incurred due to transitions between the operational modes. Heuristic procedures are developed for solving the NP-Hard problem. Simulation results exhibit that good performance can be achieved when the routing and MAC decisions are made based on individual sensors' buffer content and residual energy.",
        "citations": 4
    },
    {
        "title": "Enhancing both network and user performance for networks supporting best effort traffic",
        "id": "flJTFn4AAAAJ:mB3voiENLucC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:mB3voiENLucC",
        "authors": [
            "Shanchieh Jay Yang",
            "Gustavo de Veciana"
        ],
        "pub_source": "IEEE/ACM Transactions on Networking",
        "pub_date": "2004/4/19",
        "description": "With a view on improving user-perceived performance on networks supporting best effort flows, e.g., multimedia/data file transfers, we propose a family of bandwidth allocation criteria that depends on the residual work of on-going transfers. Analysis and simulations show that allocating bandwidth in this fashion can significantly improve the user-perceived delay, bit transmission delay, and throughput over traditional approaches, e.g., by 58% on an 80% loaded linear network. A simple implementation based on TCP Reno, exemplifies how one might approach practically realizing such gains. We discuss several other advantages of incorporating such differentiation at the transport level. In particular we make the case that favoring small transfers combined with user impatience or peak rate constraints, both of which are natural mechanisms for users to express the utility of completing transfers, offers a lightweight …",
        "citations": 45
    },
    {
        "title": "Modular topology control and energy model for wireless ad hoc sensor networks",
        "id": "flJTFn4AAAAJ:L8Ckcad2t8MC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:L8Ckcad2t8MC",
        "authors": [
            "Niranjan Krishnamurthi",
            "Shanchieh Jay Yang",
            "Mark Seidman"
        ],
        "pub_source": "Online Proceedings of OPNETWORK Š04, 0",
        "pub_date": "2004",
        "description": "Networked wireless sensors in a harsh terrain typically are battery operated and, therefore, require energy efficient network protocols. In order to ease the analysis of the energy usage of proposed network protocols, this paper proposes an energy module, implemented in OPNET, to determine the energy consumption over time during network simulation. Multiple energy consumption modes, such as transmit, idle, sleep modes are all accounted for. A sensor node will be automatically turned off (disabled) in the middle of simulation if it runs out of the user-specified energy. The energy module provides function calls for network protocols implemented in OPNET, and therefore allows performance evaluation in terms of the energy efficiency. Among other protocols, this paper focuses on the topology control schemes, which has individual wireless sensors determine their own transmission power levels while maintaining network connectivity. In order to allow the adjustment of transmission power level having an effect on the transmission range, this paper investigates necessary modifications on the Closure Pipeline stage in OPNET. A simple topology control scheme is implemented for validation purposes. Simulation results will be presented in this paper to exhibit the effect of the closure stage modification as well as the energy modules.",
        "citations": 5
    },
    {
        "title": "Size-based adaptive bandwidth allocation: Optimizing the average QoS for elastic flows",
        "id": "flJTFn4AAAAJ:isC4tDSrTZIC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:isC4tDSrTZIC",
        "authors": [
            "Shanchieh Yang",
            "Gustavo De Veciana"
        ],
        "pub_source": "Proceedings. Twenty-First Annual Joint Conference of the IEEE Computer and Communications Societies",
        "pub_date": "2002/6/23",
        "description": "With a view on improving user perceived performance on networks supporting elastic flows, e.g., multimedia/data file transfers, we identify the key properties that an online dynamic bandwidth allocation policy should have. We then propose a family of bandwidth allocation criteria which depends on the residual work of on-going transfers. Analysis and simulations show that allocating bandwidth in this fashion can improve the user perceived average bit transmission delay (BTD), i.e., delay/flow size, by up to 70% at 80% traffic load over traditional approaches. A simple implementation based upon TCP Reno, exemplifies how one might approach practically realizing such gains. Further studies on simple network topologies show that as the penetration of the proposed transport mechanism increases, users will have the proper incentives to upgrade from TCP Reno, and that the overall performance is better for all users …",
        "citations": 81
    },
    {
        "title": "Bandwidth sharing: The role of user impatience",
        "id": "flJTFn4AAAAJ:5nxA0vEk-isC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:5nxA0vEk-isC",
        "authors": [
            "Shanchieh Yang",
            "Gustavo de Veciana"
        ],
        "pub_source": "GLOBECOM'01. IEEE Global Telecommunications Conference (Cat. No. 01CH37270)",
        "pub_date": "2001/11/25",
        "description": "Empirical work has shown that up to 20% of the volume transferred on data networks might correspond to 'aborted' connections, i.e., badput. With this in mind, we propose two generic models that capture a variety of user impatience behaviors and investigate their impact on user perceived and actual system performance achieved by various bandwidth sharing schemes. Our study suggests that differentiated bandwidth allocation based on job size, rather than using traditional fair share allocations, results in a more 'graceful' performance degradation and, particularly in the presence of impatient users, leads to better network efficiency as well as user perceived performance.",
        "citations": 39
    },
    {
        "title": "Heterogeneity-aware shortest path routing: flow holding time, user demand and network state",
        "id": "flJTFn4AAAAJ:blknAaTinKkC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:blknAaTinKkC",
        "authors": [
            "Shanchieh Yang",
            "Xun Su",
            "Gustavo De Veciana"
        ],
        "pub_source": "2001 IEEE Workshop on High Performance Switching and Routing (IEEE Cat. No. 01TH8552)",
        "pub_date": "2001/5/29",
        "description": "We investigate possible performance improvements by exploring heterogeneity of traffic characteristics when designing a shortest path routing scheme. First we focus on the effect of the maintenance of the link metrics for connections with different holding times. We found that by using a differentiated routing scheme with respect to connection holding times, one can enhance network performance for a range of traffic loads. Second we propose a selective routing control scheme which determines whether to accept a shortest path routing decision based on user demands in the (source, destination, bandwidth request) tuple. Simulations were conducted to exhibit the effectiveness of such a routing algorithm. Finally, realizing the difference in routing \"local\" versus \"transit\" traffic, we present a novel approach to aggregate network state by drawing on an analogy to circuit theory. The proposed \"effective capacity\" …",
        "citations": 3
    },
    {
        "title": "Flow-size based differentiation to enhance user-perceived performance on networks supporting best-effort traffic",
        "id": "flJTFn4AAAAJ:RYcK_YlVTxYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:RYcK_YlVTxYC",
        "authors": [
            "Shan-chieh Yang"
        ],
        "pub_source": "The University of Texas at Austin",
        "pub_date": "2001",
        "description": "A fundamental, yet usually ignored, challenge to evolving data networks is enabling better Quality of Service (QoS) for best effort traffic. While over-provisioning network resources was considered to be a simple, possibly less expensive solution, the lack of fairly predictable Internet traffic and growth model makes it almost impossible to ensure an “efficiently” dimensioned network. Even if a single carrier could overcome this problem and appropriately provision his network, the heterogeneity of the inter-networking infrastructure would make coordinating inter-carrier agreements to avoid mismatches exceedingly difficult. Recognizing that over-provisioning is at most a partial solution, we approach the problem by “intelligently” share resources that extends the “dynamic range” of traffic loads where networks can ensure adequate system and user perceived performance."
    },
    {
        "title": "Enhancing Both Network and User Performance Metrics for Networks Supporting Best Effort Traffic",
        "id": "flJTFn4AAAAJ:u5HHmVD_uO8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:u5HHmVD_uO8C",
        "authors": [
            "Gustavo de Veciana",
            "Shanchieh Yang"
        ],
        "pub_source": "PROCEEDINGS OF THE ANNUAL ALLERTON CONFERENCE ON COMMUNICATION CONTROL AND COMPUTING",
        "pub_date": "2001",
        "description": "With a view on improving user perceived performance on networks supporting best effort flows, eg, multimedia/data file transfers, we propose a family of bandwidth allocation criteria which depends on the residual work of on-going transfers. Analysis and simulations show that allocating bandwidth in this fashion can significantly improve the user perceived, delay, bit transmission delay, or throughput over traditional approaches, eg, 58% for a link which is 80% loaded. A simple implementation based upon TCP Reno, exemplifies how one might approach practically realizing such gains. We discuss several other advantages of incorporating such differentiation at the transport level. In particular we make the case that favoring shorter transfers combined with user impatience or peak rate constraints, both of which are natural mechanisms for users to express the utility of their transfers, offers a lightweight approach to achieving good overall network goodput and/or utility for best effort networks.",
        "citations": 1
    },
    {
        "title": "Traffic dispersion for bursty traffic on heterogeneous networks",
        "id": "flJTFn4AAAAJ:ufrVoPGSRksC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:ufrVoPGSRksC",
        "authors": [
            "Shan-chieh Yang"
        ],
        "pub_source": "University of Texas at Austin",
        "pub_date": "1998/4/30",
        "description": "During the past few years, multimedia traffic, such as video, audio, and graphics, has gradually shown the potential for becoming the dominant traffic on communication networks. With advanced compression techniques, eg, MPEG [5], multimedia traffic usually has a data rate which varies dramatically over time. In packet switching networks, the network resources, eg, bandwidth and buffer, are typically statistically shared by a number of variable rate connections in order to achieve higher utilization given a fixed QoS constraint. Such sharing of resources is usually called statistical multiplexing. The key to achieve efficient multiplexing is to maximize the number of connections which share the resources. However, on a resource limited network, the QoS constraints on multimedia traffic often limit the number of connections sharing the resources and thus decrease network utilization. This is due to the fact that multimedia traffic usually has big “bursts” which could be in general interpreted as data arrives in high peak rate for a period of time. Thus, limited bandwidth and buffer resources can only accommodate a few connections sending bursts at the same time and therefore statistical multiplexing is less efficient. Similarly a recent proposed technique called Frame Bursting for CSMA/CD on Gigabit Ethernet [14] also has the potential to generate bursty flows by combining and sending multiple frames as a burst. To solve the network utilization problem that are likely to arise in future networks combining multimedia traffic and/or Gigabit Ethernet, we can either further increase the system capacity unlimitedly or take proactive steps to smooth out bursty traffic …",
        "citations": 4
    },
    {
        "title": "Reactive bandwidth arbitration for priority and multicasting control in ATM switching",
        "id": "flJTFn4AAAAJ:ZeXyd9-uunAC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:ZeXyd9-uunAC",
        "authors": [
            "Shu-Jen Fang",
            "Yu-Sheng Lin",
            "Shan-Chieh Yang",
            "C Bernard Shung"
        ],
        "pub_source": "Proceedings of ICC'97-International Conference on Communications",
        "pub_date": "1997/6/12",
        "description": "A new service scheduling scheme, reactive bandwidth arbitration (RBA), is proposed as an effective way to arbitrate the contention among priority classes or between unicast and multicast services in ATM switching. The RBA scheme integrates two previously proposed concepts: bandwidth allocation and reactive arbitration. In, RBA, guaranteed bandwidth is allocated to a connection at call set up based on the traffic characteristics and service requirements, while the arbitration of cell delivery takes into account the queue status to react to traffic fluctuation. Through simulation, we found that by bandwidth allocation, a set of queue threshold levels can be obtained to provide a good approximation to the desired delay performance. Furthermore, around this initial configuration, a linear relationship between the queue threshold and the resulting delay performance can be established to fine-tune the configuration …",
        "citations": 1
    },
    {
        "title": "VLSI design of a priority arbitrator for shared buffer ATM switches",
        "id": "flJTFn4AAAAJ:M3ejUd6NZC8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:M3ejUd6NZC8C",
        "authors": [
            "Yu-Sheng Lin",
            "Shan-Chieh Yang",
            "Su-Jen Fang",
            "C Bernard Shung"
        ],
        "pub_source": "1997 IEEE International Symposium on Circuits and Systems (ISCAS)",
        "pub_date": "1997/6/12",
        "description": "Priority arbitration is an essential part of the ATM switches in order to support the integration of telecommunication services with difference characteristics. Service priority control selects the connection to output a cell among all connections destined to the same output port. Discard priority control selects the connection to discard a cell when the shared buffer is full. In this paper we present a VLSI design of a priority arbitrator for shared buffer ATM switches. This priority arbitrator is targeted to support our new service priority control scheme, reactive bandwidth arbitration (RBA), and new discard priority control scheme, local pushout discarding (LPD). The priority arbitrator is designed for an 8/spl times/8 shared buffer ATM switch with four priority classes per port and a link rate of 622 Mbps. The chip has 130 k gates in a chip area of 137.88 mm/sup 2/ using 0.6 /spl mu/m CMOS technology.",
        "citations": 4
    },
    {
        "title": "The Road Towards Autonomous Cybersecurity Agents: Remedies for Simulation Environments [version before shortening, contains more detailed comparison between CybORG and CYST]",
        "id": "flJTFn4AAAAJ:B3FOqHPlNUQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:B3FOqHPlNUQC",
        "authors": [
            "Martin Drašar",
            "Ádám Ruman",
            "Pavel Čeleda",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "One of the fundamental challenges in developing autonomous cybersecurity agents (AICA) is providing them with appropriate training environments for skills acquisition and evaluation. Current reinforcement learning (RL) algorithms rely on myriads of training runs to instill proper behavior, and this is reasonably achievable only within a simulated environment. In this paper, we explore the topic of simulation models and environments for RL and compile a set of properties and goals necessary to aid the development of AICA with real-world deployability. We also present an assessment framework to compare simulation models designed for simulating cyberattack scenarios. We examine four existing simulation tools, including a new one by the authors of the paper, and discuss their properties, particularly in terms of deployability, to support RL-based AICA. On the example of complex scenarios, we compare in-depth the two most sophisticated simulation tools and discuss their strengths. The paper thus contributes to the state-of-the-art by introducing a theoretical framework for evaluating RL-focused simulation environments, surveying the currently available environments, and introducing and evaluating a novel and complex simulation environment for next-generation autonomous cybersecurity systems."
    },
    {
        "title": "High level information fusion for tracking and projection of multistage",
        "id": "flJTFn4AAAAJ:pyW8ca7W8N0C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:pyW8ca7W8N0C",
        "authors": [
            "Shanchieh J Yang",
            "Adam Stotz",
            "Jared Holsopple",
            "Moises Sudit",
            "Michael Kuhl"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "12 The use of computer networks has become a necessity for government, industry, and personal businesses. Protection and defense 13 against cyber attacks on computer networks, however, are becoming inadequate as attackers become more sophisticated and as the net-14 works and systems become more complex. Drawing analogies from other application domains, this paper introduces information fusion 15 to provide situation awareness and threat prediction from massive volumes of sensed data. An in-depth discussion is provided to define 16 fusion tasks for cyber defense. A novel cyber fusion system is proposed to address specifically the tracking and projection of multistage 17 attacks. Critical assessments of the developed attack tracking and threat projection sub-components are provided with simulation results. 18 This pioneering work elaborates the benefits, limitations, and future challenges of high level information fusion for cyber security. 19© 2007 Elsevier BV All rights reserved."
    },
    {
        "title": "ViSAw: Visualizing threat and impact assessment for enhanced situation awareness",
        "id": "flJTFn4AAAAJ:D03iK_w7-QYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:D03iK_w7-QYC",
        "authors": [
            "Shanchieh J Yang",
            "Moises Sudit"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Situation awareness relies on a combined knowledge of the environment, friendly actions and adversaries’ actions. Impact assessment applies that knowledge to estimate the consequences of those actions and anticipate plausible futures. In domains such as asymmetric warfare and cyber security, timely and comprehensive impact assessment is critical for human analysts to develop situation awareness and thus make informed decisions. This work investigates critical visual elements that will enhance situation awareness and how to display these elements. Our approach leverages results of threat and impact assessment of ongoing situations. These include changes in effects of activities on assets and mission, and the projection of current situations into the future. While other visualization tools have focused on representing asset and event data in a meaningful way, this visualization attempts to display impact and threat to assets and missions."
    },
    {
        "title": "Multi-threat containment with autonomous formation of robot teams",
        "id": "flJTFn4AAAAJ:zA6iFVUQeVQC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:zA6iFVUQeVQC",
        "authors": [
            "Shanchieh Jay Yang",
            "Nathan A Ransom",
            "Bhushan Mehendale"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "Technological advances in many scientific fields have enabled cost-effective robots to perform tasks cooperatively and without human supervision. For example, distributed swarmlike behaviors and wireless communication provide opportunities to solve problems such as toxic chemical spills and wildfire containment, hazardous scenarios where human intervention would be risky or even impossible. Coupling wireless networking and simple yet efficient swarm intelligence, a truly decentralized solution has now been developed where robots dynamically form cooperative teams to tackle multiple threats or minimize their impact quickly and efficiently. Figure 1 shows an example of three threats contained by teams of robots.Robot teams have been tried in terrain exploration, 1 target tracking, 2 target pursuit3 and the coordinated movement of objects. 4, 5 More recently, the containment of immobile and mobile threats has drawn attention to the potential of cooperative robotics. For example, Cui and colleagues used robot swarms to localize the emission source of an aerosol threat, but required the robots to work as a single team and to treat only a single source. The group of Stancil considered multiple threats, but the robot actions were coordinated by a central controller processing images transmitted from cameras mounted on each robot. Facing multiple threats in a potentially widespread terrain, each robot in our solution uses its sensors to gather local information, exchange wireless messages, make autonomous decisions to establish or join a threat containment team, and then dissolve the team after the threat is successfully contained."
    },
    {
        "title": "Characterization of Cyber Attack Actions through Variable Length Markov Models",
        "id": "flJTFn4AAAAJ:rO6llkc54NcC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:rO6llkc54NcC",
        "authors": [
            "Daniel S Fava",
            "Shanchieh Jay Yang"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "BackgroundThe increase in network bandwidth, the emergence of wireless technologies and the spread of the Internet throughout the world have created new forms of communication with effects on areas such as business, entertainment and education. This pervasion of computer networks into human activity has amplified the importance of cyber security."
    },
    {
        "title": "Enhancing Both Network and User Performance",
        "id": "flJTFn4AAAAJ:YFjsv_pBGBYC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:YFjsv_pBGBYC",
        "authors": [
            "Shanchieh Jay Yang",
            "Gustavo de Veciana"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "With a view on improving user perceived performance on networks supporting best effort flows, eg, multimedia/data file transfers, we propose a family of bandwidth allocation criteria that depends on the residual work of on-going transfers. Analysis and simulations show that allocating bandwidth in this fashion can significantly improve the user perceived delay, bit transmission delay, and throughput over traditional approaches, eg, by 58% on an 80% loaded linear network. A simple implementation based on TCP Reno, exemplifies how one might approach practically realizing such gains. We discuss several other advantages of incorporating such differentiation at the transport level. In particular we make the case that favoring small transfers combined with user impatience or peak rate constraints, both of which are natural mechanisms for users to express the utility of completing transfers, offers a lightweight approach to achieving good overall network goodput and/or utility for best effort networks."
    },
    {
        "title": "Modeling and Simulation of Gossip-Based Relayed Network for Ubiquitous and Expanded Access",
        "id": "flJTFn4AAAAJ:YOwf2qJgpHMC",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:YOwf2qJgpHMC",
        "authors": [
            "Sungho Maeung",
            "Shanchieh Jay Yang",
            "Nirmala Shenoy"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "The need for ubiquitous access even in a harsh terrain presents a challenge to provide extended coverage using lightweight, costefficient, and easy-to-deploy wireless devices. Due to the simplicity of the tasks performed by these devices, it is not justified to dynamically determine the routes as typical routing protocols do. This paper proposes a lightweight robust forwarding scheme, called Gossip-Based Relay Protocol (GRP) that allows information to be relayed across a wireless ad hoc network. One or more forwarding paths are determined based on probability functions without explicitly maintaining a routing table. With the possibility of “not” forwarding a message, it also reduces unnecessary flooding and collisions are reduced by adopting a one-time random back-off medium access before transmission without any retries. A simulation model is developed using the OPNET 1Modeler. Performance of GRP is compared against a standard flooding scheme in terms of the message success rate, end-to-end delay, and message flooded in the network. This paper discusses the simulation results as well as the issues associated with topology and network parameters."
    },
    {
        "title": "The Effect of Multi-mode Operations to Routing and Scheduling on Wireless Sensor Networks",
        "id": "flJTFn4AAAAJ:hqOjcs7Dif8C",
        "url": "https://scholar.google.com/citations?hl=en&view_op=view_citation&citation_for_view=flJTFn4AAAAJ:hqOjcs7Dif8C",
        "authors": [
            "Shanchieh Jay Yang",
            "Moises Sudit"
        ],
        "pub_source": "",
        "pub_date": "",
        "description": "This article develops a comprehensive model for optimal data retrieval using multimode wireless sensors in a network setting. The proposed maximum data retrieval (MDR) problem jointly optimizes routing and scheduling decisions over time subject to spatial reuse and sensor resource (energy and storage) constraints. Optimal solutions to sample cases of the NP-Hard MDR problem leads to closed form models of optimal store-andforward (S&F) operations and insights of energy efficient scheduling and routing policies."
    }
]